[
  {
    "DOI": "10.1145/144179.144199",
    "title": "Supporting Real-Time Applications in an Integrated Services Packet Network: Architecture and Mechanism",
    "abstract": "Abstract This  paper  considers  the  support  of  real time   applications in  an   Integrated Services  Packet Network    ISPN    We   rst review  the  characteristics  of real time   applications   We  ob  serve  that   contrary  to  the  popular  view  that  real time   ap  plications necessarily require a  xed delay bound   some real  time  applications  are more  exible and can adapt to current network  conditions  We  then  propose  an  ISPN  architec  ture  that  supports  two  distinct  kinds  of  real time   service  guaranteed   service    which  is  the  traditional  form  of  real  time  service discussed  in  most of the literature  and involves pre computed worst case delay bounds  and  predicted  service which uses the measured performance of the network in com  puting  delay  bounds   We  then  propose  a packet  scheduling  mechanism that can support both of these real time  services as  well  as  accommodate  datagram  tra c    We  also  discuss two  other  aspects  of  an  overall  ISPN  architecture   the  ser  vice  interface  and  the admission  control   criteria ",
    "cite_count": "797",
    "location": {
      "url": "../Conference/1652/sigcomm-acm-sigcomm-conference",
      "name": "ACM SIGCOMM Conference - SIGCOMM"
    },
    "authors": [
      {
        "name": "David D. Clark",
        "msid": "89528"
      },
      {
        "name": "Scott Shenker",
        "msid": "196415"
      },
      {
        "name": "Lixia Zhang",
        "msid": "289843"
      }
    ],
    "id": "100",
    "msid": "1049"
  },
  {
    "title": "Cooperative Mobile Robotics: Antecedents and Directions",
    "abstract": "There has been increased research interest in systems composed of multiple autonomous mobile robots exhibiting cooperative behavior. Groups of mobile robots are constructed, with an aim to studying such issues as group architecture, resource conflict, origin of cooperation, learning, and geometric prob- lems. As yet, few applications of cooperative robotics  have been reported, and supporting theory is still in its formative stages. In this paper, we give a critical survey of existing works and discuss open problems in this field, emphasizing the various theoretical issues that arise in the study of cooperative robotics. We describe the intellectual heritages that have guided early research, as well as possible additions to the set of existing motivations.",
    "cite_count": "584",
    "location": {
      "url": "../Journal/208/arobots-autonomous-robots",
      "name": "Autonomous Robots - AROBOTS"
    },
    "authors": [
      {
        "name": "Y. Uny Cao",
        "msid": "2466735"
      },
      {
        "name": "Alex S. Fukunaga",
        "msid": "1208266"
      },
      {
        "name": "Andrew B. Kahng",
        "msid": "222639"
      }
    ],
    "id": "101",
    "msid": "1417"
  },
  {
    "DOI": "10.1109/MCSA.1994.512726",
    "title": "The Bayou Architecture: support for data sharing among mobile users",
    "cite_count": "256",
    "location": {
      "url": "../Conference/509/wmcsa-workshop-on-mobile-computing-systems-and-applications",
      "name": "Workshop on Mobile Computing Systems and Applications - WMCSA"
    },
    "authors": [
      {
        "name": "Alan Demers",
        "msid": "667281"
      },
      {
        "name": "Karin Petersen",
        "msid": "402963"
      },
      {
        "name": "Mike J. Spreitzer",
        "msid": "967999"
      },
      {
        "name": "Doug Terry",
        "msid": "1062408"
      },
      {
        "name": "Marvin Theimer",
        "msid": "757151"
      },
      {
        "name": "Brent Welch",
        "msid": "1668051"
      }
    ],
    "id": "102",
    "msid": "1866"
  },
  {
    "title": "Self-Similarity in World Wide Web Traffic: Evidence and Possible Causes",
    "cite_count": "2216",
    "location": {
      "url": "../Journal/198/sigmetrics-sigmetrics-performance-evaluation-review",
      "name": "Sigmetrics Performance Evaluation Review - SIGMETRICS"
    },
    "authors": [
      {
        "name": "Mark E. Crovella",
        "msid": "1061436"
      },
      {
        "name": "Azer Bestavros",
        "msid": "1648575"
      }
    ],
    "id": "103",
    "msid": "3373"
  },
  {
    "DOI": "10.1145/938985.938995",
    "title": "Range-free localization schemes for large scale sensor networks",
    "abstract": "Wireless Sensor  Networks have been proposed for a multitude of location-dependent applications. For such systems, the cost and limitations of the hardware on sensing nodes prevent the use of range-based localization schemes that depend on absolute point-to-point distance estimates. Because coarse accuracy is sufficient for most sensor network  applications, solutions in range-free localization are being pursued as a cost-effective alternative to more expensive range-based approaches. In this paper, we present APIT, a novel localization algorithm that is range-free. We show that our APIT scheme performs best when an irregular radio pattern and random node placement are considered, and low communication overhead is desired. We compare our work via extensive simulation, with three state-of-the-art range-free localization schemes to identify the preferable system configurations of each. In addition, we study the effect of location error on routing and tracking performance. We show that routing performance and tracking accuracy are not significantly affected by localization error when the error is less than 0.4 times the communication radio radius.",
    "cite_count": "991",
    "location": {
      "url": "../Conference/172/mobicom-mobile-computing-and-networking",
      "name": "Mobile Computing and Networking - MOBICOM"
    },
    "authors": [
      {
        "name": "Tian He",
        "msid": "2377404"
      },
      {
        "name": "Chengdu Huang",
        "msid": "11812825"
      },
      {
        "name": "Brian M. Blum",
        "msid": "1154834"
      },
      {
        "name": "John A. Stankovic",
        "msid": "964299"
      },
      {
        "name": "Tarek F. Abdelzaher",
        "msid": "1454908"
      }
    ],
    "id": "104",
    "msid": "29556"
  },
  {
    "title": "The Anatomy of a Context-Aware Application",
    "abstract": "We describe a sensor-driven, or sentient, platform for context-aware computing that enables applications to follow mobile users as they move around a building. The platform is particularly suitable for richly equipped, networked environments. The only item a user is required to carry is a small sensor tag, which identifies them to the system and locates them accurately in three dimensions. The platform builds a dynamic model  of the environment using these location sensors and resource information gathered by telemetry software, and presents it in a form suitable for application programmers. Use of the platform is illustrated through a practical example, which allows a user's current working desktop to follow them as they move around the environment.",
    "cite_count": "609",
    "location": {
      "url": "../Journal/275/winet-wireless-networks",
      "name": "Wireless Networks - WINET"
    },
    "authors": [
      {
        "name": "Andy Harter",
        "msid": "1322476"
      },
      {
        "name": "Andy Hopper",
        "msid": "610827"
      },
      {
        "name": "Pete Steggles",
        "msid": "1430425"
      },
      {
        "name": "Andy Ward",
        "msid": "1308454"
      },
      {
        "name": "Paul Webste",
        "msid": "1808415"
      }
    ],
    "id": "105",
    "msid": "35690"
  },
  {
    "DOI": "10.1145/958491.958498",
    "title": "Differentiated surveillance for sensor networks",
    "abstract": "For many sensor network  applications such as military surveillance, it is necessary to provide full sensing coverage to a security-sensitive area while at the same time minimizing energy consumption  and extending system lifetime by leveraging the redundant deployment of sensor nodes. It is also preferable for the sensor network  to provide differentiated surveillance service for various target areas with different degrees of security requirements. In this paper, we propose a differentiated surveillance service for sensor networks based on an adaptable energy-efficient sensing coverage protocol. In the protocol, each node is able to dynamically decide a schedule for itself to guarantee a certain degree of coverage (DOC) with average energy consumption  inversely proportional to the node density. Several optimizations and extensions are proposed to provide even better performance. Simulation shows that our protocol accomplishes differentiated surveillance with low energy  consumption. It outperforms other state-of-the-art schemes by as much as 50% reduction in energy consumption  and as much as 130% increase in the half-life of the network.",
    "cite_count": "288",
    "location": {
      "url": "../Conference/1660/sensys-conference-on-embedded-networked-sensor-systems",
      "name": "Conference On Embedded Networked Sensor Systems - SenSys"
    },
    "authors": [
      {
        "name": "Ting Yan",
        "msid": "12850709"
      },
      {
        "name": "Tian He",
        "msid": "2377404"
      },
      {
        "name": "John A. Stankovic",
        "msid": "964299"
      }
    ],
    "id": "106",
    "msid": "38146"
  },
  {
    "DOI": "10.1145/564376.564419",
    "title": "Collaborative filtering with privacy via factor analysis",
    "abstract": "Collaborative filtering  (CF) is valuable in e-commerce, and for direct recommendations for music, movies, news etc. But today's systems have several disadvantages, including privacy risks. As we move toward ubiquitous computing, there is a great potential for individuals to share all kinds of information about places and things to do, see and buy, but the privacy risks are severe. In this paper we describe a new method for collaborative filtering  which protects the privacy of individual data. The method is based on a probabilistic factor analysis  model. Privacy protection  is provided by a peer-to-peer protocol which is described elsewhere, but outlined in this paper. The factor analysis  approach handles missing data  without requiring default values for them. We give several experiments that suggest that this is most accurate method for CF to date. The new algorithm has other advantages in speed and storage over previous algorithms. Finally, we suggest applications of the approach to other kinds of statistical analyses of survey or questionaire data.",
    "cite_count": "200",
    "location": {
      "url": "../Conference/368/sigir-research-and-development-in-information-retrieval",
      "name": "Research and Development in Information Retrieval - SIGIR"
    },
    "authors": [
      {
        "name": "John F. Canny",
        "msid": "207597"
      }
    ],
    "id": "107",
    "msid": "43043"
  },
  {
    "DOI": "10.1145/570738.570755",
    "title": "The bits and flops of the n-hop multilateration primitive for node localization problems",
    "abstract": "The recent advances in MEMS, embedded systems and wireless communication  technologies are making the realization and deployment of networked wireless microsensors a tangible task. Vital to the success of wireless microsensor networks is the ability of microsensors to ``collectively perform sensing and computation''. In this paper, we study one of the fundamental challenges in sensor networks, node localization. The collaborative multilateration presented here, enables ad-hoc deployed sensor nodes  to accurately estimate their locations by using known beacon locations that are several hops away and distance measurements to neighboring nodes. To prevent error accumulation in the network, node locations are computed by setting up and solving a global non-linear optimization  problem. The solution is presented in two computation models, centralized and a fully distributed approximation of the centralized model. Our simulation results show that using the fully distributed model, resource constrained sensor nodes  can collectively solve a large non-linear optimization  problem that none of the nodes can solve individually. This approach results in significant savings in computation and communication, that allows fine-grained localization to run on a low cost sensor node we have developed.",
    "cite_count": "386",
    "location": {
      "url": "../Conference/172/mobicom-mobile-computing-and-networking",
      "name": "Mobile Computing and Networking - MOBICOM"
    },
    "authors": [
      {
        "name": "Andreas Savvides",
        "msid": "303499"
      },
      {
        "name": "Mani B. Srivastava",
        "msid": "937074"
      }
    ],
    "id": "108",
    "msid": "44987"
  },
  {
    "DOI": "10.1145/503376.503397",
    "title": "SmartSkin: an infrastructure for freehand manipulation on interactive surfaces",
    "abstract": "This paper introduces a new sensor architecture for making interactive surfaces that are sensitive to human hand and finger gestures. This sensor recognizes multiple hand positions and shapes and calculates the distance between the hand and the surface by using capacitive sensing and a mesh-shaped antenna. In contrast to camera-based gesture recognition  systems, all sensing elements can be integrated within the surface, and this method does not suffer from lighting and occlusion problems. This paper describes the sensor architecture, as well as two working prototype systems: a table-size system and a tablet-size system. It also describes several interaction techniques that would be difficult to perform without using this architecture",
    "cite_count": "265",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Jun Rekimoto",
        "msid": "1615809"
      }
    ],
    "id": "109",
    "msid": "52908"
  },
  {
    "title": "Thumbs up? Sentiment Classification using Machine Learning Techniques",
    "abstract": "We consider the problem of classifying documents not by\n                   topic, but by overall sentiment, e.g., determining whether\n                   a review is positive or negative. Using movie reviews as\n                   data, we find that standard machine learning  techniques\n                   definitively outperform human-produced baselines. However,\n                   the three machine learning  methods we employed (Naive\n                   Bayes, maximum entropy  classification, and support vector \n                   machines) do not perform as well on sentiment\n                   classification  as on traditional topic-based\n                   categorization. We conclude by examining factors that make\n                   the sentiment classification  problem more challenging.",
    "cite_count": "812",
    "location": {
      "url": "../Journal/299/corr-computing-research-repository",
      "name": "Computing Research Repository - CORR"
    },
    "authors": [
      {
        "name": "Bo Pang",
        "msid": "1214549"
      },
      {
        "name": "Lillian Lee",
        "msid": "321410"
      },
      {
        "name": "Shivakumar Vaithyanathan",
        "msid": "1044550"
      }
    ],
    "id": "110",
    "msid": "54093"
  },
  {
    "DOI": "10.1145/570645.570674",
    "title": "Robotics-based location sensing using wireless ethernet",
    "abstract": "A key subproblem in the construction of location-aware systems is the determination of the position of a mobile device. This paper describes the design, implementation and analysis of a system for determining position inside a building from measured RF signal strengths of packets on an IEEE 802.11b wireless Ethernet network. Previous approaches to location awareness  with RF signals have been severely hampered by non-linearity, noise and complex correlations due to multi-path effects, interference and absorption. The design of our system begins with the observation that determining position from complex, noisy and non-linear signals is a well-studied problem in the field of robotics. Using only off-the-shelf hardware, we achieve robust position estimation  to within a meter in our experimental context and after adequate training of our system. We can also coarsely determine our orientation and can track our position as we move. By applying recent advances in probabilistic inference  of position and sensor fusion  from noisy signals, we show that the RF emissions from base stations as measured by off-the-shelf wireless Ethernet cards are sufficiently rich in information to permit a mobile device  to reliably track its location.",
    "cite_count": "306",
    "location": {
      "url": "../Conference/172/mobicom-mobile-computing-and-networking",
      "name": "Mobile Computing and Networking - MOBICOM"
    },
    "authors": [
      {
        "name": "Andrew M. Ladd",
        "msid": "420137"
      },
      {
        "name": "Kostas E. Bekris",
        "msid": "548382"
      },
      {
        "name": "Algis Rudys",
        "msid": "1518533"
      },
      {
        "name": "Guillaume Marceau",
        "msid": "1260124"
      },
      {
        "name": "Lydia E. Kavraki",
        "msid": "504280"
      },
      {
        "name": "Dan S. Wallach",
        "msid": "534585"
      }
    ],
    "id": "111",
    "msid": "57347"
  },
  {
    "DOI": "10.1145/570645.570664",
    "title": "A two-tier data dissemination model for large-scale wireless sensor networks",
    "abstract": "Sink mobility brings new challenges to large-scale sensor networking. It suggests that information about each mobile sink's location be continuously propagated through the sensor field to keep all sensor nodes  updated with the direction of forwarding future data reports. Unfortunately frequent location updates from multiple sinks can lead to both excessive drain of sensors' limited battery power supply  and increased collisions in wireless transmissions. In this paper we describe TTDD, a Two-Tier Data Dissemination  approach that provides scalable and efficient data delivery to multiple mobile sinks. Each data source in TTDD proactively builds a grid structure which enables mobile sinks to continuously receive data on the move by flooding queries within a local cell only. TTDD's design exploits the fact that sensor nodes  are stationary and location-aware to construct and maintain the grid structures with low overhead. We have evaluated TTDD performance through both analysis and extensive simulation experiments. Our results show that TTDD handles multiple mobile sinks efficiently with performance comparable with that of stationary sinks.",
    "cite_count": "534",
    "location": {
      "url": "../Conference/172/mobicom-mobile-computing-and-networking",
      "name": "Mobile Computing and Networking - MOBICOM"
    },
    "authors": [
      {
        "name": "Fan Ye",
        "msid": "1282952"
      },
      {
        "name": "Haiyun Luo",
        "msid": "2086758"
      },
      {
        "name": "Jerry Cheng",
        "msid": "12893275"
      },
      {
        "name": "Songwu Lu",
        "msid": "47496038"
      },
      {
        "name": "Lixia Zhang",
        "msid": "289843"
      }
    ],
    "id": "112",
    "msid": "58078"
  },
  {
    "title": "Robust Positioning Algorithms for Distributed Ad-Hoc Wireless Sensor Networks",
    "abstract": "A distributed algorithm  for determining the positions of nodes in an ad-hoc, wireless sensor network  is explained in detail. Details regarding the implementation of such an algorithm are also discussed. In a 400 node network in which the nodes are randomly placed within a 100x100 square, the algorithm is shown to achieve average position errors of less than 33% of a node's radio range in the presence of 5% range measurement error  when at least 5% of the nodes are anchor nodes (with known position) and the average connectivity of a node is greater than 7 nodes. It is shown that the algorithm performs well in networks in which nodes are connected to at least 7 one-hop neighbors on average and where average range errors are less than 40%.",
    "cite_count": "457",
    "location": {
      "url": "../Conference/442/usenix-usenix-technical-conference",
      "name": "USENIX Technical Conference - USENIX"
    },
    "authors": [
      {
        "name": "Chris Savarese",
        "msid": "10491741"
      },
      {
        "name": "Jan M. Rabaey",
        "msid": "905626"
      },
      {
        "name": "Koen Langendoen",
        "msid": "93058"
      }
    ],
    "id": "113",
    "msid": "60590"
  },
  {
    "DOI": "10.1145/223904.223964",
    "title": "Bricks: Laying the Foundations for Graspable User Interfaces",
    "abstract": "We introduce the concept of Graspable User Interfaces that allow direct control of electronic or virtual objects through physical handles for control. These physical artifacts, which we call \"bricks,\" are essentially new input devices that can be tightly coupled or \"attached\" to virtual objects for manipulation or for expressing action (e.g., to set parameters or for initiating processes). Our bricks operate on top of a large horizontal display surface known as the \"ActiveDesk.\" We present four stages in the development of Graspable UIs: (1) a series of exploratory studies on hand gestures and grasping; (2) interaction simulations using mock-ups and rapid prototyping  tools; (3) a working prototype and sample application called GraspDraw; and (4) the initial integrating of the Graspable UI concepts into a commercial application. Finally, we conclude by presenting a design space  for Bricks which lay the foundation for further exploring and developing Graspable User Interfaces.",
    "cite_count": "434",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "George W. Fitzmaurice",
        "msid": "1276161"
      },
      {
        "name": "Hiroshi Ishii",
        "msid": "1822502"
      },
      {
        "name": "William A. S. Buxton",
        "msid": "663628"
      }
    ],
    "id": "114",
    "msid": "70324"
  },
  {
    "DOI": "10.1109/65.967595",
    "title": "A survey on position-based routing in mobile ad hoc networks",
    "abstract": "We present an overview of ad hoc routing  protocols that make forwarding decisions based on the geographical position of a packet's destination. Other than the destination's position, each node need know only its own position and the position of its one-hop neighbors in order to forward packets. Since it is not necessary to maintain explicit routes, position-based routing does scale well even if the network is highly dynamic. This is a major advantage in a mobile ad hoc network  where the topology may change frequently. The main prerequisite for position-based routing is that a sender can obtain the current position of the destination. Therefore, previously proposed location services are discussed in addition to position-based packet forwarding  strategies. We provide a qualitative comparison of the approaches in both areas and investigate opportunities for future research",
    "cite_count": "762",
    "location": {
      "url": "../Journal/406/network-ieee-network",
      "name": "IEEE Network - NETWORK"
    },
    "authors": [
      {
        "name": "Martin Mauve",
        "msid": "151663"
      },
      {
        "name": "Joerg Widmer",
        "msid": "2074832"
      },
      {
        "name": "Hannes Hartenstein",
        "msid": "1577128"
      }
    ],
    "id": "115",
    "msid": "78172"
  },
  {
    "DOI": "10.1207/S15327051HCI16234_11",
    "title": "An Infrastructure Approach to Context-Aware Computing",
    "abstract": " The Context Toolkit (Dey, Salber, and Abowd 2001 [this special issue]) is only oneof many possible architectures for supporting context-aware applications. In this essay,we look at the trade-offs involved with a service infrastructure approach to context-awarecomputing. We describe the advantages that a service infrastructure for contextawarenesshas over other approaches, outline some of the core technical challenges thatmust be addressed before such an infrastructure can be built, and... ",
    "cite_count": "223",
    "location": {
      "url": "../Journal/4525/human-computer-interaction",
      "name": "Human-computer Interaction"
    },
    "authors": [
      {
        "name": "Jason I. Hong",
        "msid": "1733023"
      },
      {
        "name": "James A. Landay",
        "msid": "1401225"
      }
    ],
    "id": "116",
    "msid": "82453"
  },
  {
    "title": "People, places, things: Web presence for the real world",
    "abstract": "The convergence of Web technology, wireless networks, and portable client devices provides new design opportunities for computer/communications systems. In the HP Labs' \"Cooltown\" project we have been exploring these opportunities through an infrastructure to support \"web presence\" for people, places and things. We put web servers into things like printers and put information into web servers about things like artwork; we group physically related things into places embodied in web servers. Using URLs for addressing, physical URL beaconing and sensing of URLs for discovery, and localized web servers for directories, we can create a location-aware but ubiquitous system to support nomadic users. On top of this infrastructure we can leverage Internet connectivity to support communications services. Web presence bridges the World Wide Web  and the physical world we inhabit, providing a model for supporting nomadic users without a central control point.",
    "cite_count": "367",
    "location": {
      "url": "../Conference/509/wmcsa-workshop-on-mobile-computing-systems-and-applications",
      "name": "Workshop on Mobile Computing Systems and Applications - WMCSA"
    },
    "authors": [
      {
        "name": "Tim Kindberg",
        "msid": "20567"
      },
      {
        "name": "John J. Barton",
        "msid": "4921"
      },
      {
        "name": "Jeff Morgan",
        "msid": "845683"
      },
      {
        "name": "Gene Becker",
        "msid": "405542"
      },
      {
        "name": "Debbie Caswell",
        "msid": "1513829"
      },
      {
        "name": "Philippe Debaty",
        "msid": "104410"
      },
      {
        "name": "Gita Gopal",
        "msid": "1935019"
      },
      {
        "name": "Marcos Frid",
        "msid": "1240174"
      },
      {
        "name": "Venky Krishnan",
        "msid": "1421254"
      },
      {
        "name": "Howard Morris",
        "msid": "17899810"
      },
      {
        "name": "John Schettino",
        "msid": "122636"
      },
      {
        "name": "Bill Serra",
        "msid": "422758"
      }
    ],
    "id": "117",
    "msid": "87288"
  },
  {
    "DOI": "10.1145/302979.303064",
    "title": "Single display groupware: a model for co-present collaboration",
    "abstract": "We introduce a model for supporting collaborative work  betweenpeople that are physically close to each other. We call this modelSingle Display Groupware (SDG). In this paper, we describe themodel, comparing it to more traditional remote collaboration, Wedescribe the requirements that SDG places on computer technology,and our understanding of the benefits and costs of SDG systems.Finally, we describe a prototype SDG system that we built and theresults of a usability test we ran with 60 elementary schoolchildren.",
    "cite_count": "282",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Jason Stewart",
        "msid": "455754"
      },
      {
        "name": "Benjamin B. Bederson",
        "msid": "136606"
      },
      {
        "name": "Allison Druin",
        "msid": "241725"
      }
    ],
    "id": "118",
    "msid": "88590"
  },
  {
    "DOI": "10.1207/s15327809jls0603_1",
    "title": "Quantifying Qualitative Analyses of Verbal Data: A Practical Guide",
    "abstract": "This article provides one example of a method of analyzing qualitative data  in an objective and quantifiable way. Although the application of the method is illustrated in the context of verbal data such as explanations, interviews, problem-solving protocols, and retrospective reports, in principle, the mechanics of the method can be adapted for coding other types of qualitative data  such as gestures and videotapes. The mechanics of the method we outlined in 8 concrete step. Although verbal analyses can be used for many purposes, the main goal of the analyses discussed here is to formulate an understanding of the representation of the knowledge used in cognitive performances and how that representation changes with learning This can be contrasted with another method or analyzing verbal protocols, the goal of which is to validate the cognitive processes of human performance, often as embodied in a computational model. For a variety of reasons, there has been an increasing need in cognitive science  and educational research to collect and analyze \"messy\" data. Messy data refer to such things as verbal explanations, observations, and videotapings, as well as gestures. One reason for the need to collect this kind of",
    "cite_count": "356",
    "location": {
      "url": "../Journal/10903/j-learn-sci-journal-of-the-learning-sciences",
      "name": "Journal of The Learning Sciences - J LEARN SCI"
    },
    "authors": [
      {
        "name": "Michelene T. H. Chi",
        "msid": "22934838"
      }
    ],
    "id": "119",
    "msid": "91255"
  },
  {
    "DOI": "10.1007/3-540-45427-6_23",
    "title": "Privacy by Design - Principles of Privacy-Aware Ubiquitous Systems",
    "abstract": "This paper tries to serve as an introductory reading to privacy issues in the field of ubiquitous computing. It develops six principles for guiding system design, based on a set of fair information practices common in most privacy legis- lation in use today: notice, choice and consent, proximity and locality, anonymity and pseudonymity, security, and access and recourse. A brief look at the history of privacy protection, its legal status, and its expected utility  is provided as a background.",
    "cite_count": "289",
    "location": {
      "url": "../Conference/428/ubicomp-huc-ubiquitous-computing-handheld-and-ubiquitous-computing",
      "name": "Ubiquitous Computing/Handheld and Ubiquitous Computing - UbiComp(HUC)"
    },
    "authors": [
      {
        "name": "Marc Langheinrich",
        "msid": "45120634"
      }
    ],
    "id": "120",
    "msid": "93982"
  },
  {
    "DOI": "10.1145/502348.502388",
    "title": "Phidgets: easy development of physical interfaces through physical widgets",
    "abstract": "Physical widgets or phidgets are to physical user interfaces what widgets are to graphical user interfaces. Similar to widgets, phidgets abstract and package input and output devices: they hide implementation and construction details, they expose functionality through a well-defined API, and they have an (optional) on-screen interactive interface for displaying and controlling device state. Unlike widgets, phidgets also require: a connection manager to track how devices appear on-line; a way to link a software phidget with its physical counterpart; and a simulation mode to allow the programmer to develop, debug and test a physical interface  even when no physical device is present. Our evaluation shows that everyday programmers using phidgets can rapidly develop physical interfaces.",
    "cite_count": "257",
    "location": {
      "url": "../Conference/431/uist-user-interface-software-and-technology",
      "name": "User Interface Software and Technology - UIST"
    },
    "authors": [
      {
        "name": "Saul Greenberg",
        "msid": "1304573"
      },
      {
        "name": "Chester Fitchett",
        "msid": "1128894"
      }
    ],
    "id": "121",
    "msid": "95864"
  },
  {
    "DOI": "10.1145/280756.280790",
    "title": "The simulation and evaluation of dynamic voltage scaling algorithms",
    "abstract": "The reduction of energy consumption  in microprocessors can be accomplished without impacting the peak performance through the use of dynamic voltage scaling  (DVS). This approach varies the processor voltage under software control to meet dynamically varying performance requirements. This paper presents a foundation for the simulation and analysis of DVS algorithms. These algorithms are applied to a benchmark suite specifically targeted for PDA devices.",
    "cite_count": "394",
    "location": {
      "url": "../Conference/89/islped-international-symposium-on-low-power-electronics-and-design",
      "name": "International Symposium on Low Power Electronics and Design - ISLPED"
    },
    "authors": [
      {
        "name": "Trevor Pering",
        "msid": "227914"
      },
      {
        "name": "Thomas D. Burd",
        "msid": "233087"
      },
      {
        "name": "Robert W. Brodersen",
        "msid": "282538"
      }
    ],
    "id": "122",
    "msid": "99929"
  },
  {
    "DOI": "10.1007/3-540-45337-7_18",
    "title": "An Overview of AspectJ",
    "abstract": "AspectJ is a simple and practical aspect-oriented extension to Java. With just a few new constructs, AspectJ provides support for modular implementation of a range of crosscutting concerns. In AspectJ's dynamic join point model, join points are well-defined points in the execution of the program; pointcuts are collections of join points; advice are special method-like constructs that can be attached to pointcuts; and aspects are modular units of crosscutting implementation, comprising pointcuts, advice, and ordinary Java member declarations. AspectJ code is compiled into standard Java bytecode. Simple extensions to existing Java development environments make it possible to browse the crosscutting structure of aspects in the same kind of way as one browses the inheritance structure of classes. Several examples show that AspectJ is powerful, and that programs written using it are easy to understand.",
    "cite_count": "1885",
    "location": {
      "url": "../Conference/662/ecoop-european-conference-on-object-oriented-programming",
      "name": "European Conference on Object-Oriented Programming - ECOOP"
    },
    "authors": [
      {
        "name": "Gregor Kiczales",
        "msid": "840008"
      },
      {
        "name": "Erik Hilsdale",
        "msid": "425265"
      },
      {
        "name": "Jim Hugunin",
        "msid": "1093864"
      },
      {
        "name": "Mik Kersten",
        "msid": "34617"
      },
      {
        "name": "Jeffrey Palm",
        "msid": "617984"
      },
      {
        "name": "William G. Griswold",
        "msid": "1765874"
      }
    ],
    "id": "123",
    "msid": "105157"
  },
  {
    "id": "124",
    "msid": "108196"
  },
  {
    "DOI": "10.1145/302979.303010",
    "title": "i-LAND: an interactive landscape for creativity and innovation",
    "abstract": "We describe the i-LAND environment which constitutes an exampleof our vision of the workspaces of the future, in this casesupporting cooperative work  of dynamic teams with changing needs.i-LAND requires and provides new forms of human-computerinteraction and new forms of computer-supported cooperative work.Its design is based on an integration of information andarchitectural spaces, implications of new work practices and anempirical requirements study informing our design. i-LAND consistsof several roomware components, i.e. computer-aug- mented objectsintegrating room elements with information technology. We presentthe current realization of i-LAND in terms of an interactiveelectronic wall, an interactive table, two computer-enhancedchairs, and two bridges for the Passage-mechanism. This iscomplemented by the description of the creativity supportapplication and the technological infrastructure. The paper isaccompanied by a video figure in the CHI99 video program.",
    "cite_count": "383",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Norbert A. Streitz",
        "msid": "107182"
      },
      {
        "name": "Jörg Geißler",
        "msid": "48775"
      },
      {
        "name": "Torsten Holmer",
        "msid": "982928"
      },
      {
        "name": "Shin'ichi Konomi",
        "msid": "645298"
      },
      {
        "name": "Christian Müller-Tomfelde",
        "msid": "1139640"
      },
      {
        "name": "Wolfgang Reischl",
        "msid": "3318187"
      },
      {
        "name": "Petra Rexroth",
        "msid": "279010"
      },
      {
        "name": "Peter Seitz",
        "msid": "320400"
      },
      {
        "name": "Ralf Steinmetz",
        "msid": "1477522"
      }
    ],
    "id": "125",
    "msid": "110383"
  },
  {
    "DOI": "10.1006/jvlc.2002.0237",
    "title": "A Meta-Study of Algorithm Visualization Effectiveness",
    "abstract": " Algorithm visualization  (AV) technology graphically illustrates how algorithms work. Despite the intuitiveappeal of the technology, it has failed to catch on in mainstream computer science education. Some have attributedthis failure to the mixed results of experimental studies designed to substantiate AV technology'seducational effectiveness. However, while several integrative reviews of AV technology have appeared,none has focused specifically on the software's effectiveness by analyzing... ",
    "cite_count": "247",
    "location": {
      "url": "../Journal/144/vlc-journal-of-visual-languages-and-computing",
      "name": "Journal of Visual Languages and Computing - VLC"
    },
    "authors": [
      {
        "name": "Christopher D. Hundhausen",
        "msid": "540437"
      },
      {
        "name": "Sarah A. Douglas",
        "msid": "792355"
      },
      {
        "name": "John T. Stasko",
        "msid": "2181032"
      }
    ],
    "id": "126",
    "msid": "112517"
  },
  {
    "DOI": "10.1145/502512.502525",
    "title": "Mining the network value of customers",
    "abstract": "One of the major applications of data mining  is in helping companies determine which potential customers to market to. If the expected profit from a customer is greater than the cost of marketing to her, the marketing action for that customer is executed. So far, work in this area has considered only the intrinsic value of the customer (i.e, the expected profit from sales to her). We propose to model also the customer's network value: the expected profit from sales to other customers she may influence to buy, the customers those may influence, and so on recursively. Instead of viewing a market as a set of independent entities, we view it as a social network  and model it as a Markov random field. We show the advantages of this approach using a social network  mined from a collaborative filtering  database. Marketing that exploits the network value of customers---also known as viral marketing---can be extremely effective, but is still a black art. Our work can be viewed as a step towards providing a more solid foundation for it, taking advantage of the availability of large relevant databases.",
    "cite_count": "340",
    "location": {
      "url": "../Conference/120/kdd-knowledge-discovery-and-data-mining",
      "name": "Knowledge Discovery and Data Mining - KDD"
    },
    "authors": [
      {
        "name": "Pedro Domingos",
        "msid": "22044"
      },
      {
        "name": "Matthew Richardson",
        "msid": "739952"
      }
    ],
    "id": "127",
    "msid": "117200"
  },
  {
    "DOI": "10.1145/345910.345917",
    "title": "The Cricket location-support system",
    "abstract": "This paper presents the design, implementation, and evaluation of Cricket, a location-support system for in-building, mobile, location- dependent applications. It allows applications running on mobile and static nodes to learn their physical location by using listeners that hear and analyze information from beacons spread throughout the building. Cricket is the result of several design goals, including user privacy, decentralized administration, network heterogeneity, and low cost. Rather than explicitly tracking user location, Cricket helps devices learn where they are and lets them decide whom to advertise this information to; it does not rely on any centralized management or control and there is no explicit coordination be- tween beacons; it provides information to devices regardless of their type of network connectivity; and each Cricket device is made from off-the-shelf components and costs less than U.S. $10. We describe the randomized algorithm  used by beacons to transmit information, the use of concurrent radio and ultrasonic signals to infer distance, the listener inference algorithms to overcome multipath and inter- ference, and practical beacon configuration and positioning tech- niques that improve accuracy. Our experience with Cricket shows that several location-dependent applications such as in-building ac- tive maps and device control can be developed with little effort or manual configuration.",
    "cite_count": "1746",
    "location": {
      "url": "../Conference/172/mobicom-mobile-computing-and-networking",
      "name": "Mobile Computing and Networking - MOBICOM"
    },
    "authors": [
      {
        "name": "Nissanka B. Priyantha",
        "msid": "1508963"
      },
      {
        "name": "Anit Chakraborty",
        "msid": "2001325"
      },
      {
        "name": "Hari Balakrishnan",
        "msid": "1180211"
      }
    ],
    "id": "128",
    "msid": "117791"
  },
  {
    "DOI": "10.1109/98.878533",
    "title": "GPS-less low-cost outdoor localization for very small devices",
    "abstract": "Instrumenting the physical world through large networks of wireless sensor  nodes, particularly for applications like environmental monitoring  of water and soil, requires that these nodes be very small, lightweight, untethered, and unobtrusive. The problem of localization, that is, determining where a given node is physically located in a network, is a challenging one, and yet extremely crucial for many of these applications. Practical considerations such as the small size, form factor, cost and power constraints of nodes preclude the reliance on GPS of all nodes in these networks. We review localization techniques and evaluate the effectiveness of a very simple connectivity metric method for localization in outdoor environments that makes use of the inherent RF communications capabilities of these devices. A fixed number of reference points in the network with overlapping regions of coverage transmit periodic beacon signals. Nodes use a simple connectivity metric, which is more robust to environmental vagaries, to infer proximity to a given subset of these reference points. Nodes localize themselves to the centroid of their proximate reference points. The accuracy of localization is then dependent on the separation distance between two-adjacent reference points and the transmission range of these reference points. Initial experimental results show that the accuracy for 90 percent of our data points is within one-third of the separation distance. However, future work is needed to extend the technique to more cluttered environments",
    "cite_count": "1531",
    "location": {
      "url": "../Journal/1044/ieee-pers-commun-ieee-personal-communications",
      "name": "IEEE Personal Communications - IEEE Pers. Commun."
    },
    "authors": [
      {
        "name": "Nirupama Bulusu",
        "msid": "1332039"
      },
      {
        "name": "John Heidemann",
        "msid": "979003"
      },
      {
        "name": "Deborah Estrin",
        "msid": "2402354"
      }
    ],
    "id": "129",
    "msid": "119223"
  },
  {
    "DOI": "10.1109/2.940014",
    "title": "Location Systems for Ubiquitous Computing",
    "abstract": " Emerging mobile computing applications often need to know where things are physically located. To meet this need, many different location systems and technologies have been developed. In this survey we present the basic techniques used for location-sensing, describe a taxonomy of location system properties, present a survey of research and commercial location systems that define the field, show how the taxonomy can be used to evaluate location-sensing systems, and offer suggestions for future... ",
    "cite_count": "1392",
    "location": {
      "url": "../Journal/11/computer-ieee-computer",
      "name": "IEEE Computer - COMPUTER"
    },
    "authors": [
      {
        "name": "Jeffrey Hightower",
        "msid": "297093"
      },
      {
        "name": "Gaetano Borriello",
        "msid": "70984"
      }
    ],
    "id": "130",
    "msid": "121078"
  },
  {
    "DOI": "10.1109/52.329404",
    "title": "Dynamic Queries for Visual Information Seeking",
    "abstract": "Dynamic queries are a novel approach to information seeking  that may enable users to cope with information overload. They allow users to see an overview of the database, rapidly (100 msec updates) explore and conveniently filter out unwanted information. Users fly through information spaces by incrementally adjusting a query (with sliders, buttons, and other filters) while continuously viewing the changing results. Dynamic queries on the chemical table of elements, computer directories, and a real estate  database were built and tested in three separate exploratory experiments. These results show statistically significant performance improvements and user enthusiasm more commonly seen with video games. Widespread application seems possible but research issues remain in database and display algorithms, and user interface  design. Challenges include methods for rapidly displaying and changing many points, colors, and areas; multi- dimensional pointing; incorporation of sound and visual display techniques that increase user comprehension; and integration with existing database systems.",
    "cite_count": "340",
    "location": {
      "url": "../Journal/17/software-ieee-software",
      "name": "IEEE Software - SOFTWARE"
    },
    "authors": [
      {
        "name": "Ben Shneiderman",
        "msid": "899177"
      }
    ],
    "id": "131",
    "msid": "123796"
  },
  {
    "DOI": "10.1145/371920.372071",
    "title": "Item-based collaborative filtering recommendation algorithms",
    "abstract": "Recommender systems apply knowledge discovery  techniques to the problem of making personalized recom- mendations for information, products or services during a live interaction. These systems, especially the k-nearest neighbor collaborative filtering  based ones, are achieving widespread success on the Web. The tremendous growth in the amount of available information and the number of visitors to Web sites in recent years poses some key challenges for recommender systems. These are: producing high quality recommendations, performing many recommendations per second for millions of users and items and achieving high coverage in the face of data sparsity. In traditional collaborative filtering  systems the amount of work increases with the number of participants in the system. New recommender system  technologies are needed that can quickly produce high quality recommendations, even for very large-scale problems. To address these issues we have explored item-based collaborative filtering  techniques. Item- based techniques first analyze the user-item matrix to identify relationships between different items, and then use these relationships to indirectly compute recommendations for users. In this paper we analyze different item-based recommendation generation algorithms. We look into different techniques for computing item-item similarities (e.g., item-item correlation vs. cosine similarities between item vec- tors) and different techniques for obtaining recommendations from them (e.g., weighted sum vs. regression model). Finally, we experimentally evaluate our results and compare them to the basic k-nearest neighbor approach. Our experiments suggest that item-based algorithms provide dramatically better performance than user-based algorithms, while at the same time providing better quality than the best available user-based algorithms.",
    "cite_count": "1104",
    "location": {
      "url": "../Conference/526/www-world-wide-web-conference-series",
      "name": "World Wide Web Conference Series - WWW"
    },
    "authors": [
      {
        "name": "Badrul M. Sarwar",
        "msid": "338344"
      },
      {
        "name": "George Karypis",
        "msid": "1374770"
      },
      {
        "name": "Joseph A. Konstan",
        "msid": "68554"
      },
      {
        "name": "John Reidl",
        "msid": "1987678"
      }
    ],
    "id": "132",
    "msid": "124971"
  },
  {
    "DOI": "10.1109/34.955109",
    "title": "SIMPLIcity: Semantics-Sensitive Integrated Matching for Picture LIbraries",
    "abstract": "The need for efficient content-based image retrieval  has increased tremendously in many application areas such as biomedicine, military, commerce, education, and Web image classification  and searching. We present here SIMPLIcity (Semantics- sensitive Integrated Matching for Picture LIbraries), an image retrieval  system, which uses semantics classification methods, a wavelet-based approach for feature extraction, and integrated region matching based upon image segmentation. As in other region- based retrieval systems, an image is represented by a set of regions, roughly corresponding to objects, which are characterized by color, texture, shape, and location. The system classifies images into semantic categories, such as textured-nontextured, graph- photograph. Potentially, the categorization enhances retrieval by permitting semantically-adaptive searching methods and narrowing down the searching range in a database. A measure for the overall similarity between images is developed using a region-matching scheme that integrates properties of all the regions in the images. Compared with retrieval based on individual regions, the overall similarity approach 1) reduces the adverse effect  of inaccurate segmentation, 2) helps to clarify the semantics of a particular region, and 3) enables a simple querying interface for region-based image retrieval  systems. The application of SIMPLIcity to several databases, including a database of about 200,000 general-purpose images, has demonstrated that our system performs significantly better and faster than existing ones. The system is fairly robust to image alterations.",
    "cite_count": "877",
    "location": {
      "url": "../Journal/25/pami-ieee-transactions-on-pattern-analysis-and-machine-intelligence",
      "name": "IEEE Transactions on Pattern Analysis and Machine Intelligence - PAMI"
    },
    "authors": [
      {
        "name": "James Ze Wang",
        "msid": "47547846"
      },
      {
        "name": "Jia Li",
        "msid": "449523"
      },
      {
        "name": "Gio Wiederhold",
        "msid": "1418897"
      }
    ],
    "id": "133",
    "msid": "125260"
  },
  {
    "DOI": "10.1007/3-540-45427-6_7",
    "title": "ICrafter: A Service Framework for Ubiquitous Computing Environments",
    "abstract": "In this paper, we propose ICrafter, a framework for services and their user interfaces in a class of ubiquitous computing  environments. The chief objective of ICrafter is to let users flexibly interact with the services in their environment using a variety of modalities and input devices. We extend existing service frameworks in three ways. First, to ooad services and user input devices, ICrafter provides infrastructure support for UI selection, generation, and adaptation. Second, ICrafter al- lows UIs to be associated with service patterns for on-the-fly aggregation of services. Finally, ICrafter facilitates the design of service UIs that are portable but still reflect the context of the local environment. In addition, we also focus on the system properties such as incremental deployability and robustness that are critical for ubiquitous computing  environments. We describe the goals and architecture of ICrafter, a prototype imple- mentation that validates its design, and the key lessons learnt from our experiences.",
    "cite_count": "200",
    "location": {
      "url": "../Conference/428/ubicomp-huc-ubiquitous-computing-handheld-and-ubiquitous-computing",
      "name": "Ubiquitous Computing/Handheld and Ubiquitous Computing - UbiComp(HUC)"
    },
    "authors": [
      {
        "name": "Shankar Ponnekanti",
        "msid": "425670"
      },
      {
        "name": "Brian Lee",
        "msid": "1183015"
      },
      {
        "name": "Armando Fox",
        "msid": "859601"
      },
      {
        "name": "Pat Hanrahan",
        "msid": "485201"
      },
      {
        "name": "Terry Winograd",
        "msid": "68578"
      }
    ],
    "id": "134",
    "msid": "135396"
  },
  {
    "title": "Aspect-Oriented Programming is Quantification and Obliviousness",
    "abstract": "This paper proposes that the distinguishing characteristic of Aspect-Oriented Programming (AOP) systems is that they allow programming by making quantified programmatic assertions over programs written by programmers oblivious to such assertions. Thus, AOP systems can be analyzed with respect to three critical dimensions: the kinds of quantifications allowed, the nature of the actions that can be asserted, and the mechanism for combining base-level actions with as- serted actions. Consequences of this perspective are the recognition that certain systems are not AOP and that some mechanisms are expressive enough to allow programming an AOP system within them. A corollary is that while AOP can be applied to Object-Oriented Programming, it is an independent concept applicable to other programming styles.",
    "cite_count": "424",
    "location": {
      "url": "../Conference/298/aosd-aspect-oriented-software-development",
      "name": "Aspect-Oriented Software Development - AOSD"
    },
    "authors": [
      {
        "name": "Robert E. Filman",
        "msid": "109445"
      },
      {
        "name": "Daniel P. Friedman",
        "msid": "1208807"
      }
    ],
    "id": "135",
    "msid": "140889"
  },
  {
    "title": "Modern Information Retrieval",
    "abstract": " Information retrieval  (IR) has changed considerably in the last years with the expansion of the Web (World Wide Web) and the advent of modern and inexpensive graphical user interfaces and mass storage devices. As a result, traditional IR textbooks have become quite out-of-date which has led to the introduction of new IR books recently. Nevertheless, we believe that there is still great need of a book that approaches the field in a rigorous and complete way from a computer-science perspective... ",
    "cite_count": "4930",
    "location": {},
    "authors": [
      {
        "name": "Ricardo A. Baeza-yates",
        "msid": "7920"
      },
      {
        "name": "Berthier A. Ribeiro-neto",
        "msid": "374570"
      }
    ],
    "id": "136",
    "msid": "142598"
  },
  {
    "DOI": "10.1109/ISWC.1998.729534",
    "title": "Adding Generic Contextual Capabilities to Wearable Computers",
    "abstract": "Context-awareness has an increasingly important role to play in the development of wearable computing systems. In order to better define this role we have identified four generic contextual capabilities: sensing, adaptation, resource discovery, and augmentation. A prototype application has been constructed to explore how some of these capabilities could be deployed in a wearable system designed to aid an ecologist's observations of giraffe in a Kenyan game reserve. However, despite the benefits of context-awareness demonstrated in this prototype, widespread innovation of these capabilities is currently stifled by the difficulty in obtaining the contextual data. To remedy this situation the Contextual Information  Service (CIS) is introduced. Installed on the user's wearable computer, the CIS provides a common point of access for clients to obtain, manipulate and model contextual information  independently of the underlying plethora of data formats and sensor interface mechanisms.",
    "cite_count": "235",
    "location": {
      "url": "../Conference/1247/iswc-international-symposium-on-wearable-computers",
      "name": "International Symposium on Wearable Computers - ISWC"
    },
    "authors": [
      {
        "name": "Jason Pascoe",
        "msid": "513348"
      }
    ],
    "id": "137",
    "msid": "144262"
  },
  {
    "DOI": "10.1145/358916.358995",
    "title": "Explaining collaborative filtering recommendations",
    "abstract": "Automated collaborative filtering  (ACF) systems predict a person's affinity for items or information by connecting that person's recorded interests with the recorded interests of a community of people and sharing ratings between like-minded persons. However, current recommender systems are black boxes, providing no transparency into the working of the recommendation. Explanations provide that transparency, exposing the reasoning and data behind a recommendation. In this paper, we address explanation interfaces for ACF systems - how they should be implemented and why they should be implemented. To explore how, we present a model for explanations based on the user's conceptual model  of the recommendation process. We then present experimental results demonstrating what components of an  explanation are the most compelling. To address why, we present experimental evidence that shows that providing explanations can improve the acceptance of ACF systems. We also describe some initial explorations into measuring how explanations can improve the filtering performance of users.",
    "cite_count": "403",
    "location": {
      "url": "../Conference/605/cscw-conference-on-computer-supported-cooperative-work",
      "name": "Conference on Computer Supported Cooperative Work - CSCW"
    },
    "authors": [
      {
        "name": "Jonathan L. Herlocker",
        "msid": "52066"
      },
      {
        "name": "Joseph A. Konstan",
        "msid": "68554"
      },
      {
        "name": "John Riedl",
        "msid": "2172501"
      }
    ],
    "id": "138",
    "msid": "144499"
  },
  {
    "DOI": "10.1145/238386.238450",
    "title": "Silk from a sow's ear: extracting usable structures from the Web",
    "abstract": "In its current implementation, the World-Wide Web lacks much of the explicit structure and strong typing found in many closed hypertext systems. While this property probably relates to the explosive acceptance of the Web, it further complicates the already difficult problem of identifying usable structures and aggregates in large hypertext collections. These reduced structures, or localities, form the basis for simplifying visualizations of and navigation through complex hypertext systems. Much of the previous research into identifying aggregates utilize graph theoretic algorithms based upon structural topology, i.e., the linkages between items. Other research has focused on content analysis  to form document collections. This paper presents our exploration into techniques that utilize both the topology and textual similarity between items as well as usage data collected by servers and page meta-information lke title and size. Linear equations  and spreading activation  models are employed to arrange Web pages  based upon functional categories, node types, and relevancy.",
    "cite_count": "317",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Peter Pirolli",
        "msid": "1511322"
      },
      {
        "name": "James E. Pitkow",
        "msid": "570684"
      },
      {
        "name": "Ramana Rao",
        "msid": "2262248"
      }
    ],
    "id": "139",
    "msid": "173009"
  },
  {
    "DOI": "10.1145/218380.218454",
    "title": "Fast multiresolution image querying",
    "abstract": "We present a method for searching in an image database  using a query image that is similar to the intended target. The query im- age may be a hand-drawn sketch or a (potentially low-quality) scan of the image to be retrieved. Our searching algorithm makes use of multiresolution wavelet decompositions of the query and database images. The coefficients of these decompositions are distilled into small \"signatures\" for each image. We introduce an \"image query- ing metric\" that operates on these signatures. This metric essentially compares how many significant wavelet coefficients the query has in common with potential targets. The metric includes parameters that can be tuned, using a statistical analysis, to accommodate the kinds of image distortions found in different types of image queries. The resulting algorithm is simple, requires very little storage overhead for the database of signatures, and is fast enough to be performed on a database of 20,000 images at interactive rates (on standard desktop machines) as a query is sketched. Our experiments with hundreds of queries in databases of 1000 and 20,000 images show dramatic improvement, in both speed and success rate, over using a conven- tional L1, L2, or color histogram  norm.",
    "cite_count": "441",
    "location": {
      "url": "../Conference/1563/siggraph-annual-conference-on-computer-graphics",
      "name": "Annual Conference on Computer Graphics - SIGGRAPH"
    },
    "authors": [
      {
        "name": "Charles E. Jacobs",
        "msid": "1165063"
      },
      {
        "name": "Adam Finkelstein",
        "msid": "400706"
      },
      {
        "name": "David H. Salesin",
        "msid": "42214"
      }
    ],
    "id": "140",
    "msid": "173527"
  },
  {
    "DOI": "10.1109/INFCOM.1997.644510",
    "title": "An Empirical Model of HTTP Network Traffic",
    "abstract": "The workload of the global Internet is dominated by the Hypertext T ransfer Protocol (HTTP), an application protocol used by World Wide Web  clients and servers. Simulation studies of this envi- ronment will require a model of the traf fic patterns of the World Wide Web, in order to investigate the performance aspects of this increasingly popular application. W e have developed an empirical model  of network traffic  produced by HTTP. Instead of relying on server or client logs, our approach is based on gathering packet traces of HTTP network conversations. Through traf fic anal- ysis, we have determined statistics and distributions for higher -level quantities such as the size of HTTP items retrieved, the number of items per \"W eb page\", think time, and user browsing behav- ior. These quantities form a model can then be used by simulations to mimic World Wide Web  net- work applications in wide-area IP internetworks.",
    "cite_count": "348",
    "location": {
      "url": "../Conference/69/infocom-ieee-infocom",
      "name": "IEEE INFOCOM - INFOCOM"
    },
    "authors": [
      {
        "name": "Bruce A. Mah",
        "msid": "800471"
      }
    ],
    "id": "141",
    "msid": "186694"
  },
  {
    "title": "The TREC Spoken Document Retrieval Track: A Success Story",
    "abstract": "This paper describes work within the NIST Text REtr ieval Conference (TREC) over the last three years i n designing and implementing evaluations of Spoken Document Retrieval  (SDR) technology within a broadcast news  domain. SDR involves the search and retrieval  of excerpts f rom spoken audio recordings using a combination of automatic speech recognition  and information retrieval  techno logies. The TREC SDR Track has provided an infrastructure for the development and evaluation of SDR technology and a common forum for the exchange of knowledge between the speech recognition  and information retrieval  re search communities. The SDR Track can be declared a success in that it has provided objective, demonstrable proof that this technology can be successfully applied to realistic audio collections using a combination of existing technol ogies and that it can be objectively evaluated. Th e design and implementation  of each of the SDR evaluations are presented and the results are summarized. Plans for the 2000 TREC SDR Track are presented and thoughts about how the track might evolve are discussed.",
    "cite_count": "184",
    "location": {
      "url": "../Conference/2830/riao-recherche-d-information-assistee-par-ordinateur",
      "name": "Recherche d'Information Assistee par Ordinateur - RIAO"
    },
    "authors": [
      {
        "name": "John S. Garofolo",
        "msid": "515065"
      },
      {
        "name": "Cedric G. P. Auzanne",
        "msid": "314544"
      },
      {
        "name": "Ellen M. Voorhees",
        "msid": "27925"
      }
    ],
    "id": "142",
    "msid": "186799"
  },
  {
    "title": "Recommendation as Classification: Using Social and Content-Based Information in Recommendation",
    "abstract": "Recommendation systems make suggestions about arti- facts to a user. For instance, they may predict whether a user would be interested in seeing a particular movie. Social recomendation methods collect ratings of arti- facts from many individuals and use nearest-neighbor techniques to make recommendations to a user concern- ing new artifacts. However, these methods do not use the significant amount of other information that is of- ten available about the nature of each artifact -- such as cast lists or movie reviews, for example. This paper presents an inductive learning  approach to recommen- dation that is able to use both ratings information and other forms of information about each artifact in pre- dicting user preferences. We show that our method outperforms an existing social-filtering method in the domain of movie recommendations on a dataset of more than 45,000 movie ratings collected from a community of over 250 users.",
    "cite_count": "387",
    "location": {
      "url": "../Conference/251/aaai-national-conference-on-artificial-intelligence",
      "name": "National Conference on Artificial Intelligence - AAAI"
    },
    "authors": [
      {
        "name": "Chumki Basu",
        "msid": "867848"
      },
      {
        "name": "Haym Hirsh",
        "msid": "299079"
      },
      {
        "name": "William W. Cohen",
        "msid": "2394725"
      }
    ],
    "id": "143",
    "msid": "187537"
  },
  {
    "DOI": "10.1145/347642.347795",
    "title": "A pattern approach to interaction design",
    "abstract": "To create successful interactive systems, user interface  designers need to cooperate with developers and application domain experts in an interdisciplinary team. These groups, however, usually miss a common terminology to exchange ideas, opinions, and values.This paper presents an approach that uses pattern languages to capture this knowledge in software development, HCI, and the application domain. A formal, domain-independent definition of design patterns allows for computer support without sacrificing readability, and pattern use is integrated into the usability engineering  life cycle.As an example, experience from building an award-winning interactive music  exhibit was turned into a pattern language, which was then used to inform follow-up projects and support HCI education.",
    "cite_count": "311",
    "location": {
      "url": "../Conference/631/dis-designing-interactive-systems",
      "name": "Designing Interactive Systems - DIS"
    },
    "authors": [
      {
        "name": "Jan O. Borchers",
        "msid": "288041"
      }
    ],
    "id": "144",
    "msid": "187591"
  },
  {
    "DOI": "10.1007/s007790170019",
    "title": "Understanding and Using Context",
    "abstract": "Context is a poorly used source of information in our computing environments. As a result, we have an impoverished understanding of what context is and how it can be used. In this paper, we provide an operational definition of context and discuss the different ways that context can be used by context-aware applications. We also present the Context Toolkit, an architecture that supports the building of these context-aware applications. We discuss the features and abstractions in the toolkit that make the task of building applications easier. Finally, we introduce a new abstraction, a situation, which we believe will provide additional support to application designers.",
    "cite_count": "1271",
    "location": {
      "url": "../Journal/420/puc-personal-and-ubiquitous-computing",
      "name": "Personal and Ubiquitous Computing - PUC"
    },
    "authors": [
      {
        "name": "Anind K. Dey",
        "msid": "53218821"
      }
    ],
    "id": "145",
    "msid": "187665"
  },
  {
    "DOI": "10.1109/76.718510",
    "title": "Relevance Feedback: A Power Tool for Interactive Content-Based Image Retrieval",
    "abstract": "Content-based image retrieval  (CBIR) has become one of the most active research areas in the past few years. Many visual feature representations have been explored and many systems built. While these research efforts establish the basis of CBIR, the usefulness of the proposed approaches is limited. Specifically, these efforts have relatively ignored two distinct characteristics of CBIR systems: (1) the gap between high-level concepts and low-level features, and (2) the subjectivity of human perception  of visual content. This paper proposes a relevance feedback  based interactive retrieval approach, which effectively takes into account the above two characteristics in CBIR. During the retrieval process, the user's high-level query and perception subjectivity are captured by dynamically updated weights based on the user's feedback. The experimental results over more than 70000 images show that the proposed approach greatly reduces the user's effort of composing a query, and captures the user's information need  more precisely",
    "cite_count": "990",
    "location": {
      "url": "../Journal/850/tcsv-ieee-transactions-on-circuits-and-systems-for-video-technology",
      "name": "IEEE Transactions on Circuits and Systems for Video Technology - TCSV"
    },
    "authors": [
      {
        "name": "Yong Rui",
        "msid": "1689917"
      },
      {
        "name": "Thomas S. Huang",
        "msid": "292834"
      },
      {
        "name": "Michael Ortega",
        "msid": "1341129"
      },
      {
        "name": "Sharad Mehrotra",
        "msid": "2007827"
      }
    ],
    "id": "146",
    "msid": "191246"
  },
  {
    "DOI": "10.1145/223904.223910",
    "title": "Interactive sketching for the early stages of user interface design",
    "abstract": "Current interactive user interface  construction tools are often more of a hindrance than a benefit during the early stages of user interface  design. These tools take too much time to use and force designers to specify more of the design details than they wish at this early stage. Most interface designers, especially those who have a background in graphic design, prefer to sketch early interface ideas on paper or on a whiteboard. We are developing an interactive tool called SILK that allows designers to quickly sketch an interface using an electronic pad and stylus. SILK preserves the important properties of pencil and paper: a rough drawing can be produced very quickly and the medium is very flexible. However, unlike a paper sketch, this electronic sketch is interactive and can easily be modified. In addition, our system allows designers to examine, annotate, and edit a complete history of the design. When the designer is satisfied with this early prototype, SILK can transform the sketch into a complete, operational interface in a specified look-and-feel. This transformation is guided by the designer. By supporting the early phases of the interface design  life cycle, our tool should both ease the development of user interface  prototypes and reduce the time needed to create a final interface. This paper describes our prototype and provides design ideas for a production-level system.",
    "cite_count": "265",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "James A. Landay",
        "msid": "1401225"
      },
      {
        "name": "Brad A. Myers",
        "msid": "134086"
      }
    ],
    "id": "147",
    "msid": "191367"
  },
  {
    "DOI": "10.1145/291469.291470",
    "title": "User interface directions for the Web",
    "abstract": " signing a large site requires collaborationbetween a team of UI professionals, and some UIwill prefer to stay with their traditional role of softwaredesign rather than moving into the wild worldof Web design.There are three possible solutions to the problem:. Make it possible to design reasonably usable siteswithout having UI expertise;. Train more people in good Web design; and. Live with poorly designed sites that are hard to use.The third option is not acceptable in my opinion.... ",
    "cite_count": "168",
    "location": {
      "url": "../Journal/209/cacm-communications-of-the-acm",
      "name": "Communications of The ACM - CACM"
    },
    "authors": [
      {
        "name": "Jakob Nielsen",
        "msid": "2341557"
      }
    ],
    "id": "148",
    "msid": "197794"
  },
  {
    "DOI": "10.1145/223904.223931",
    "title": "Social information filtering: algorithms for automating \"word of mouth\"",
    "abstract": "This paper describes a technique for making personalized recommendations from any type of database to a user based on similarities between the interest profile of that user and those of other users. In particular, we discuss the implementation of a networked system called Ringo, which makes personalized recommendations for music albums and artists. Ringo's database of users and artists grows dynamically as more people use the system and enter more information. Four different algorithms for making recommendations by using social information filtering  were tested and compared. We present quantitative and qualitative results obtained from the use of Ringo by more than 2000 people.",
    "cite_count": "1335",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Upendra Shardanand",
        "msid": "538057"
      },
      {
        "name": "Pattie Maes",
        "msid": "1005976"
      }
    ],
    "id": "149",
    "msid": "198585"
  },
  {
    "title": "Adaptation and Mobility in Wireless hformation Systems",
    "abstract": "A confusing array of new wireless \"untethered\" communications services, for voice and data, in real-time or delayed, interactive or one-way, in-building or out-of-doors, are rapidly becoming available. In this paper, we argue that despite the widely varying issues of engineering that span the creation of these diverse wireless services, the unique underlying aspect is that they must be able to adapt to a constantly changing environment brought on by mobility. Mobile systems  must be able to detect their transmission environment and exploit knowledge about its cur - rent situation, so-called \"situation awareness,\" to improve the quality of communications. Handoff in cellular phone systems is one example of detection and reaction to the environment. A more pervasive understanding of how to exploit adaptation and situation awareness  will be the challenge, especially as systems transition from communica- tions to more general wireless information systems.",
    "cite_count": "296",
    "location": {
      "url": "../Journal/1044/ieee-pers-commun-ieee-personal-communications",
      "name": "IEEE Personal Communications - IEEE Pers. Commun."
    },
    "authors": [
      {
        "name": "RANDY H. KATZ",
        "msid": "375319"
      }
    ],
    "id": "150",
    "msid": "203781"
  },
  {
    "DOI": "10.1145/358923.358934",
    "title": "Information retrieval on the web",
    "abstract": "In this paper we review studies of the growth of the Internet and technologies that are useful for information search and retrieval  on the Web. We present data on the Internet from several different sources, e.g., current as well as projected number of users, hosts, and Web sites. Although numerical figures vary, overall trends cited by the sources are consistent and point to exponential growth  in the past and in the coming decade. Hence it is not surprising that about 85% of Internet users surveyed claim using search engines and search services to find specific information. The same surveys show, however, that users are not satisfied with the performance of the current generation of search engines; the slow retrieval speed, communication delays, and poor quality of retrieved  results (e.g., noise and broken links) are commonly cited problems. We discuss the development of new techniques targeted to resolve some of the problems associated with Web-based information retrieval  and speculate on future trends.",
    "cite_count": "277",
    "location": {
      "url": "../Journal/210/csur-acm-computing-surveys",
      "name": "ACM Computing Surveys - CSUR"
    },
    "authors": [
      {
        "name": "Mei Kobayashi",
        "msid": "47737926"
      },
      {
        "name": "Koichi Takeda",
        "msid": "1146382"
      }
    ],
    "id": "151",
    "msid": "206623"
  },
  {
    "DOI": "10.1145/302979.303111",
    "title": "Bridging physical and virtual worlds with electronic tags",
    "abstract": "The role of computers in the modern office has divided ouractivities between virtual interactions in the realm of thecomputer and physical interactions with real objects within thetraditional office infrastructure. This paper extends previous workthat has attempted to bridge this gap, to connect physical objectswith virtual representations or computational functionality, viavarious types of tags. We discuss a variety of scenarios we haveimplemented using a novel combination of inexpensive, unobtrusiveand easy to use RFID tags, tag readers, portable computers andwireless networking. This novel combination demonstrates theutility of invisibly, seamlessly and portably linking physicalobjects to networked electronic services  and actions that arenaturally associated with their form.",
    "cite_count": "364",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Roy Want",
        "msid": "457587"
      },
      {
        "name": "Kenneth P. Fishkin",
        "msid": "308816"
      },
      {
        "name": "Anuj Gujar",
        "msid": "431874"
      },
      {
        "name": "Beverly L. Harrison",
        "msid": "205968"
      }
    ],
    "id": "152",
    "msid": "206883"
  },
  {
    "title": "A Probabilistic Approach to Collaborative Multi-Robot Localization",
    "abstract": "This paper presents a statistical algorithm for collaborative mobile robot  localization. Our approach uses a sample-based version of Markov localization, capable of localizing mobile robots in an any-time fashion. When teams of robots localize themselves in the same environment, probabilistic methods are employed to synchronize each robot's belief whenever one robot detects another. As a result, the robots localize themselves faster, maintain higher accuracy, and high-cost sensors are amortized across multiple robot platforms. The technique has been implemented and tested using two mobile robots equipped with cameras and laser range-finders for detecting other robots. The results, obtained with the real robots and in series of simulation runs, illustrate drastic improvements in localization speed and accuracy when compared to conventional single-robot localization. A further experiment demonstrates that under certain conditions, successful localization is only possible if teams of heterogeneous robots collaborate during localization.",
    "cite_count": "275",
    "location": {
      "url": "../Journal/208/arobots-autonomous-robots",
      "name": "Autonomous Robots - AROBOTS"
    },
    "authors": [
      {
        "name": "Dieter Fox",
        "msid": "764982"
      },
      {
        "name": "Wolfram Burgard",
        "msid": "410000"
      },
      {
        "name": "Hannes Kruppa",
        "msid": "77412"
      },
      {
        "name": "Sebastian Thrun",
        "msid": "361346"
      }
    ],
    "id": "153",
    "msid": "212142"
  },
  {
    "DOI": "10.1145/345508.345543",
    "title": "Evaluating evaluation measure stability",
    "abstract": "This paper presents a novel way of examining the accuracy of the evaluation measures commonly used in information retrieval  experiments. It validates several of the rules-of-thumb experimenters use, such as the number of queries needed for a good experiment is at least 25 and 50 is better, while challenging other beliefs, such as the common evaluation measures are equally reliable. As an example, we show that Precision at 30 documents has about twice the average error rate  as Average Precision  has. These results can help information retrieval  researchers design experiments that provide a desired level of confidence in their results. In particular, we suggest researchers using Web measures such as Precision at 10 documents will need to use many more than 50 queries or will have to require two methods to have a very large difference in evaluation scores before concluding that the two methods are actually different.",
    "cite_count": "235",
    "location": {
      "url": "../Conference/368/sigir-research-and-development-in-information-retrieval",
      "name": "Research and Development in Information Retrieval - SIGIR"
    },
    "authors": [
      {
        "name": "Chris Buckley",
        "msid": "1822367"
      },
      {
        "name": "Ellen M. Voorhees",
        "msid": "27925"
      }
    ],
    "id": "154",
    "msid": "214212"
  },
  {
    "DOI": "10.1007/3-540-46589-8_17",
    "title": "Aspect-Oriented Programming",
    "cite_count": "4218",
    "location": {},
    "authors": [
      {
        "name": "Gregor Kiczales",
        "msid": "840008"
      },
      {
        "name": "John Lamping",
        "msid": "153119"
      },
      {
        "name": "Anurag Mendhekar",
        "msid": "955657"
      },
      {
        "name": "Chris Maeda",
        "msid": "335089"
      },
      {
        "name": "Cristina Videira Lopes",
        "msid": "59267"
      },
      {
        "name": "Jean-Marc Loingtier",
        "msid": "1024195"
      },
      {
        "name": "John Irwin",
        "msid": "10316233"
      }
    ],
    "id": "155",
    "msid": "217077"
  },
  {
    "title": "Empirical Analysis of Predictive Algorithms for Collaborative Filtering",
    "abstract": "Collaborative filtering  or recommender systemsuse a database about user preferences  topredict additional topics or products a newuser might like. In this paper we describe several algorithms designed for this task, including techniques based on correlation coefficients,vector-based similarity calculations,and statistical Bayesian methods. We comparethe predictive accuracy of the various methods in a set of representative problemdomains. We use two basic classes of evaluation... ",
    "cite_count": "1477",
    "location": {
      "url": "../Conference/427/uai-uncertainty-in-artificial-intelligence",
      "name": "Uncertainty in Artificial Intelligence - UAI"
    },
    "authors": [
      {
        "name": "John S. Breese",
        "msid": "1419526"
      },
      {
        "name": "David Heckerman",
        "msid": "2457946"
      },
      {
        "name": "Carl Myers Kadie",
        "msid": "183201"
      }
    ],
    "id": "156",
    "msid": "217581"
  },
  {
    "DOI": "10.1145/166117.166126",
    "title": "Toolglass and Magic Lenses: The See-Through Interface",
    "abstract": "Toolglass widgets are new user interface  tools that can appear, as though on a transparent sheet of glass, between an application and a traditional cursor. They can be positioned with one hand while the other positions the cursor. The widgets provide a rich and concise vocabulary for operating on application objects. These widgets may incorporate visual filters, called Magic Lens filters, that modify the presentation of application objects to reveal hidden information, to enhance data of interest, or to suppress distracting information. Together, these tools form a see-through interface that offers many advantages over traditional controls. They provide a new style of interaction that better exploits the user' s everyday skills. They can reduce steps, cursor motion, and errors. Many widgets can be provided in a user inter - face, by designers and by users, without requiring dedicated screen space. In addition, lenses provide rich context -dependent feedback and the ability to view details and context simultaneous - ly. Our widgets and lenses can be combined to form operation and viewing macros, and can be used over multiple applications. CR Categories and Subject Descriptors: I.3.6 (Computer Graphics): Methodology and Techniques  interaction techniques; H.5.2 (Information Interfaces and Presentation): User Inter- faces interaction styles; I.3.3 ( Computer Graphics): Picture/Image Generation viewing algorithms; I.3.4 (Computer Graphics): Graphics Utilities graphics editors",
    "cite_count": "611",
    "location": {
      "url": "../Conference/1563/siggraph-annual-conference-on-computer-graphics",
      "name": "Annual Conference on Computer Graphics - SIGGRAPH"
    },
    "authors": [
      {
        "name": "Eric A. Bier",
        "msid": "154354"
      },
      {
        "name": "Maureen C. Stone",
        "msid": "460787"
      },
      {
        "name": "Kenneth A. Pier",
        "msid": "601140"
      },
      {
        "name": "William Buxton",
        "msid": "663628"
      },
      {
        "name": "Tony D. Derose",
        "msid": "790307"
      }
    ],
    "id": "157",
    "msid": "221740"
  },
  {
    "DOI": "10.1145/633292.633453",
    "title": "The smart floor: a mechanism for natural user identification and tracking",
    "abstract": "We have created a system for identifying people based on their footstep force profiles and have tested its accuracy against a large pool of footstep data. This floor system may be used to identify users transparently in their everyday living and working environments. We have created user footstep models based on footstep profile features and have been able to achieve a recognition rate of 93%. We have also shown that the effect of footwear is negligible on recognition accuracy.",
    "cite_count": "262",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Robert J. Orr",
        "msid": "899440"
      },
      {
        "name": "Gregory D. Abowd",
        "msid": "2033428"
      }
    ],
    "id": "158",
    "msid": "229743"
  },
  {
    "DOI": "10.1145/344949.344988",
    "title": "Charting past, present, and future research in ubiquitous computing",
    "abstract": "The proliferation of computing into the physical world promises more than the ubiquitous availability of computing infrastructure; it suggest new paradigms of interaction inspired by constant access to information  and computational capabilities. For the past decade, application-driven research on abiquitous computing (ubicomp) has pushed three interaction themes:natural interfaces, context-aware applications,andautomated capture and access. To chart a course for future research in ubiquitous computing, we review the accomplishments of these efforts and point to remaining research challenges. Research in ubiquitious computing implicitly requires addressing some notion of scale, whether in the number and type of devices, the physical space of    distributed computing, or the number of people using a system. We posit a new area of applications research, everyday computing, focussed on scaling interaction with respect to time. Just as pushing the availiability of computing away from the traditional desktop fundamentally changes the relationship between humans and computers, providing continuous interaction moves computing from a localized tool to a constant companion. Designing for continous interaction requires addressing interruption and reumption of intreaction, representing passages of time and providing associative storage models. Inherent in all of these interaction themes are difficult issues in the social implications of ubiquitous computing  and the challenges of    evaluating> ubiquitious computing research. Although cumulative experience points to lessons in privacy, security, visibility, and control, there are no simple guidelines for steering research efforts. Akin to any efforts involving new technologies, evaluation strategies form a spectrum  from technology feasibility efforts to long-term use studiesbut a user-centric perspective is always possible and necessary",
    "cite_count": "708",
    "location": {
      "url": "../Journal/220/tochi-acm-transactions-on-computer-human-interaction",
      "name": "ACM Transactions on Computer-human Interaction - TOCHI"
    },
    "authors": [
      {
        "name": "Gregory D. Abowd",
        "msid": "2033428"
      },
      {
        "name": "Elizabeth D. Mynatt",
        "msid": "155433"
      }
    ],
    "id": "159",
    "msid": "245032"
  },
  {
    "title": "Combining Collaborative Filtering with Personal Agents for Better Recommendations",
    "abstract": "Information filtering  agents and collaborative filtering  both attempt to alleviate information overload  by identifying which items a user will find worthwhile. Information filtering  (IF) focuses on the analysis of item content and the development of a personal user interest profile. Collaborative filtering  (CF) focuses on identificatio n of other users with similar tastes and the use of their opinions to recommend items. Each technique has advantages and limitations that suggest that the two could be beneficially combined. This paper shows that a CF framework can be used to combine personal IF agents and the opinions of a community of users to produce better recommendations than either agents or users can produce alone. It also shows that using CF to create a personal combination of a set of agents produces better results than either individual agents or other combination mechanisms. One key implication of these results is that users can avoid having to select among agents; they can use them all and let the CF framework select the best ones for them.",
    "cite_count": "353",
    "location": {
      "url": "../Conference/251/aaai-national-conference-on-artificial-intelligence",
      "name": "National Conference on Artificial Intelligence - AAAI"
    },
    "authors": [
      {
        "name": "Nathaniel Good",
        "msid": "858443"
      },
      {
        "name": "J. Ben Schafer",
        "msid": "229132"
      },
      {
        "name": "Joseph A. Konstan",
        "msid": "68554"
      },
      {
        "name": "Al Borchers",
        "msid": "1447737"
      },
      {
        "name": "Badrul M. Sarwar",
        "msid": "338344"
      },
      {
        "name": "Jonathan L. Herlocker",
        "msid": "52066"
      },
      {
        "name": "John Riedl",
        "msid": "2172501"
      }
    ],
    "id": "160",
    "msid": "254361"
  },
  {
    "DOI": "10.1109/MCSA.1994.512740",
    "title": "Context-aware computing applications",
    "abstract": "Describes systems that examine and react to an individual's changing context. Such systems can promote and mediate people's interactions with devices, computers and other people, and they can help navigate unfamiliar places. We believe that a limited amount of information covering a person's proximate environment is most important for this form of computing, since the interesting part of the world around us is what we can see, hear and touch. In this paper, we define context-aware computing and describe four categories of context-aware applications: proximate selection, automatic contextual reconfiguration, contextual information  and commands, and content-triggered actions. Instances of these application types have been prototyped on the PARCTAB, a wireless palm-sized computer",
    "cite_count": "1257",
    "location": {
      "url": "../Conference/509/wmcsa-workshop-on-mobile-computing-systems-and-applications",
      "name": "Workshop on Mobile Computing Systems and Applications - WMCSA"
    },
    "authors": [
      {
        "name": "Bill N. Schilit",
        "msid": "765201"
      },
      {
        "name": "Norman Adams",
        "msid": "143185"
      },
      {
        "name": "Roy Want",
        "msid": "457587"
      }
    ],
    "id": "161",
    "msid": "262714"
  },
  {
    "title": "Learning Collaborative Information Filters",
    "abstract": "Predicting items a user would like on the basis of other users' ratings for these items has become a well-established strategy adopted by many recommendation services on the Internet. Although this can be seen as a classification problem, algo- rithms proposed thus far do not draw on results from the ma- chine learning literature. We propose a representation for collaborative filtering  tasks that allows the application of virtually any machine learning  algorithm. We identify the shortcomings of current collaborative filtering  techniques and propose the use of learning algorithms paired with feature extraction  techniques that specifically address the limitations of previous approaches. Our best-performing algorithm is based on the singular value decomposition  of an initial matrix of user ratings, exploiting latent structure that essentially eliminates the need for users to rate common items in order to become predictors for one another's preferences. We evaluate the proposed algorithm on a large database of user ratings for motion pictures  and find that our approach significantly out- performs current collaborative filtering  algorithms.",
    "cite_count": "393",
    "location": {
      "url": "../Conference/35/icml-international-conference-on-machine-learning",
      "name": "International Conference on Machine Learning - ICML"
    },
    "authors": [
      {
        "name": "Daniel Billsus",
        "msid": "1952572"
      },
      {
        "name": "Michael J. Pazzani",
        "msid": "2226818"
      }
    ],
    "id": "162",
    "msid": "265373"
  },
  {
    "DOI": "10.1109/INFCOM.2000.832252",
    "title": "RADAR: An In-Building RF-based User Location and Tracking System",
    "abstract": "The proliferation of mobile computing devices and local-area wireless networks has fostered a growing interest in location-aware systems and services. In this paper we present RADAR, a radio-frequency (RF) based system for locating and tracking users inside buildings. RADAR operates by recording and processing signal strength  information at multiple base stations positioned to provide overlapping coverage in the area of interest. It combines empirical measurements with signal propagation modeling to determine user location and thereby enable location- aware services and applications. We present experimental results that demonstrate the ability of RADAR to estimate user location with a high degree of accuracy.",
    "cite_count": "2507",
    "location": {
      "url": "../Conference/69/infocom-ieee-infocom",
      "name": "IEEE INFOCOM - INFOCOM"
    },
    "authors": [
      {
        "name": "Paramvir Bahl",
        "msid": "1170474"
      },
      {
        "name": "Venkata N. Padmanabhan",
        "msid": "649998"
      }
    ],
    "id": "163",
    "msid": "270086"
  },
  {
    "DOI": "10.1007/3-540-69706-3_4",
    "title": "Ambient Displays: Turning Architectural Space into an Interface between People and Digital Information",
    "abstract": "We envision that the architectural space we inhabit will be a new form of interface between humans and online digital information. This paper discusses Ambient Displays: a new approach to interfacing people with online digital information. Ambient Displays present information within a space through subtle changes in light, sound, and movement, which can be processed in the background of awareness. We describe the design and implementation  of two example Ambient Displays, the ambientROOM and Ambient Fixtures. Additionally, we discuss applications of Ambient Displays and propose theories of design of such interfaces based on our initial experiences.",
    "cite_count": "235",
    "location": {
      "url": "../Conference/583/cobuild-cooperative-buildings",
      "name": "Cooperative Buildings - CoBuild"
    },
    "authors": [
      {
        "name": "Craig Wisneski",
        "msid": "2104833"
      },
      {
        "name": "Hiroshi Ishii",
        "msid": "1822502"
      },
      {
        "name": "Andrew Dahley",
        "msid": "3324121"
      },
      {
        "name": "Matthew G. Gorbet",
        "msid": "9153499"
      },
      {
        "name": "Scott Brave",
        "msid": "143124"
      },
      {
        "name": "Brygg Ullmer",
        "msid": "572606"
      },
      {
        "name": "Paul Yarin",
        "msid": "49491"
      }
    ],
    "id": "164",
    "msid": "274287"
  },
  {
    "DOI": "10.1145/244130.244151",
    "title": "VisualSEEk: A Fully Automated Content-Based Image Query System",
    "abstract": "We describe a highly functional prototype system for searching by visual features  in an image database. The VisualSEEk system is novel in that the user forms the queries by diagramming spatial arrangements of color regions. The system finds the images that contain the most similar arrangements of similar regions. Prior to the queries, the system automatically extracts and in- dexes salient color regions from the images. By utilizing efficient indexing techniques for color information, re- gion sizes and absolute and relative spatial locations, a wide variety of complex joint color/spatial queries may be computed.",
    "cite_count": "961",
    "location": {
      "url": "../Conference/167/mm-acm-multimedia-conference",
      "name": "ACM Multimedia Conference - MM"
    },
    "authors": [
      {
        "name": "John R. Smith",
        "msid": "2132587"
      },
      {
        "name": "Shih-fu Chang",
        "msid": "404379"
      }
    ],
    "id": "165",
    "msid": "275561"
  },
  {
    "DOI": "10.1145/263407.263551",
    "title": "The metaDESK: Models and Prototypes for TangibleUser Interfaces",
    "abstract": "The metaDESK is a user interface  platform demonstrating new interaction techniques we call \"tangible user inter- faces.\" We explore the physical instantiation of interface elements from the graphical user interface  paradigm, giving physical form to windows, icons, handles, menus, and controls. The design and implementation  of the metaDESK display, sensor, and software architectures is discussed. A prototype application driving an interaction with geographi- cal space, Tangible Geospace, is presented to demonstrate these concepts.",
    "cite_count": "301",
    "location": {
      "url": "../Conference/431/uist-user-interface-software-and-technology",
      "name": "User Interface Software and Technology - UIST"
    },
    "authors": [
      {
        "name": "Brygg Ullmer",
        "msid": "572606"
      },
      {
        "name": "Hiroshi Ishii",
        "msid": "1822502"
      }
    ],
    "id": "166",
    "msid": "280186"
  },
  {
    "DOI": "10.1145/258549.258715",
    "title": "Tangible bits: towards seamless interfaces between people, bits and atoms",
    "abstract": "This paper presents our vision of Human Computer Interaction  (HCI): \"Tangible Bits.\" Tangible Bits allows users to \"grasp & manipulate\" bits in the center of users' attention by coupling the bits with everyday physical objects and architectural surfaces. Tangible Bits also enables users to be aware of background bits at the periphery of human perception  using ambient display  media such as light, sound, airflow, and water movement in an augmented space. The goal of Tangible Bits is to bridge the gaps between both cyberspace and the physical environment, as well as the foreground and background of human activities. This paper describes three key concepts of Tangible Bits: interactive surfaces; the coupling of bits with graspable physical objects; and ambient media  for background awareness. We illustrate these concepts with three prototype systems - the metaDESK, transBOARD and ambientROOM - to identify underlying research issues.",
    "cite_count": "1469",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Hiroshi Ishii",
        "msid": "1822502"
      },
      {
        "name": "Brygg Ullmer",
        "msid": "572606"
      }
    ],
    "id": "167",
    "msid": "282336"
  },
  {
    "DOI": "10.1145/344949.344959",
    "title": "Past, present, and future of user interface software tools",
    "abstract": "A user interface software  tool helps developers design and implement the user interface. Research on past tools has had enormous impact on today's developersvirtually all applications today are built using some form of user interface  tool. In this article, we consider cases of both success and failure in past user interface  tools. From these cases we extract a set of themes which can serve as lessons for future work. Using these themes, past tools can be characterized by what aspects of the user interface  they addressed, their threshold and ceiling, what path of least resistance they offer, how predictable they are to use, and whether they addressed a target that became irrelevant. We believe the lessons of these past themes are particularly important now, because increasingly  rapid technological changes are likely to significantly change user interfaces. We are at the dawn of an era where user interfaces are about to break out of the \"desktop\" box where they have been stuck for the past 15 years. The next millenium will open with an increasing diversity of user interface  on an increasing diversity of computerized devices. These devices include hand-held personal digital assistants (PDAs), cell phones, pages, computerized pens, computerized notepads, and various kinds of desk and wall size-computers, as well as devices in everyday objects (such as mounted on refridgerators, or even embedded in truck tires). The increased connectivity of computers, initially evidenced by the World Wide Web, but spreading also with technologies such as personal-area  networks, will also have a profound effect on the user interface  to computers. Another important force will be recognition-based user interfaces, especially speech, and camera-based vision systems. Other changes we see are an increasing need for 3D and end-user customization, programming, and scripting. All of these changes will require significant support from the underlying user interface  sofware tools.",
    "cite_count": "283",
    "location": {
      "url": "../Journal/220/tochi-acm-transactions-on-computer-human-interaction",
      "name": "ACM Transactions on Computer-human Interaction - TOCHI"
    },
    "authors": [
      {
        "name": "Brad A. Myers",
        "msid": "134086"
      },
      {
        "name": "Scott E. Hudson",
        "msid": "440269"
      },
      {
        "name": "Randy F. Pausch",
        "msid": "1603580"
      }
    ],
    "id": "168",
    "msid": "285010"
  },
  {
    "title": "Evaluating Collaborative Filtering Recommender Systems",
    "abstract": "Recommender systems have been evaluated in many, often incomparable, ways. In this article, we review the key decisions in evaluating collaborative filtering  recommender systems: the user tasks being evaluated, the types of analysis and datasets being used, the ways in which prediction quality is measured, the evaluation of prediction attributes other than quality, and the user-based evaluation of the system as a whole. In addition to reviewing the evaluation strategies used by prior researchers, we present empirical results from the analysis of various accuracy metrics on one con- tent domain where all the tested metrics collapsed roughly into three equivalence classes. Metrics within each equivalency class were strongly correlated, while metrics from different equivalency classes were uncorrelated.",
    "cite_count": "512",
    "location": {},
    "authors": [
      {
        "name": "JONATHAN L. HERLOCKER",
        "msid": "52066"
      },
      {
        "name": "JOSEPH A. KONSTAN",
        "msid": "68554"
      },
      {
        "name": "LOREN G. TERVEEN",
        "msid": "175128"
      },
      {
        "name": "JOHN T. RIEDL",
        "msid": "2172501"
      }
    ],
    "id": "169",
    "msid": "304252"
  },
  {
    "DOI": "10.1145/276304.276312",
    "title": "CURE: An Efficient Clustering Algorithm for Large Databases",
    "abstract": "Clustering, in data mining, is useful for discovering groups and identifying interesting distributions in the underlying data. Traditional clustering algorithms either favor clusters with spherical shapes and similar sizes, or are very frag- ile in the presence of outliers. We propose a new cluster- ing algorithm called CURE that is more robust to outliers, and identifies clusters having non-spherical shapes and wide variances in size. CURE achieves this by representing each cluster by a certain fixed number of points that are gen- erated by selecting well scattered points from the cluster and then shrinking them toward the center of the cluster by a specified fraction. Having more than one representa- tive point per cluster allows CURE to adjust well to the geometry of non-spherical shapes and the shrinking helps to dampen the effects of outliers. To handle large databases, CURE employs a combination of random sampling  and par- titioning. A random sample drawn from the data set is first partitioned and each partition is partially clustered. The partial clusters are then clustered in a second pass to yield the desired clusters. Our experimental results confirm that the quality of clusters produced by CURE is much better than those found by existing algorithms. Furthermore, they demonstrate that random sampling  and partitioning enable CURE to not only outperform existing algorithms but also to scale well for large databases without sacrificing cluster- ing quality.",
    "cite_count": "865",
    "location": {
      "url": "../Conference/370/sigmod-international-conference-on-management-of-data",
      "name": "International Conference on Management of Data - SIGMOD"
    },
    "authors": [
      {
        "name": "Sudipto Guha",
        "msid": "235702"
      },
      {
        "name": "Rajeev Rastogi",
        "msid": "188778"
      },
      {
        "name": "Kyuseok Shim",
        "msid": "5061"
      }
    ],
    "id": "170",
    "msid": "307475"
  },
  {
    "DOI": "10.1108/eb047254",
    "title": "World-Wide Web: The Information Universe",
    "abstract": "The World-Wide Web (W3) initiative is a practical project to bring a global information universe into existence using available technology. This article describes the aims, data model, and protocols needed to implement the \"web\", and compares them with various contemporary systems. The Dream Pick up your pen, mouse or favorite pointing device  and press it on a reference in this document - perhaps to the author's name, or organization, or some related work. Suppose you are directly presented with the background material - other papers, the author's coordinates, the organization's address and its entire telephone directory. Suppose each of these documents has the same property of being linked to other original documents all over the world. You would have at your fingertips all you need to know about electronic publishing, high-energy physics or for that matter Asian culture. If you are reading this article on paper, you can only dream, but read on. Since Vannevar Bush's article (1), men have dreamed of extending their intellect by making their collective knowledge available to each individual by using machines. Computers give us two practical techniques for the man-knowledge interface. One is hypertext, in which links between pieces of text (or other media) mimic human association of ideas. The other is text retrieval, which allows associations to be deduced from the content of text. In the first case, the reader's operation is typically to click with a mouse (or type in a reference number) - in the second case, it is to supply some words representing that which he desires. The W3 ideal world allows both operations, and provides access from any browsing platform.",
    "cite_count": "417",
    "location": {
      "url": "../Journal/354/en-electronic-networking-research-applications-and-policy",
      "name": "Electronic Networking: Research, Applications and Policy - EN"
    },
    "authors": [
      {
        "name": "Tim Berners-lee",
        "msid": "38181"
      },
      {
        "name": "Robert Cailliau",
        "msid": "53673"
      },
      {
        "name": "Jean-françois Groff",
        "msid": "695385"
      },
      {
        "name": "Bernd Pollermann",
        "msid": "1496010"
      }
    ],
    "id": "171",
    "msid": "308079"
  },
  {
    "DOI": "10.1109/2.274999",
    "title": "The Challenges of Mobile Computing",
    "abstract": " Advances in wireless networking technology have engendered a new paradigm ofcomputing, called mobile computing, in which users carrying portable devices haveaccess to a shared infrastructure independent of their physical location. This providesflexible communication between people and continuous access to networked services.Mobile computing is expected to revolutionize the way computers are used.This paper is a survey of the fundamental software design  pressures particular tomobile... ",
    "cite_count": "621",
    "location": {
      "url": "../Journal/11/computer-ieee-computer",
      "name": "IEEE Computer - COMPUTER"
    },
    "authors": [
      {
        "name": "George H. Forman",
        "msid": "2039653"
      },
      {
        "name": "John Zahorjan",
        "msid": "889992"
      }
    ],
    "id": "172",
    "msid": "320417"
  },
  {
    "DOI": "10.1145/142750.143054",
    "title": "Dynamic queries for information exploration: an implementation and evaluation",
    "abstract": "We designed, implemented and evaluated a new concept for direct manipulation  of databases, called dynamic queries, that allows users to formulate queries with graphical widgets, such as sliders. By providing a graphical visualization of the database and search results, users can find trends and exceptions easily. Eighteen undergraduate chemistry students performed statistically significantly faster using a dynamic queries interface compared to two interfaces both providing form fill-in as input method, one with graphical visualization output and one with all-textual output. The interfaces were used to explore the periodic table of elements and search on their properties.",
    "cite_count": "329",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Christopher Ahlberg",
        "msid": "1291815"
      },
      {
        "name": "Christopher Williamson",
        "msid": "1516478"
      },
      {
        "name": "Ben Shneiderman",
        "msid": "899177"
      }
    ],
    "id": "173",
    "msid": "329837"
  },
  {
    "DOI": "10.1109/65.313011",
    "title": "Disseminating active map information to mobile hosts",
    "abstract": "The article describes an active map service (AMS) that supports context-aware computing by providing clients with information about located-objects and how those objects change over time. The authors focus on the communication issues of disseminating information from an active map server to its clients, and in particular, address how to deal with various overload situations that can occur. Simple unicast callbacks to interested clients work well enough if only a few located-objects are moving at any given time and only a few clients wish to know about any given move. However, if many people are moving about in the same region and many clients are interested in their motion, then the AMS may experience overload due to the quadratic nature of the communications involved. This overload affects both the server as well as any slow communications links being used. Mobile distributed computing  enables users to interact with many different mobile and stationary computers over the course of the day. Navigating a mobile environment  can be aided by active maps that describe the location and characteristics of objects within some region as they change over time",
    "cite_count": "397",
    "location": {
      "url": "../Journal/406/network-ieee-network",
      "name": "IEEE Network - NETWORK"
    },
    "authors": [
      {
        "name": "B. N. Schilit",
        "msid": "765201"
      },
      {
        "name": "M. M. Theimer",
        "msid": "757151"
      }
    ],
    "id": "174",
    "msid": "334206"
  },
  {
    "DOI": "10.1006/ijhc.1996.0048",
    "title": "External cognition: how do graphical representations work?",
    "abstract": "Running title: External Cognition: how do Graphical Representations work?",
    "cite_count": "426",
    "location": {
      "url": "../Journal/75/ijmms-international-journal-of-human-computer-studies-international-journal-of-man-machine",
      "name": "International Journal of Human-computer Studies / International Journal of Man-machine Studies - IJMMS"
    },
    "authors": [
      {
        "name": "Michael Scaife",
        "msid": "1047540"
      },
      {
        "name": "Yvonne Rogers",
        "msid": "732439"
      }
    ],
    "id": "175",
    "msid": "334289"
  },
  {
    "DOI": "10.1145/192844.192905",
    "title": "GroupLens: an open architecture for collaborative filtering of netnews",
    "abstract": "Collaborative filters help people make choices based on the opinions of other people. GroupLens is a system for collaborative filtering  of netnews, to help people find articles they will like in the huge stream of available articles. News reader clients display predicted scores and make it easy for users to rate articles after they read them. Rating servers, called Better Bit Bureaus, gather and disseminate the ratings. The rating servers predict scores based on the heuristic that people who agreed in the past will probably agree again. Users can protect their privacy by entering ratings under pseudonyms, without reducing the effectiveness of the score prediction. The entire architecture is open: alternative software for news clients and Better Bit Bureaus can be developed  independently and can interoperate with the components we have developed.",
    "cite_count": "1541",
    "location": {
      "url": "../Conference/605/cscw-conference-on-computer-supported-cooperative-work",
      "name": "Conference on Computer Supported Cooperative Work - CSCW"
    },
    "authors": [
      {
        "name": "Paul Resnick",
        "msid": "74775"
      },
      {
        "name": "Neophytos Iacovou",
        "msid": "3993"
      },
      {
        "name": "Mitesh Suchak",
        "msid": "1725677"
      },
      {
        "name": "Peter Bergstrom",
        "msid": "5218"
      },
      {
        "name": "John Riedl",
        "msid": "2172501"
      }
    ],
    "id": "176",
    "msid": "340335"
  },
  {
    "title": "Characteristics of WWW Client-based Traces",
    "cite_count": "423",
    "location": {},
    "authors": [
      {
        "name": "Carlos R. Cunha",
        "msid": "590382"
      },
      {
        "name": "Azer Bestavros",
        "msid": "1648575"
      },
      {
        "name": "Mark E. Crovella",
        "msid": "1061436"
      }
    ],
    "id": "177",
    "msid": "342112"
  },
  {
    "DOI": "10.1145/159544.159630",
    "title": "Interacting with paper on the DigitalDesk",
    "abstract": " this article is divided into four parts: a brief description of the system, some exampleapplications, some technical issues, and finally some concluding observations.\fPublished in Communications of the ACM, July 1993 EuroPARC tech report EPC-93-195 Page 3 / 17 ",
    "cite_count": "605",
    "location": {
      "url": "../Journal/209/cacm-communications-of-the-acm",
      "name": "Communications of The ACM - CACM"
    },
    "authors": [
      {
        "name": "Pierre Wellner",
        "msid": "140681"
      }
    ],
    "id": "178",
    "msid": "347375"
  },
  {
    "DOI": "10.1109/69.553155",
    "title": "Data Mining: An Overview from a Database Perspective",
    "abstract": " Mining information and knowledge from large databases has been recognized by many researchers as a key research topic in database systems and machine learning, and by many industrial companies as an important area with an opportunity of major revenues. Researchers in many different fields have shown great interest in data mining. Several emerging applications in information providing services, such as data warehousing  and on-line services over the Internet, also call for various data mining... ",
    "cite_count": "879",
    "location": {
      "url": "../Journal/22/tkde-ieee-transactions-on-knowledge-and-data-engineering",
      "name": "IEEE Transactions on Knowledge and Data Engineering - TKDE"
    },
    "authors": [
      {
        "name": "Ming-syan Chen",
        "msid": "1827666"
      },
      {
        "name": "Jiawei Han",
        "msid": "594572"
      },
      {
        "name": "Philip S. Yu",
        "msid": "1329"
      }
    ],
    "id": "179",
    "msid": "359671"
  },
  {
    "DOI": "10.1109/2945.468391",
    "title": "Visualizing Network Data",
    "abstract": "Networks are critical to modern society, and a thorough understanding of how they behave is crucial to their efficient operation. Fortunately, data on networks is plentiful; by visualizing this data, it is possible to greatly improve our understanding. Our focus is on visualizing the data associated with a network and not on simply visualizing the structure of the network itself. We begin with three static network displays; two of these use geographical relationships, while the third is a matrix arrangement that gives equal emphasis to all network links. Static displays can be swamped with large amounts of data; hence we introduce direct- manipulation techniques that permit the graphs to continue to reveal relationships in the context of much more data. In effect, the static displays are parameterized so that interesting views may easily be discovered interactively. The software to carry out this network visualization  is called SeeNet.",
    "cite_count": "217",
    "location": {
      "url": "../Journal/29/tvcg-ieee-transactions-on-visualization-and-computer-graphics",
      "name": "IEEE Transactions on Visualization and Computer Graphics - TVCG"
    },
    "authors": [
      {
        "name": "Richard A. Becker",
        "msid": "1073960"
      },
      {
        "name": "Stephen G. Eickt",
        "msid": "53518316"
      },
      {
        "name": "Allan R. Wilks",
        "msid": "2069819"
      }
    ],
    "id": "180",
    "msid": "362729"
  },
  {
    "DOI": "10.1145/223904.223938",
    "title": "Virtual reality on a WIM: interactive worlds in miniature",
    "abstract": "This paper explores a user interface  technique which aug- ments an immersive head tracked display with a hand-held miniature copy of the virtual environment. We call this interface technique the Worlds in Miniature (WIM) meta- phor. In addition to the first-person perspective offered by a virtual reality  system, a World in Miniatureoffers a second dynamic viewport onto the virtual environment. Objects may be directly manipulated either through the immersive viewport or through the three-dimensional viewport offered by the WIM. In addition to describing object manipulation, this paper explores ways in which Worlds in Miniature can act as a single unifying metaphor for such application independent interaction techniques as object selection, navigation, path planning, and visualization. The WIM metaphor offers mul- tiple points of view and multiple scales  at which the user can operate, without requiring explicit modes or com- mands. Informal user observation indicates that users adapt to the Worlds in Miniature metaphor quickly and that physical props are helpful in manipulating the WIM and other objects in the environment.",
    "cite_count": "356",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Richard Stoakley",
        "msid": "1974538"
      },
      {
        "name": "Matthew J. Conway",
        "msid": "1549953"
      },
      {
        "name": "Randy F. Pausch",
        "msid": "1603580"
      }
    ],
    "id": "181",
    "msid": "371271"
  },
  {
    "DOI": "10.1145/128756.128759",
    "title": "The Active Badge Location System",
    "abstract": "A novel system for the location of people in an office\n                 environment is described. Members of staff wear badges\n                 that transmit signals providing information about their\n                 location to a centralized location service, through a\n                 network of sensors. The paper also examines alternative\n                 location techniques, system design  issues and\n                 applications, particularly relating to telephone call\n                 routing. Location systems raise concerns about the\n                 privacy of an individual, and these issues are also\n                 addressed.",
    "cite_count": "1867",
    "location": {
      "url": "../Journal/51/tois-acm-transactions-on-information-systems",
      "name": "ACM Transactions on Information Systems - TOIS"
    },
    "authors": [
      {
        "name": "Roy Want",
        "msid": "457587"
      },
      {
        "name": "Andy Hopper",
        "msid": "610827"
      },
      {
        "name": "Veronica Falcão",
        "msid": "3823278"
      },
      {
        "name": "Jonathan Gibbons",
        "msid": "1606085"
      }
    ],
    "id": "182",
    "msid": "377249"
  },
  {
    "title": "A Distributed Location System for the Active Office",
    "abstract": " This article describes the technology of a system forlocating people and equipment, and the design of a distributed system  service supportingaccess to that information. The application interfaces which are made possible by, orbenefit from this facility are presented.1 Location TechnologyThe topology of a fixed network of wireless receivers is the basis for a location system.The position of a mobile wireless transmitter is determined by the identity of the receiverswithin the network.... ",
    "cite_count": "315",
    "location": {
      "url": "../Journal/406/network-ieee-network",
      "name": "IEEE Network - NETWORK"
    },
    "authors": [
      {
        "name": "Andy Harter",
        "msid": "1322476"
      },
      {
        "name": "Andy Hopper",
        "msid": "610827"
      }
    ],
    "id": "183",
    "msid": "387520"
  },
  {
    "title": "Mudding: Social Phenomena in Text-Based Virtual Realities",
    "abstract": "A MUD (Multi-User Dungeon or, sometimes, Multi-User Dimension) is a network-accessible, multi-participant, user-extensible virtual reality  whose user interface  is entirely textual. Participants (usually called players) have the appearance of being situated in an artificially-constructed place that also contains those other players who are connected at the same time. Players can communicate easily with each other in real time. This virtual gathering place has many of the social attributes of other places, and many of the usual social mechanisms operate there. Certain attributes of this vir- tual place, however, tend to have significant effects on social phenomena, leading to new mechanisms and modes of behavior not usually seen 'IRL' (in real life). In this paper, I relate my experiences and observations from having created and maintained a MUD for over a year.",
    "cite_count": "261",
    "location": {},
    "authors": [
      {
        "name": "Pavel Curtis",
        "msid": "1122870"
      }
    ],
    "id": "184",
    "msid": "391023"
  },
  {
    "title": "A Survey of Context-Aware Mobile Computing Research",
    "abstract": "Context-aware computing is a mobile computing paradigm in which applications can discover and take advantage of contextual information  (such as user location, time of day, nearby people and devices, and user activity). Since it was proposed about a decade ago, many researchers have studied this topic and built several context-aware applications to demonstrate the usefulness of this new technology. Context-aware applications (or the system infrastructure to support them), however, have never been widely available to everyday users. In this survey of research on context-aware systems  and applications, we looked in depth at the types of context used and models of context information, at systems that support collecting and disseminating context, and at applications that adapt to the changing context. Through this survey, it is clear that context-aware research is an old but rich area for research. The difficulties and possible solutions we outline serve as guidance for researchers hoping to make context-aware computing a reality.",
    "cite_count": "752",
    "location": {},
    "authors": [
      {
        "name": "Guanling Chen",
        "msid": "1680186"
      },
      {
        "name": "David Kotz",
        "msid": "655413"
      }
    ],
    "id": "185",
    "msid": "416815"
  },
  {
    "DOI": "10.1145/365024.365126",
    "title": "Digital family portraits: supporting peace of mind for extended family members",
    "abstract": "A growing social problem in the U.S., and elsewhere, is supporting older adults who want to continue living independently, as opposed to moving to an institutional care setting. One key part of this complex problem is providing awareness of senior adults day-to-day activities, promoting peace of mind for extended family members. In this paper, we introduce the concept of a digital family portrait that provides qualitative visualizations of a family members daily life. Leveraging a familiar household object, the picture frame, our design populates the frame with iconic imagery summarizing 28 days. In a final implementation, the digital family portrait would gather information from sensors in the home.",
    "cite_count": "205",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Elizabeth D. Mynatt",
        "msid": "155433"
      },
      {
        "name": "Jim Rowan",
        "msid": "1104388"
      },
      {
        "name": "Sarah Craighill",
        "msid": "305240"
      },
      {
        "name": "Annie Jacobs",
        "msid": "48299931"
      }
    ],
    "id": "186",
    "msid": "449086"
  },
  {
    "DOI": "10.1145/142750.142834",
    "title": "Finding usability problems through heuristic evaluation",
    "abstract": "Usability specialists were better than non-specialists at performing heuristic evaluation, and \"double experts\" with specific expertise in the kind of interface being evaluated performed even better. Major usability problems have a higher probability than minor problems of being found in a heuristic evaluation, but more minor problems are found in absolute numbers. Usability heuristics relating to exits and user errors were more difficult to apply than the rest, and additional measures should be taken to find problems relating to these heuristics. Usability problems that relate to missing interface elements that ought to be introduced were more difficult to find by heuristic evaluation  in interfaces implemented as paper prototypes but were as easy as other problems to find in running systems.",
    "cite_count": "288",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Jakob Nielsen",
        "msid": "2341557"
      }
    ],
    "id": "187",
    "msid": "449439"
  },
  {
    "DOI": "10.1145/302979.303113",
    "title": "Augmented surfaces: a spatially continuous work space for hybrid computing environments",
    "abstract": "This paper describes our design and implementation  of a computeraugmented environment that allows users to smoothly interchangedigital information among their portable computers, table and walldisplays, and other physical objects. Supported by a camera-basedobject recognition system, users can easily integrate theirportable computers with the pre-installed ones in the environment.Users can use displays projected on tables and walls as a spatiallycontinuous extension of their portable computers. Using aninteraction technique called hyperdragging, users can transferinformation from one computer to another, by only knowing thephysical relationship between them. We also provide a mechanism forattaching digital data to physical objects, such as a videotape ora document folder, to link physical and digital spaces.",
    "cite_count": "373",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Jun Rekimoto",
        "msid": "1615809"
      },
      {
        "name": "Masanori Saitoh",
        "msid": "42409428"
      }
    ],
    "id": "188",
    "msid": "449672"
  },
  {
    "DOI": "10.1145/142750.143052",
    "title": "Liveboard: a large interactive display supporting group meetings, presentations, and remote collaboration",
    "abstract": "This paper describes the Liveboard, a large interactive display  system. With nearly one million pixels and an accurate, multi-state, cordless pen, the Liveboard provides a basis for research on user interfaces for group meetings, presentations and remote collaboration. We describe the underlying hardware and software of the Liveboard, along with several software applications that have been developed. In describing the system, we point out the design rationale  that was used to make various choices. We present the results of an informal survey of Liveboard users, and describe some of the improvements that have been made in response to user feedback. We conclude with several general observations about the use of large public interactive displays. ",
    "cite_count": "247",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Scott Elrod",
        "msid": "10508384"
      },
      {
        "name": "Richard Bruce",
        "msid": "10508385"
      },
      {
        "name": "Rich Gold",
        "msid": "10491344"
      },
      {
        "name": "David Goldberg",
        "msid": "201783"
      },
      {
        "name": "Frank G. Halasz",
        "msid": "106132"
      },
      {
        "name": "William Janssen",
        "msid": "1279544"
      },
      {
        "name": "David Lee",
        "msid": "1851349"
      },
      {
        "name": "Kim Mccall",
        "msid": "3335564"
      },
      {
        "name": "Elin Rønby Pedersen",
        "msid": "1884756"
      },
      {
        "name": "Ken Pier",
        "msid": "601140"
      },
      {
        "name": "John C. Tang",
        "msid": "1537583"
      },
      {
        "name": "Brent B. Welch",
        "msid": "12513812"
      }
    ],
    "id": "189",
    "msid": "449783"
  },
  {
    "DOI": "10.1145/238386.238530",
    "title": "Email overload: exploring personal information management of email",
    "abstract": "Email is one oftl~ most successful computer applicmiom yet devised. Our empin~:al ct~ta show however, that althongh email was origiraUy designed as a c~nmunica/ons application, it is now used for ~tional funaions, that it was not designed for, such as tab management and persona/ afoOt/v/rig. We call this ernt~l oveHoad We demonstrate that email overload creates problems for personal information manageaa,cnt: users eden have cluttered inboxes cor~mining hundreds of n~:age~¢, incl~rling outstanding tasks, partially read documents and conversational threads. Furthermore,, user attemt:Xs to rationalise their inbox~ by ~ing are ~Ron unsuccessful, with the consequence that important rr~ges get overlooked, or \"lost\" in archives. We explain how em~l over/oad/ng arises and propose technical solutions to the problem.",
    "cite_count": "447",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Steve Whittaker",
        "msid": "131137"
      },
      {
        "name": "Candace L. Sidner",
        "msid": "784483"
      }
    ],
    "id": "190",
    "msid": "449922"
  },
  {
    "DOI": "10.1145/223904.223929",
    "title": "Recommending and evaluating choices in a virtual community of use",
    "cite_count": "422",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "William C. Hill",
        "msid": "9139944"
      },
      {
        "name": "Larry Stead",
        "msid": "228853"
      },
      {
        "name": "Mark Rosenstein",
        "msid": "52573730"
      },
      {
        "name": "George W. Furnas",
        "msid": "282960"
      }
    ],
    "id": "191",
    "msid": "449973"
  },
  {
    "DOI": "10.1007/3-540-48157-5_29",
    "title": "Towards a Better Understanding of Context and Context-Awareness",
    "abstract": "When humans talk with humans, they are able to use implicit situational information, or context, to increase the conversational bandwidth. Unfortunately, this ability to convey ideas does not transfer well to humans interacting with computers. In tradi-tional interactive computing, users have an impoverished mechanism for providing input to computers. By improving the computer's access to context, we increase the richness of communication in human-computer interaction and make it possible to produce more useful computational services. The use of context is increasingly im-portant in the fields of handheld and ubiquitous computing, where the user's context is changing rapidly. In this panel, we want to discuss some of the research challenges in understanding context and in developing context-aware applications. We define context as any information that can be used to characterize the situation of an entity, where an entity can be a person, place, or physical or computational object. We define context-awareness or context-aware computing as the use of con-text to provide task-relevant information and/or services to a user. Three important context-awareness behaviours are the presentation of information and services to a user, automatic execution of a service, and tagging of context to information for later retrieval. Some of the main challenges in the area of context-aware computing are: ",
    "cite_count": "944",
    "location": {
      "url": "../Conference/428/ubicomp-huc-ubiquitous-computing-handheld-and-ubiquitous-computing",
      "name": "Ubiquitous Computing/Handheld and Ubiquitous Computing - UbiComp(HUC)"
    },
    "authors": [
      {
        "name": "Gregory D. Abowd",
        "msid": "2033428"
      },
      {
        "name": "Anind K. Dey",
        "msid": "53218821"
      },
      {
        "name": "Peter J. Brown",
        "msid": "9545101"
      },
      {
        "name": "Nigel Davies",
        "msid": "5483"
      },
      {
        "name": "Mark Smith",
        "msid": "51813021"
      },
      {
        "name": "Pete Steggles",
        "msid": "1430425"
      }
    ],
    "id": "192",
    "msid": "468669"
  },
  {
    "DOI": "10.1007/3-540-45427-6_22",
    "title": "At Home with Ubiquitous Computing: Seven Challenges",
    "abstract": "The smart home  offers a new opportunity to augment people's lives with ubiquitous computing  technology that provides increased communications, awareness, and functionality. Recently, a number of trends have increased the likelihood that the aware home can soon become a reality. We examine a num- ber of challenges from the technical, social, and pragmatic domains that we feel must be overcome before the vision of the smart home, posited by ubiquitous computing  research, can become a reality. Our hope in raising these issues is to create a conversation among researchers in the varied disciplines that make up ubiquitous computing. In particular, we hope to raise awareness of the existing literature on the adoption, use, and hist ory of domestic technologies, as well as the use of situated studies, and the benef its that these can bring to bear on the design and evaluation of technologies for the home",
    "cite_count": "209",
    "location": {
      "url": "../Conference/428/ubicomp-huc-ubiquitous-computing-handheld-and-ubiquitous-computing",
      "name": "Ubiquitous Computing/Handheld and Ubiquitous Computing - UbiComp(HUC)"
    },
    "authors": [
      {
        "name": "W. Keith Edwards",
        "msid": "565394"
      },
      {
        "name": "Rebecca E. Grinter",
        "msid": "431388"
      }
    ],
    "id": "193",
    "msid": "468693"
  },
  {
    "DOI": "10.1145/604045.604069",
    "title": "Tool support for designing nomadic applications",
    "abstract": "Model-based approaches can be useful when designing nomadic applications, which can be accessed through multiple interaction platforms. Various models and levels of abstraction  can be considered in such approaches. The lack of automatic tool support  has been the main limitation to their use. We present a tool, TERESA, supporting top-down transformations from task models to abstract user interfaces and then to user interfaces for different types of interaction platforms (such as mobile phones or desktop systems). It allows designers to keep a unitary view of the design of a given nomadic application. Moreover, the tool provides support for obtaining effective interfaces for each type of platform available, taking into account the consequent differences in terms of tasks and their performance",
    "cite_count": "102",
    "location": {
      "url": "../Conference/103/iui-intelligent-user-interfaces",
      "name": "Intelligent User Interfaces - IUI"
    },
    "authors": [
      {
        "name": "Giulio Mori",
        "msid": "262813"
      },
      {
        "name": "Fabio Paternò",
        "msid": "1043063"
      },
      {
        "name": "Carmen Santoro",
        "msid": "2843030"
      }
    ],
    "id": "194",
    "msid": "473163"
  },
  {
    "DOI": "10.1145/192426.192435",
    "title": "Pad++: a zooming graphical interface for exploring alternate interface physics",
    "abstract": "We describe the current status of Pad++, a zooming graphical interface  that we are exploring as an alternative to tradhional window and icon-based approaches to interface design. We discuss the motivation for Pad++, describe the implementa- tion, and present prototype applications. In addition, we intro- duce an informational physics strategy for interface design  and briefly compare it with metaphor-based design strategies.",
    "cite_count": "395",
    "location": {
      "url": "../Conference/431/uist-user-interface-software-and-technology",
      "name": "User Interface Software and Technology - UIST"
    },
    "authors": [
      {
        "name": "Benjamin B. Bederson",
        "msid": "136606"
      },
      {
        "name": "James D. Hollan",
        "msid": "1559454"
      }
    ],
    "id": "195",
    "msid": "577521"
  },
  {
    "title": "Efficient Filtering of XML Documents for Selective Dissemination of Information",
    "abstract": "Information Dissemination  applications are gaining in- creasing popularity due to dramatic improvements in communications bandwidth and ubiquity. The sheer volume of data available necessitates the use of selec- tive approaches to dissemination in order to avoid over- whelming users with unnecessary information. Existing mechanisms for selective dissemination typically rely on simple keyword matching or \"bag of words\" infor- mation retrieval techniques. The advent of XML as a standard for information exchange  and the development of query languages for XML data enables the develop- ment of more sophisticated filtering mechanisms that take structure information into account. We have devel- oped several index organizations and search algorithms for performing efficient filtering of XML documents for large-scale information dissemination  systems. In this paper we describe these techniques and examine their performance across a range of document, workload, and scale scenarios.",
    "cite_count": "433",
    "location": {
      "url": "../Conference/458/vldb-very-large-data-bases",
      "name": "Very Large Data Bases - VLDB"
    },
    "authors": [
      {
        "name": "Mehmet Altinel",
        "msid": "692306"
      },
      {
        "name": "Michael J. Franklin",
        "msid": "1847686"
      }
    ],
    "id": "196",
    "msid": "578352"
  },
  {
    "DOI": "10.1145/860435.860451",
    "title": "Stuff I've seen: a system for personal information retrieval and re-use",
    "abstract": "Most information retrieval  technologies are designed to facilitate information discovery. However, much knowledge work  involves finding and re-using previously seen information. We describe the design and evaluation of a system, called Stuff I've Seen (SIS), that facilitates information re-use. This is accomplished in two ways. First, the system provides a unified index of information that a person has seen, whether it was seen as email, web page, document, appointment, etc. Second, because the information has been seen before, rich contextual cues can be used in the search interface. The system has been used internally by more than 230 employees. We report on both qualitative and quantitative aspects of system use. Initial findings show that time and people are important retrieval cues. Users find information more easily using SIS, and use other search tools less frequently after installation.",
    "cite_count": "343",
    "location": {
      "url": "../Conference/368/sigir-research-and-development-in-information-retrieval",
      "name": "Research and Development in Information Retrieval - SIGIR"
    },
    "authors": [
      {
        "name": "Susan T. Dumais",
        "msid": "336189"
      },
      {
        "name": "Edward Cutrell",
        "msid": "762190"
      },
      {
        "name": "Jonathan J. Cadiz",
        "msid": "1078637"
      },
      {
        "name": "Gavin Jancke",
        "msid": "1251651"
      },
      {
        "name": "Raman Sarin",
        "msid": "199991"
      },
      {
        "name": "Daniel C. Robbins",
        "msid": "1047268"
      }
    ],
    "id": "197",
    "msid": "631126"
  },
  {
    "DOI": "10.1145/258734.258747",
    "title": "Moving objects in space: exploiting proprioception in virtual-environment interaction",
    "abstract": "Manipulation in immersive virtual environments is difficult partly because users must do without the haptic contact with real objects they rely on in the real world to orient themselves and their manipulanda. To compensate for this lack, we pro- pose exploiting the one real object every user has in a virtual environment, his body. We present a unified framework for virtual-environment interaction based on proprioception, a person's sense of the position and orientation of his body and limbs. We describe three forms of body-relative interaction: • Direct manipulationways to use body sense to help con- trol manipulation • Physical mnemonicsways to store/recall information relative to the body • Gestural actionsways to use body-relative actions to is- sue commands Automatic scaling is a way to bring objects instantly within reach so that users can manipulate them using proprioceptive cues. Several novel virtual interaction techniques based upon automatic scaling and our proposed framework of propriocep- tion allow a user to interact with a virtual world intuitively, ef- ficiently, precisely, and lazily. We report the results of both informal user trials and formal user studies of the usability of the body-relative interaction techniques presented.",
    "cite_count": "294",
    "location": {
      "url": "../Conference/1563/siggraph-annual-conference-on-computer-graphics",
      "name": "Annual Conference on Computer Graphics - SIGGRAPH"
    },
    "authors": [
      {
        "name": "Mark R. Mine",
        "msid": "29836"
      },
      {
        "name": "Frederick P. Brooks Jr.",
        "msid": "11645239"
      },
      {
        "name": "Carlo H. Sequin",
        "msid": "233649"
      }
    ],
    "id": "198",
    "msid": "635223"
  },
  {
    "DOI": "10.1145/237170.237238",
    "title": "SKETCH: an interface for sketching 3D scenes",
    "abstract": "Sketching communicates ideas rapidly through approximate visual images with low overhead (pencil and paper), no need for precision or specialized knowledge, and ease of low-level correction and revision. In contrast, most 3D computer modeling systems are good at generating arbitrary views of precise 3D models and support high-level editing and revision. The SKETCH application described in this paper attempts to combine the advantages of each in order to create an environment for rapidly conceptualizing and editing approximate 3D scenes. To achieve this, SKETCH uses simple non-photorealistic rendering and a purely gestural interf ace based on simplified line drawings  of primitives that allows all ope rations to be specified within the 3D world.",
    "cite_count": "458",
    "location": {
      "url": "../Conference/1563/siggraph-annual-conference-on-computer-graphics",
      "name": "Annual Conference on Computer Graphics - SIGGRAPH"
    },
    "authors": [
      {
        "name": "Robert C. Zeleznik",
        "msid": "63698"
      },
      {
        "name": "Kenneth P. Herndon",
        "msid": "3728"
      },
      {
        "name": "John F. Hughes",
        "msid": "1519974"
      }
    ],
    "id": "199",
    "msid": "635275"
  },
  {
    "DOI": "10.1145/97879.97898",
    "title": "Rapid controlled movement through a virtual 3D workspace",
    "abstract": "Computer graphics hardware  supporting real-time interactive D animation  has the potential to support effective user interfaces by enabling virtual 3D workspaces. However, this potential requires development of viewpoint movement techniques that support rapid and controlled movement through workspaces. Rapid movement through large distances avoids wasted work time; controlled movement near target objects allows the user to examine and interact with objects in the workspace. Current techniques for viewpoint movement typically use high velocities to cover distances rapidly, but high velocities are hard to control near objects. This paper describes a new technique for targeted viewpoint movement that solves this problem. The key idea is to have the user indicate a point of interest  (target) on a 3D object and use the distance to this target to move the viewpoint logarithmically, by moving the same relative percentage of distance to the target on every animation cycle. the result is rapid motion over distances that slows as the viewpoint approaches the target object. The technique can be used with 2D and multidimensional input devices. We also extend the technique to move objects in the workspace.",
    "cite_count": "230",
    "location": {
      "url": "../Journal/468/acm-siggraph-computer-graphics",
      "name": "ACM Siggraph Computer Graphics"
    },
    "authors": [
      {
        "name": "Jock D. Mackinlay",
        "msid": "484075"
      },
      {
        "name": "Stuart K. Card",
        "msid": "1656477"
      },
      {
        "name": "George G. Robertson",
        "msid": "361485"
      }
    ],
    "id": "200",
    "msid": "635818"
  },
  {
    "DOI": "10.1007/3-540-44892-6_8",
    "title": "A Middleware for Context-Aware Agents in Ubiquitous Computing Environments",
    "abstract": "Ubiquitous Computing  advocates the construction of massively dis- tributed systems that help transform physical spaces into computationally active and intelligent environments. The design of systems and applications  in these environments needs to take account of heterogeneous devices, mobile users and rapidly changing contexts. Most importantly, agents in ubiquitous and mobile environments need to be context-aware so that they can adapt themselves to dif- ferent situations. In this paper, we argue that ubiquitous computing  environ- ments must provide middleware  support for context-awareness. We also pro- pose a middleware  that facilitates the development of context-aware agents. The middleware  allows agents to acquire contextual information  easily, reason about it using different logics and then adapt themselves to changing contexts. An- other key issue in these environments is allowing autonomous, heterogeneous agents  to have a common semantic understanding of contextual information. Our middleware  tackles this problem by using ontologies to define different types of contextual information. This middleware  is part of Gaia, our infrastruc- ture for enabling Smart Spaces.",
    "cite_count": "202",
    "location": {
      "url": "../Conference/163/middleware-odp-international-conference-on-distributed-systems-platforms-and-open-distributed",
      "name": "International Conference on Distributed Systems Platforms and Open Distributed Processing/Open Distributed Processing - Middleware(ODP)"
    },
    "authors": [
      {
        "name": "Anand Ranganathan",
        "msid": "70591"
      },
      {
        "name": "Roy H. Campbell",
        "msid": "691155"
      }
    ],
    "id": "201",
    "msid": "637803"
  },
  {
    "DOI": "10.1145/313451.313476",
    "title": "The anatomy of a context-aware application",
    "abstract": "Abstract We describe a platform for context-aware computing,which enables applications to follow mobile,users as they move around,a building. The platform is particularly suitable for richly equipped, networked environments. The only item a user is required to carry is a small sensor tag, which identifies them to the system,and locates them,accurately in three dimensions. The platform builds a dynamic,model,of the environment,using these location sensors and resource information gathered by telemetry software, and presents it in a form suitable for application programmers.,Use of the platform is illustrated through a practical example, which allows a user’s current working,desktop to follow them as they move,around the environment.",
    "cite_count": "637",
    "location": {
      "url": "../Conference/172/mobicom-mobile-computing-and-networking",
      "name": "Mobile Computing and Networking - MOBICOM"
    },
    "authors": [
      {
        "name": "Andy Harter",
        "msid": "1322476"
      },
      {
        "name": "Andy Hopper",
        "msid": "610827"
      },
      {
        "name": "Pete Steggles",
        "msid": "1430425"
      },
      {
        "name": "Andy Ward",
        "msid": "1308454"
      },
      {
        "name": "Paul Webster",
        "msid": "46282617"
      }
    ],
    "id": "202",
    "msid": "653162"
  },
  {
    "DOI": "10.1145/778415.778439",
    "title": "Localization from mere connectivity",
    "abstract": "It is often useful to know the geographic positions of nodes in a communications network, but adding GPS receivers or other sophisticated sensors to every node can be expensive. We present an algorithm that uses connectivity information who is within communications range of whom to derive the locations of the nodes in the network. The method can take advantage of additional information, such as estimated distances between neighbors or known positions for certain anchor nodes, if it is available. The algorithm is based on multidimensional scaling, a data analysis  technique that takes O(n3) time for a network of n nodes. Through simulation studies, we demonstrate that the algorithm is more robust to measurement error  than previous proposals, especially when nodes are positioned relatively uniformly throughout the plane. Furthermore, it can achieve comparable results using many fewer anchor nodes than previous methods, and even yields relative coordinates when no anchor nodes are available.",
    "cite_count": "485",
    "location": {
      "url": "../Conference/1370/mobihoc-mobile-ad-hoc-networking-and-computing",
      "name": "Mobile Ad Hoc Networking and Computing - MobiHoc"
    },
    "authors": [
      {
        "name": "Yi Shang",
        "msid": "122934"
      },
      {
        "name": "Wheeler Ruml",
        "msid": "70885"
      },
      {
        "name": "Ying Zhang",
        "msid": "56882785"
      },
      {
        "name": "Markus P. J. Fromherz",
        "msid": "5763"
      }
    ],
    "id": "203",
    "msid": "653289"
  },
  {
    "DOI": "10.1145/38807.38821",
    "title": "Concepts and experiments in computational reflection",
    "abstract": "This paper brings some perspective to various concepts in computational reflection. A definition of computational reflection  is presented, the importance of computational reflection  is discussed and the architecture of languages that support reflection is studied. Further, this paper presents a survey of some experiments in reflection which have been performed. Examples of existing procedural, logic-based and rule-based languages with an architecture for reflection are briefly presented. The main part of the paper describes an original experiment to introduce a reflective architecture in an object-oriented language. It stresses the contributions of this language to the field of object-oriented programming and illustrates the new programming style made possible. The examples show that a lot of programming problems that were previously handled on an ad hoc basis, can in a reflective architecture be solved more elegantly.",
    "cite_count": "846",
    "location": {
      "url": "../Journal/215/sigplan-sigplan-notices",
      "name": "Sigplan Notices - SIGPLAN"
    },
    "authors": [
      {
        "name": "Pattie Maes",
        "msid": "1005976"
      }
    ],
    "id": "204",
    "msid": "663521"
  },
  {
    "DOI": "10.1109/PERCOMW.2004.1276898",
    "title": "Ontology Based Context Modeling and Reasoning using OWL",
    "abstract": "In this paper we propose an OWL encoded context ontology (CONON) for modeling context in pervasive computing  environments, and for supporting logic- based context reasoning. CONON provides an upper context ontology that captures general concepts about basic context, and also provides extensibility for adding domain-specific ontology in a hierarchical manner. Based on this context ontology, we have studied the use of logic reasoning to check the consistency of context information, and to reason over low-level, explicit context to derive high-level, implicit context. By giving a performance study for our prototype, we quantitatively evaluate the feasibility of logic based context reasoning for non- time-critical applications in pervasive computing  environments, where we always have to deal carefully with the limitation of computational resources.",
    "cite_count": "303",
    "location": {
      "url": "../Conference/1470/ieee-international-conference-on-pervasive-computing-and-communications",
      "name": "IEEE International Conference on Pervasive Computing and Communications"
    },
    "authors": [
      {
        "name": "Xiaohang Wang",
        "msid": "2103877"
      },
      {
        "name": "Daqing Zhang",
        "msid": "1471144"
      },
      {
        "name": "Tao Gu",
        "msid": "2287704"
      },
      {
        "name": "Hung Keng Pung",
        "msid": "2116920"
      }
    ],
    "id": "205",
    "msid": "664255"
  },
  {
    "title": "Photobook: Tools for Content-Based Manipulation of Image Databases",
    "cite_count": "1008",
    "location": {
      "url": "../Conference/1589/storage-and-retrieval-for-image-and-video-databases",
      "name": "Storage and Retrieval for Image and Video Databases"
    },
    "authors": [
      {
        "name": "Alex Pentland",
        "msid": "343120"
      },
      {
        "name": "Rosalind W. Picard",
        "msid": "59666"
      },
      {
        "name": "Stan Sclaroff",
        "msid": "758702"
      }
    ],
    "id": "206",
    "msid": "668885"
  },
  {
    "DOI": "10.1145/347642.347794",
    "title": "Lingua Francas for Design: Sacred Places and Pattern Languages",
    "abstract": "A central challenge in interaction design  has to do with its diversity. Designers, engineers, managers, marketers, researchers and users all have important contributions to make to the design process. But at the same time they lack shared concepts, experiences and perspectives. How is the process of design which requires communication, negotiation and compromiseto effectively proceed in the absence of a common ground? I argue that an important role for the interaction designer is to help stakeholders in the design process  to construct a lingua franca. To explore this issue, which has received remarkably little attention in HCI, I turn to work in urban design  and architecture. I begin by discussing a case study  in community design, reported by Hester (10), that demonstrates the power of a lingua franca for a particular design project. I then describe the concept of pattern languages and discuss how they might be adapted to the needs of interaction design  in general, and used, in particular, as meta- languages for generating lingua francas for particular design projects.",
    "cite_count": "104",
    "location": {
      "url": "../Conference/631/dis-designing-interactive-systems",
      "name": "Designing Interactive Systems - DIS"
    },
    "authors": [
      {
        "name": "Thomas Erickson",
        "msid": "691619"
      }
    ],
    "id": "207",
    "msid": "683209"
  },
  {
    "title": "Usability Engineering",
    "cite_count": "3131",
    "location": {},
    "authors": [
      {
        "name": "Jakob Nielsen",
        "msid": "2341557"
      }
    ],
    "id": "208",
    "msid": "696277"
  },
  {
    "DOI": "10.1145/1461551.1461591",
    "title": "Sketchpad: a Man-Machine Graphical Communication System",
    "cite_count": "687",
    "location": {},
    "authors": [
      {
        "name": "Ivan E. Sutherland",
        "msid": "736382"
      }
    ],
    "id": "209",
    "msid": "696803"
  },
  {
    "title": "Eigentaste: A Constant Time Collaborative Filtering Algorithm",
    "cite_count": "337",
    "location": {
      "url": "../Journal/47/ir-information-retrieval",
      "name": "Information Retrieval - IR"
    },
    "authors": [
      {
        "name": "Kenneth Y. Goldberg",
        "msid": "12835"
      },
      {
        "name": "Theresa Roeder",
        "msid": "411581"
      },
      {
        "name": "Chris Perkins",
        "msid": "18354066"
      }
    ],
    "id": "210",
    "msid": "706184"
  },
  {
    "DOI": "10.1007/BF01210504",
    "title": "Automatic Partitioning of Full-Motion Video",
    "abstract": "Partitioning a video source into meaningful segments is an important step for video indexing. We present a comprehensive study of a partitioning system that detects segment boundaries. The system is based on a set of difference metrics and it measures the content changes between video frames. A twin-comparison approach has been developed to solve the problem of detecting transitions implemented by special effects. To eliminate the false interpretation of camera movements as transitions, a motion analysis  algorithm is applied to determine whether an actual transition has occurred. A technique for determining the threshold for a difference metric and a multi-pass approach to improve the computation speed and accuracy have also been developed.",
    "cite_count": "775",
    "location": {
      "url": "../Journal/176/mms-multimedia-systems",
      "name": "Multimedia Systems - MMS"
    },
    "authors": [
      {
        "name": "Hong-jiang Zhang",
        "msid": "951346"
      },
      {
        "name": "Atreyi Kankanhalli",
        "msid": "364438"
      },
      {
        "name": "Stephen William Smoliar",
        "msid": "755550"
      }
    ],
    "id": "211",
    "msid": "751451"
  },
  {
    "DOI": "10.1109/32.177365",
    "title": "Seesoft-A Tool For Visualizing Line Oriented Software Statistics",
    "abstract": "By means of direct manipulation  and high interaction graphics, the user can manipulate this reduced repnzsentation of the code in order to find interesting patterns. Further insight is obtained by using additional windows to display the actual code. Potential applications for Seesoft include discovery, project management, code tuning, and analysis of development methodologies.",
    "cite_count": "398",
    "location": {
      "url": "../Journal/27/tse-ieee-transactions-on-software-engineering",
      "name": "IEEE Transactions on Software Engineering - TSE"
    },
    "authors": [
      {
        "name": "Stephen G. Eick",
        "msid": "2096458"
      },
      {
        "name": "Joseph L. Steffen",
        "msid": "18679684"
      },
      {
        "name": "Eric E. Sumner Jr.",
        "msid": "470079"
      }
    ],
    "id": "212",
    "msid": "766747"
  },
  {
    "DOI": "10.1145/22899.22903",
    "title": "Intelligent information-sharing systems",
    "abstract": "The Information Lens system is a prototype intelligent information-sharing system that is designed to include not only good user interfaces for supporting the problem-solving activity of individuals, but also good organizational interfaces for supporting the problem-solving activities of groups.",
    "cite_count": "428",
    "location": {
      "url": "../Journal/209/cacm-communications-of-the-acm",
      "name": "Communications of The ACM - CACM"
    },
    "authors": [
      {
        "name": "Thomas W. Malone",
        "msid": "1351891"
      },
      {
        "name": "Kenneth R. Grant",
        "msid": "463362"
      },
      {
        "name": "Franklyn A. Turbak",
        "msid": "761242"
      },
      {
        "name": "Stephen A. Brobst",
        "msid": "3172389"
      },
      {
        "name": "Michael D. Cohen",
        "msid": "949664"
      }
    ],
    "id": "213",
    "msid": "773057"
  },
  {
    "DOI": "10.1145/245108.245122",
    "title": "PHOAKS: a system for sharing recommendations",
    "cite_count": "230",
    "location": {
      "url": "../Journal/209/cacm-communications-of-the-acm",
      "name": "Communications of The ACM - CACM"
    },
    "authors": [
      {
        "name": "Loren G. Terveen",
        "msid": "175128"
      },
      {
        "name": "William C. Hill",
        "msid": "9139944"
      },
      {
        "name": "Brian Amento",
        "msid": "571616"
      },
      {
        "name": "David W. McDonald",
        "msid": "1073667"
      },
      {
        "name": "Josh Creter",
        "msid": "1462819"
      }
    ],
    "id": "214",
    "msid": "774407"
  },
  {
    "DOI": "10.1145/245108.245126",
    "title": "GroupLens: applying collaborative filtering to Usenet news",
    "cite_count": "934",
    "location": {
      "url": "../Journal/209/cacm-communications-of-the-acm",
      "name": "Communications of The ACM - CACM"
    },
    "authors": [
      {
        "name": "Joseph A. Konstan",
        "msid": "68554"
      },
      {
        "name": "Bradley N. Miller",
        "msid": "447609"
      },
      {
        "name": "David Maltz",
        "msid": "1041117"
      },
      {
        "name": "Jonathan L. Herlocker",
        "msid": "52066"
      },
      {
        "name": "Lee R. Gordon",
        "msid": "53618374"
      },
      {
        "name": "John Riedl",
        "msid": "2172501"
      }
    ],
    "id": "215",
    "msid": "774803"
  },
  {
    "DOI": "10.1145/383845.383858",
    "title": "Getting started with ASPECTJ",
    "cite_count": "408",
    "location": {
      "url": "../Journal/209/cacm-communications-of-the-acm",
      "name": "Communications of The ACM - CACM"
    },
    "authors": [
      {
        "name": "Gregor Kiczales",
        "msid": "840008"
      },
      {
        "name": "Erik Hilsdale",
        "msid": "425265"
      },
      {
        "name": "Jim Hugunin",
        "msid": "1093864"
      },
      {
        "name": "Mik Kersten",
        "msid": "34617"
      },
      {
        "name": "Jeffrey Palm",
        "msid": "617984"
      },
      {
        "name": "William G. Griswold",
        "msid": "1765874"
      }
    ],
    "id": "216",
    "msid": "775118"
  },
  {
    "DOI": "10.1145/361598.361623",
    "title": "On the criteria to be used in decomposing systems into modules",
    "abstract": "This paper discusses modularization as a mechanism for improving the flexibility and comprehensibility of a system while allowing the shortening of its development time. The effectiveness of a \"modularization\" is dependent upon the criteria used in dividing the system into modules. A system design  problem is presented and both a conventional and unconventional decomposition are described. It is shown that the unconventional decompositions have distinct advantages for the goals outlined. The criteria used in arriving at the decompositions are discussed. The unconventional decomposition, if implemented with the conventional assumption that a module consists of one or more subroutines, will be less efficient in most cases. An alternative approach to implementation which does not have this effect is sketched.",
    "cite_count": "2311",
    "location": {
      "url": "../Journal/209/cacm-communications-of-the-acm",
      "name": "Communications of The ACM - CACM"
    },
    "authors": [
      {
        "name": "David Lorge Parnas",
        "msid": "64290"
      }
    ],
    "id": "217",
    "msid": "775595"
  },
  {
    "DOI": "10.1145/159544.159617",
    "title": "Some computer science issues in ubiquitous computing",
    "cite_count": "1111",
    "location": {
      "url": "../Journal/209/cacm-communications-of-the-acm",
      "name": "Communications of The ACM - CACM"
    },
    "authors": [
      {
        "name": "Mark Weiser",
        "msid": "1993470"
      }
    ],
    "id": "218",
    "msid": "775941"
  },
  {
    "DOI": "10.1145/7885.7887",
    "title": "Beyond the chalkboard: computer support for collaboration and problem solving in meetings",
    "abstract": "Although individual use of computers is fairly widespread, in meetings we tend to leave them behind. At Xerox PARC, an experimental meeting room called the Colab has been created to study computer support of collaborative problem solving  in face-to-face meetings. The long-term goal is to understand how to build computer tools to make meetings more effective",
    "cite_count": "662",
    "location": {
      "url": "../Journal/209/cacm-communications-of-the-acm",
      "name": "Communications of The ACM - CACM"
    },
    "authors": [
      {
        "name": "Mark J. Stefik",
        "msid": "889340"
      },
      {
        "name": "Gregg Foster",
        "msid": "669469"
      },
      {
        "name": "Daniel G. Bobrow",
        "msid": "134990"
      },
      {
        "name": "Stan Lanning",
        "msid": "924471"
      },
      {
        "name": "Lucy A. Suchman",
        "msid": "1433277"
      }
    ],
    "id": "219",
    "msid": "776584"
  },
  {
    "DOI": "10.1145/175276.175288",
    "title": "Prototyping for tiny fingers",
    "cite_count": "201",
    "location": {
      "url": "../Journal/209/cacm-communications-of-the-acm",
      "name": "Communications of The ACM - CACM"
    },
    "authors": [
      {
        "name": "Marc Rettig",
        "msid": "2127915"
      }
    ],
    "id": "220",
    "msid": "776771"
  },
  {
    "DOI": "10.1145/138859.138867",
    "title": "Using collaborative filtering to weave an information tapestry",
    "cite_count": "1198",
    "location": {
      "url": "../Journal/209/cacm-communications-of-the-acm",
      "name": "Communications of The ACM - CACM"
    },
    "authors": [
      {
        "name": "David Goldberg",
        "msid": "201783"
      },
      {
        "name": "David A. Nichols",
        "msid": "145055"
      },
      {
        "name": "Brian M. Oki",
        "msid": "349402"
      },
      {
        "name": "Douglas B. Terry",
        "msid": "867350"
      }
    ],
    "id": "221",
    "msid": "777206"
  },
  {
    "DOI": "10.1145/245108.245124",
    "title": "Fab: content-based, collaborative recommendation",
    "cite_count": "992",
    "location": {
      "url": "../Journal/209/cacm-communications-of-the-acm",
      "name": "Communications of The ACM - CACM"
    },
    "authors": [
      {
        "name": "Marko Balabanović",
        "msid": "409924"
      },
      {
        "name": "Yoav Shoham",
        "msid": "506038"
      }
    ],
    "id": "222",
    "msid": "777495"
  },
  {
    "DOI": "10.1145/242224.242420",
    "title": "Aspect-oriented programming",
    "cite_count": "771",
    "location": {
      "url": "../Journal/210/csur-acm-computing-surveys",
      "name": "ACM Computing Surveys - CSUR"
    },
    "authors": [
      {
        "name": "Gregor Kiczales",
        "msid": "840008"
      }
    ],
    "id": "223",
    "msid": "780964"
  },
  {
    "DOI": "10.1109/34.244676",
    "title": "High Confidence Visual Recognition of Persons by a Test of Statistical Independence",
    "abstract": "Abstruct- A method for rapid visual recognition of personal identity  is described, based on the failure of a statistical test  of independence. The most unique phenotypic feature visible in a person's face is the detailed texture of each eye's iris: An estimate of its statistical complexity  in a sample of the human population reveals variation corresponding to several hundred independent degrees-of-freedom. Morphogenetic randomness in the texture expressed phenotypically in the iris trabecular meshwork  ensures that a test of statistical independence  on two coded patterns originating from different eyes is passed almost certainly, whereas the same test is failed almost certainly when the compared codes originate from the same eye. The visible texture of a person's iris in a real-time video image is encoded into a compact sequence of multi-scale quadrature 2-D Gabor wavelet coefficients, whose most-significant bits comprise a 256-byte \"iris code.\" Statistical decision theory  generates identification decisions from Exclusive- OR comparisons of complete iris codes at the rate of 4000 per second, including calculation of decision confidence levels. The distributions observed empirically in such comparisons imply a theoretical \"cross-over\" error rate  of one in 131000 when a decision criterion is adopted that would equalize the false accept and false reject error rates. In the typical recognition case, given the mean observed degree of iris code agreement, the decision confidence levels correspond formally to a conditional false accept probability of one in about lo\"'.",
    "cite_count": "983",
    "location": {
      "url": "../Journal/25/pami-ieee-transactions-on-pattern-analysis-and-machine-intelligence",
      "name": "IEEE Transactions on Pattern Analysis and Machine Intelligence - PAMI"
    },
    "authors": [
      {
        "name": "John G. Daugman",
        "msid": "1410766"
      }
    ],
    "id": "224",
    "msid": "799581"
  },
  {
    "DOI": "10.1109/34.895972",
    "title": "Content-Based Image Retrieval at the End of the Early Years",
    "abstract": "Presents a review of 200 references in content-based image retrieval. The paper starts with discussing the working conditions  of content-based retrieval: patterns of use, types of pictures, the role of semantics, and the sensory gap. Subsequent sections discuss computational steps for image retrieval  systems. Step one of the review is image processing  for retrieval sorted by color, texture, and local geometry. Features for retrieval are discussed next, sorted by: accumulative and global features, salient points, object and shape features, signs, and structural combinations thereof. Similarity of pictures and objects in pictures is reviewed for each of the feature types, in close connection to the types and means of feedback the user of the systems is capable of giving by interaction. We briefly discuss aspects of system engineering: databases, system architecture, and evaluation. In the concluding section, we present our view on: the driving force  of the field, the heritage from computer vision, the influence on computer vision, the role of similarity and of interaction, the need for databases, the problem of evaluation, and the role of the semantic gap.",
    "cite_count": "2445",
    "location": {
      "url": "../Journal/25/pami-ieee-transactions-on-pattern-analysis-and-machine-intelligence",
      "name": "IEEE Transactions on Pattern Analysis and Machine Intelligence - PAMI"
    },
    "authors": [
      {
        "name": "Arnold W. M. Smeulders",
        "msid": "490335"
      },
      {
        "name": "Marcel Worring",
        "msid": "1241791"
      },
      {
        "name": "Simone Santini",
        "msid": "692184"
      },
      {
        "name": "Amarnath Gupta",
        "msid": "61168"
      },
      {
        "name": "Ramesh Jain",
        "msid": "1939777"
      }
    ],
    "id": "225",
    "msid": "800432"
  },
  {
    "DOI": "10.1145/963770.963772",
    "title": "Evaluating collaborative filtering recommender systems",
    "abstract": "Recommender systems have been evaluated in many, often incomparable, ways. In this article, we review the key decisions in evaluating collaborative filtering  recommender systems: the user tasks being evaluated, the types of analysis and datasets being used, the ways in which prediction quality is measured, the evaluation of prediction attributes other than quality, and the user-based evaluation of the system as a whole. In addition to reviewing the evaluation strategies used by prior researchers, we present empirical results from the analysis of various accuracy metrics on one content domain where all the tested metrics collapsed roughly into three equivalence classes. Metrics within each equivalency class were strongly correlated, while metrics from different equivalency classes were uncorrelated.",
    "cite_count": "965",
    "location": {
      "url": "../Journal/51/tois-acm-transactions-on-information-systems",
      "name": "ACM Transactions on Information Systems - TOIS"
    },
    "authors": [
      {
        "name": "Jonathan L. Herlocker",
        "msid": "52066"
      },
      {
        "name": "Joseph A. Konstan",
        "msid": "68554"
      },
      {
        "name": "Loren G. Terveen",
        "msid": "175128"
      },
      {
        "name": "John T. Riedl",
        "msid": "2172501"
      }
    ],
    "id": "226",
    "msid": "804401"
  },
  {
    "DOI": "10.1109/2945.981847",
    "title": "Information Visualization and Visual Data Mining",
    "abstract": "In- formation visualization and visual data mining  can help to deal with the flood of information. The advantage of visual data exploration  is that the user is directly involved in the data mining  process. There is a large number of information visualization  techniques which have been developed over the last decade to support the exploration of large data  sets. In this paper, we propose a classification of information visu- alization and visual data mining  techniques which is based on the data type  to be visualized, the visualization technique  and the interaction and distortion technique. We exemplify the clas- sification using a few examples, most of them referring to techniques and systems presented in this special issue.",
    "cite_count": "373",
    "location": {
      "url": "../Journal/29/tvcg-ieee-transactions-on-visualization-and-computer-graphics",
      "name": "IEEE Transactions on Visualization and Computer Graphics - TVCG"
    },
    "authors": [
      {
        "name": "Daniel A. Keim",
        "msid": "685131"
      }
    ],
    "id": "227",
    "msid": "807222"
  },
  {
    "DOI": "10.1147/sj.393.0915",
    "title": "Emerging frameworks for tangible user interfaces",
    "abstract": "We present steps towards a conceptual framework  for tangible user interfaces. We introduce the MCRpd interaction model  for tangible interfaces, which relates the role of physical and digital representations, physical control, and underlying digital models. This model serves as a foundation for identifying and discussing several key characteristics of tangible user interfaces. We identify a number of systems exhibiting these characteristics, and situate these within twelve application domains. Finally, we discuss tangible interfaces in the context of related research themes, both within and outside of the human-computer interaction domain.",
    "cite_count": "421",
    "location": {
      "url": "../Journal/4/ibmsj-ibm-systems-journal",
      "name": "Ibm Systems Journal - IBMSJ"
    },
    "authors": [
      {
        "name": "Brygg Ullmer",
        "msid": "572606"
      },
      {
        "name": "Hiroshi Ishii",
        "msid": "1822502"
      }
    ],
    "id": "228",
    "msid": "821649"
  },
  {
    "DOI": "10.1147/sj.384.0508",
    "title": "Classroom 2000: An Experiment with the Instrumentation of a Living Educational Environment",
    "cite_count": "363",
    "location": {
      "url": "../Journal/4/ibmsj-ibm-systems-journal",
      "name": "Ibm Systems Journal - IBMSJ"
    },
    "authors": [
      {
        "name": "Gregory D. Abowd",
        "msid": "2033428"
      }
    ],
    "id": "229",
    "msid": "822392"
  },
  {
    "DOI": "10.1207/S15327590IJHC1501_14",
    "title": "The Evaluator Effect: A Chilling Fact About Usability Evaluation Methods",
    "abstract": "Computer professionals have a need for robust, easy-to-use usability evaluation  methods (UEMs) to help them systematically improve the usability of computer artefacts. However, cognitive walkthrough, heuristic evaluation, and thinking-aloud studies - three of the most widely used UEMs - suffer from a substantial evaluator effect in that multiple evaluators evaluating the same interface with the same UEM detect markedly different sets of problems. A review of eleven studies of these three UEMs reveals that the evaluator effect exists for both novice and experienced evaluators, for both cosmetic and severe problems, for both problem detection and severity assessment, and for evaluations of both simple and complex systems. The average agreement between any two evaluators who have evaluated the same system using the same UEM ranges from 5% to 65%, and no one of the three UEMs is consistently better than the others. While evaluator effects of this magnitude may not be surprising for a UEM as informal as heuristic evaluation, it is certainly notable that a substantial evaluator effect persists for evaluators who apply the strict procedure of cognitive walkthrough  or observe users thinking out loud. Hence, it is highly questionable to use a thinking -aloud study with one evaluator as an authoritative statement about what problems an interface contains. Generally, the application of the UEMs is characterised by (1) vague goal analyses leading to variability in the task scenarios, (2) vague evaluation procedures leading to anchoring, and/or (3) vague problem criteria leading to anything being accepted as a usability problem. The simplest way of coping with the evaluator effect, which cannot be completely eliminated, is to involve multiple evaluators in usability evaluations.",
    "cite_count": "146",
    "location": {
      "url": "../Journal/74/ijhci-international-journal-of-human-computer-interaction",
      "name": "International Journal of Human-computer Interaction - IJHCI"
    },
    "authors": [
      {
        "name": "Morten Hertzum",
        "msid": "359461"
      },
      {
        "name": "Niels Ebbe Jacobsen",
        "msid": "951357"
      }
    ],
    "id": "230",
    "msid": "824027"
  },
  {
    "DOI": "10.1006/ijhc.1997.0125",
    "title": "How people revisit web pages: empirical findings and implications for the design of history systems",
    "abstract": "We report on users' revisitation patterns to World Wide Web  (web) pages, and use the results to lay an empirical foundation for the design of history mechanisms in web browsers. Through history, a user can return quickly to a previously visited page, possibly reducing the cognitive and physical overhead required to navigate to it from scratch. We analysed 6 weeks of detailed usage data collected from 23 users of a well- known web browser. We found that 58% of an individual's pages are revisits, and that users continually add new web pages  into their repertoire of visited pages. People tend to revisit pages just visited, access only a few pages frequently, browse in very small clusters of related pages and generate only short sequences of repeated URL paths. We compared di⁄erent history mechanisms, and found that the stack-based prediction method  preval- ent in commercial browsers is inferior to the simpler approach of showing the last few recently visited URLs with duplicates removed. Other predictive approaches fare even better. Based on empirical evidence, eight design guidelines for web browser history mechanisms were then formulated. When used to evaluate the existing hypertext-based history mechanisms, they explain why some aspects of today's browsers seem to work well, and other's poorly. The guidelines also indicate how history mechanisms in the web can be made even more e⁄ective.† ( 1997 Academic Press Limited",
    "cite_count": "366",
    "location": {
      "url": "../Journal/75/ijmms-international-journal-of-human-computer-studies-international-journal-of-man-machine",
      "name": "International Journal of Human-computer Studies / International Journal of Man-machine Studies - IJMMS"
    },
    "authors": [
      {
        "name": "Linda Tauscher",
        "msid": "51265510"
      },
      {
        "name": "Saul Greenberg",
        "msid": "1304573"
      }
    ],
    "id": "231",
    "msid": "824780"
  },
  {
    "DOI": "10.1109/MM.2002.1134340",
    "title": "Mica: A Wireless Platform for Deeply Embedded Networks",
    "abstract": "Low-power integration of sensing, communication, and computation requires a new approach to wireless design. Flexible interfaces and primitive accelerators enable aggressive system-level optimizations. Mica's flexible design serves as a building block  for creating efficient application-specific protocols. Instead of defining narrow, standardized application interfaces, Mica provides a set of richly interconnected primitives (such as data serializers and timing extractors) to facilitate cross-layer optimizations. To explore novel systems approaches, researchers can develop customized protocols tailored to their application; Mica does not require use of predefined protocols.",
    "cite_count": "574",
    "location": {
      "url": "../Journal/401/micro-ieee-micro",
      "name": "IEEE Micro - MICRO"
    },
    "authors": [
      {
        "name": "Jason L. Hill",
        "msid": "520394"
      },
      {
        "name": "David E. Culler",
        "msid": "2076342"
      }
    ],
    "id": "232",
    "msid": "835493"
  },
  {
    "DOI": "10.1207/s15516709cog2102_3",
    "title": "The Nature of External Representations in Problem Solving",
    "abstract": "This article proposes a theoretical framework  for external representation  based problem solving. The Tic-Tac-Toe and its isomorphs are used to illustrate the procedures of the framework as a methodology and test the predictions of the framework as a functional model. Experimental results show that the behavior in the Tic-Tac-Toe is determined by the directly available information in external and internal representations in terms of perceptual and cognitive biases, regardless of whether the biases are consistent with, incon- sistent with, or irrelevant to the task. It is shown that ex- ternal representations are not merely inputs and stimuli to the internal mind and that they have much more important functions than mere memory aids. A representational de- terminism is suggested--the form of a representation de- termines what information can be perceived, what proc- esses can be activated, and what structures can be discov- ered from the specific representation. External representations are involved in many cogni- tive tasks, such as multiplication with paper and pen- cil, grocery shopping with a written list, geometrical problem solving, graph understanding, diagrammatic reasoning, chess playing, and so on. Few would deny that external representations play certain roles in these tasks. However, in comparison with internal representations, relatively little research has been directed towards the nature of external representa- tions in cognition. This might be due to the belief that very little knowledge about the internal mind can be gained by studying external representations, or due to the view that external representations are nothing but inputs and stimuli to the internal mind, or simply due to the lack of a suitable methodology for studying external representations. This article explores the functions of external representations, using problem solving  as the task domain and test bed. It takes the position that much can be learned about the internal mind by studying external representations because much of the struc- ture of the internal mind is a reflection of the struc- ture of the external environment (e.g., Anderson, 1993; Shepard, 1984; Simon, 1981). It argues that external representations are not simply inputs and stimuli to the internal mind; rather, they are so intrin- sic to many cognitive tasks that they guide, constrain, and even determine cognitive behavior. By focusing on what information in external representations can be perceived and how the information in external representations affects problem solving  behavior, this article develops a theoretical framework  for external representation  based (henceforth, ER-based) problem solving. This framework is not only a functional model  that can make specific empirical predictions but also a methodology that can be used to systemati- cally analyze ER-based problem solving  tasks. This article is divided into five parts. The first part introduces the theoretical background, including a definition of external representations, a discussion on the relationship between internal and external rep- resentations, and a brief review of the important roles of external representations in cognition. The second part proposes the theoretical framework  for ER-based problem solving. The third part uses the framework as a methodology to analyze the structure of the Tic- Tac-Toe and as a functional model  to make specific predictions about the behavior in the Tic-Tac-Toe. The fourth part reports three experiments designed to test the predictions of the framework and examine the general properties of external representations. The last part summarizes the experimental results, evalu- ates the theoretical framework, and suggests a repre- sentational determinism.",
    "cite_count": "334",
    "location": {
      "url": "../Journal/284/cogsci-cognitive-science",
      "name": "Cognitive Science - COGSCI"
    },
    "authors": [
      {
        "name": "Jiajie Zhang",
        "msid": "785537"
      }
    ],
    "id": "233",
    "msid": "845108"
  },
  {
    "DOI": "10.1207/s15516709cog1801_3",
    "title": "Representations in Distributed Cognitive Tasks",
    "abstract": "In this paper we propose a theoretical frame- work of distributed representations and a methodology of representational analysis for the study of distributed cognitive tasksÑtasks that require the processing of information distributed across the internal mind and the external envi- ronment. The basic principle of distributed rep- resentations is that the representational system of a distributed cognitive task is a set of internal and external representations, which together represent the abstract structure of the task. The basic strategy of representational analysis is to decompose the representation of a hierarchical task into its component levels so that the repre- sentational properties at each level can be inde- pendently examined. The theoretical framework  and the methodology are used to analyze the hi- erarchical structure of the Tower of Hanoi prob- lem. Based on this analysis, four experiments are designed to examine the representational proper- ties of the Tower of Hanoi. Finally, the nature of external representations is discussed.",
    "cite_count": "447",
    "location": {
      "url": "../Journal/284/cogsci-cognitive-science",
      "name": "Cognitive Science - COGSCI"
    },
    "authors": [
      {
        "name": "Jiajie Zhang",
        "msid": "785537"
      },
      {
        "name": "Donald A. Norman",
        "msid": "1368808"
      }
    ],
    "id": "234",
    "msid": "845153"
  },
  {
    "DOI": "10.1109/2.410146",
    "title": "Query by Image and Video Content: The QBIC System",
    "abstract": "Research on ways to extend and improve query methods for image databases is widespread. We have developed the QBIC (Query by Image Content) system to explore content-based retrieval methods. QBIC allows queries on large image and video databases based on example images, user-constructed sketches and drawings, selected color and texture patterns, camera and object motion, and other graphical information. Two key properties of QBIC are (1) its use of image and video content-computable properties of color, texture, shape and motion of images, videos and their objects-in the queries, and (2) its graphical query language, in which queries are posed by drawing, selecting and other graphical means. This article describes the QBIC system and demonstrates its query capabilities. QBIC technology is part of several IBM products",
    "cite_count": "1813",
    "location": {
      "url": "../Journal/11/computer-ieee-computer",
      "name": "IEEE Computer - COMPUTER"
    },
    "authors": [
      {
        "name": "Myron Flickner",
        "msid": "1835466"
      },
      {
        "name": "Harpreet S. Sawhney",
        "msid": "810581"
      },
      {
        "name": "Jonathan J. Ashley",
        "msid": "260171"
      },
      {
        "name": "Qian Huang",
        "msid": "105795"
      },
      {
        "name": "Byron Dom",
        "msid": "1067139"
      },
      {
        "name": "Monika Gorkani",
        "msid": "1859564"
      },
      {
        "name": "Jim Hafner",
        "msid": "2468369"
      },
      {
        "name": "Denis Lee",
        "msid": "3347474"
      },
      {
        "name": "Dragutin Petkovic",
        "msid": "1942995"
      },
      {
        "name": "David J. Steele",
        "msid": "117480"
      },
      {
        "name": "Peter Yanker",
        "msid": "356033"
      }
    ],
    "id": "235",
    "msid": "846908"
  },
  {
    "DOI": "10.1109/MC.1983.1654471",
    "title": "Direct Manipulation: A step beyond programming languages",
    "cite_count": "725",
    "location": {
      "url": "../Journal/11/computer-ieee-computer",
      "name": "IEEE Computer - COMPUTER"
    },
    "authors": [
      {
        "name": "Ben Shneiderman",
        "msid": "899177"
      }
    ],
    "id": "236",
    "msid": "847553"
  },
  {
    "DOI": "10.1145/248603.248616",
    "title": "An overview of data warehousing and OLAP technology",
    "abstract": "Data warehousing  and on-line analytical processing (OLAP) are essential elements of decision support, which has increasingly become a focus of the database industry. Many commercial products and services are now available, and all of the principal database management system  vendors now have offerings in these areas. Decision support  places some rather different requirements on database technology compared to traditional on-line transaction processing  applications. This paper provides an overview of data warehousing  and OLAP technologies, with an emphasis on their new requirements. We describe back end tools for extracting, cleaning and loading data into a data warehouse; multidimensional data  models typical of OLAP; front end  client tools for querying and data analysis; server extensions for efficient query processing; and tools for metadata management  and for managing the warehouse. In addition to surveying the state of the art, this paper also identifies some promising research issues, some of which are related to problems that the database research community has worked on for years, but others are only just beginning to be addressed. This overview is based on a tutorial that the authors presented at the VLDB Conference, 1996.",
    "cite_count": "1010",
    "location": {
      "url": "../Journal/253/sigmod-record",
      "name": "Sigmod Record"
    },
    "authors": [
      {
        "name": "Surajit Chaudhuri",
        "msid": "354306"
      },
      {
        "name": "Umeshwar Dayal",
        "msid": "1261761"
      }
    ],
    "id": "237",
    "msid": "854442"
  },
  {
    "DOI": "10.1007/s00779-003-0253-8",
    "title": "What we talk about when we talk about context",
    "abstract": "The emergence of ubiquitous computing  as a new design paradigm poses significant challenges for HCI and interaction design. Traditionally, human-computer interaction has taken place within a constrained and well-understood domain of experience - single users sitting at desks and interacting with conventionally-designed computers employing screens, keyboards and mice for interaction. New opportunities have engendered considerable interest in \"context-aware computing\" - computational systems that can sense and respond to aspects of the settings in which they are used. However, considerable confusion surrounds the notion of \"context\" - what it means, what it includes, and what role it plays in interactive systems. This paper suggests that the representational stance implied by conventional interpretations of \"context\" misinterprets the role of context in everyday human activity, and proposes an alternative model that suggests different directions for design.",
    "cite_count": "369",
    "location": {
      "url": "../Journal/420/puc-personal-and-ubiquitous-computing",
      "name": "Personal and Ubiquitous Computing - PUC"
    },
    "authors": [
      {
        "name": "Paul Dourish",
        "msid": "1243408"
      }
    ],
    "id": "238",
    "msid": "872733"
  },
  {
    "DOI": "10.1145/792550.792552",
    "title": "A taxonomy of web search",
    "abstract": "Classic IR (information retrieval) is inherently predicated on users searching for information, the so-called \"information need\". But the need behind a web search  is often not informational -- it might be navigational (give me the url of the site I want to reach) or transactional (show me sites where I can perform a certain transaction, e.g. shop, download a file, or find a map). We explore this taxonomy of web searches and discuss how global search engines evolved to deal with web-specific needs.",
    "cite_count": "546",
    "location": {
      "url": "../Journal/250/sigir-forum",
      "name": "Sigir Forum"
    },
    "authors": [
      {
        "name": "Andrei Z. Broder",
        "msid": "240124"
      }
    ],
    "id": "239",
    "msid": "884746"
  },
  {
    "DOI": "10.1145/990064.990087",
    "title": "An architecture for privacy-sensitive ubiquitous computing",
    "abstract": "Privacy is the most often-cited criticism of ubiquitous computing, and may be the greatest barrier to its long-term success. However, developers currently have little support in designing software architectures and in creating interactions that are effective in helping end-users manage their privacy. To address this problem, we present Confab, a toolkit for facilitating the development of privacy-sensitive ubiquitous computing  applications. The requirements for Confab were gathered through an analysis of privacy needs for both end-users and application developers. Confab provides basic support for building ubiquitous computing  applications, providing a framework as well as several customizable privacy mechanisms. Confab also comes with extensions for managing location privacy. Combined, these features allow application developers and end-users to support a spectrum  of trust levels and privacy needs.",
    "cite_count": "244",
    "location": {
      "url": "../Conference/1372/mobisys-international-conference-on-mobile-systems-applications-and-services",
      "name": "International Conference on Mobile Systems, Applications, and Services - MobiSys"
    },
    "authors": [
      {
        "name": "Jason I. Hong",
        "msid": "1733023"
      },
      {
        "name": "James A. Landay",
        "msid": "1401225"
      }
    ],
    "id": "240",
    "msid": "893785"
  },
  {
    "DOI": "10.1145/259963.260531",
    "title": "Usability inspection methods",
    "abstract": "Usability inspection is the generic name for a set of costeffective ways of evaluating user interfaces to find usability problems. They are fairly informal methods and easy to use.",
    "cite_count": "675",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Jakob Nielsen",
        "msid": "2341557"
      }
    ],
    "id": "241",
    "msid": "895867"
  },
  {
    "DOI": "10.1145/169059.169166",
    "title": "A mathematical model of the finding of usability problems",
    "abstract": "For 11 studies, we find that the detection of usability problems as a function of number of users tested or heuristic evaluators employed is well modeled as a Poisson process. The model can be used to plan the amount of evaluation required to achieve desired levels of thoroughness or benefits. Results of early tests can provide estimates of the number of problems left to be found and the number of additional evaluations needed to find a given fraction. With quantitative evaluation  costs and detection values, the model can estimate the numbers of evaluations at which optimal cost/benefit ratios are obtained and at which marginal utility vanishes. For a \"medium\" example, we estimate that 16 evaluations would be worth their cost, with maximum benefit/cost ratio at four.",
    "cite_count": "262",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Jakob Nielsen",
        "msid": "2341557"
      },
      {
        "name": "Thomas K. Landauer",
        "msid": "16249"
      }
    ],
    "id": "242",
    "msid": "895950"
  },
  {
    "DOI": "10.1145/169059.169309",
    "title": "Tivoli: an electronic whiteboard for informal workgroup meetings",
    "abstract": "This paper describes Tivoli, an electronic whiteboard application designed to support informal workgroup meetings and targeted to run on the Xerox Liveboard, a large screen, pen-based interactive display. Tivoli strives to provide its users with the simplicity, facile use, and easily understood functionality of conventional whiteboards, while at the same time taking advantage of the computational power of the Liveboard to support and augment its users' informal meeting practices. The paper presents the motivations for the design of Tivoli and briefly describes the current version in operation. It then reflects on several issues encountered in designing Tivoli, including the need to reconsider the basic assumptions behind the standard desktop GUI, the use of strokes as the fundamental object in the system, the generalized wipe interface technique, and the use of meta-strokes as gestural commands.",
    "cite_count": "261",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Elin Rønby Pedersen",
        "msid": "1884756"
      },
      {
        "name": "Kim McCall",
        "msid": "3335564"
      },
      {
        "name": "Thomas P. Moran",
        "msid": "960985"
      },
      {
        "name": "Frank G. Halasz",
        "msid": "106132"
      }
    ],
    "id": "243",
    "msid": "895978"
  },
  {
    "DOI": "10.1145/22339.22390",
    "title": "A study in two-handed input",
    "abstract": "Two experiments were run to investigate two-handed input. The experimental tasks were representative of those found in CAD and office information systems. Experiment one involved the performance of a compound selection/positioning task. The two sub-tasks were performed by different hands using separate transducers. Without prompting, novice subjects adopted strategies that involved performing the two sub-tasks simultaneously. We interpret this as a demonstration that, in the appropriate context, users are capable of simultaneously providing continuous data from two hands without significant overhead. The results also show that the speed of performing the task was strongly correlated to the degree of parallelism employed. Experiment two involved the performance of a compound navigation/selection task. It compared a one-handed versus two-handed method for finding and selecting words in a document. The two-handed method significantly outperformed the commonly used one-handed method by a number of measures. Unlike experiment one, only two subjects adopted strategies that used both hands simultaneously. The benefits of the two-handed technique, therefore, are interpreted as being due to efficiency of hand motion. However, the two subjects who did use parallel strategies had the two fastest times of all subjects",
    "cite_count": "291",
    "location": {
      "url": "../Journal/459/acm-sigchi-bulletin",
      "name": "ACM Sigchi Bulletin"
    },
    "authors": [
      {
        "name": "William Buxton",
        "msid": "663628"
      },
      {
        "name": "Brad A. Myers",
        "msid": "134086"
      }
    ],
    "id": "244",
    "msid": "896507"
  },
  {
    "DOI": "10.1145/1008992.1009000",
    "title": "Retrieval evaluation with incomplete information",
    "abstract": "This paper examines whether the Cranfield evaluation methodology  is robust to gross violations of the completeness assumption (i.e., the assumption that all relevant documents within a test collection  have been identified and are present in the collection). We show that current evaluation measures are not robust to substantially incomplete relevance judgments. A new measure is introduced that is both highly correlated with existing measures when complete judgments are available and more robust to incomplete judgment sets. This finding suggests that substantially larger or dynamic test collections built using current pooling practices should be viable laboratory tools, despite the fact that the relevance information will be incomplete and imperfect.",
    "cite_count": "212",
    "location": {
      "url": "../Conference/368/sigir-research-and-development-in-information-retrieval",
      "name": "Research and Development in Information Retrieval - SIGIR"
    },
    "authors": [
      {
        "name": "Chris Buckley",
        "msid": "1822367"
      },
      {
        "name": "Ellen M. Voorhees",
        "msid": "27925"
      }
    ],
    "id": "245",
    "msid": "917108"
  },
  {
    "DOI": "10.1145/976270.976276",
    "title": "Advice weaving in AspectJ",
    "abstract": "This paper describes the implementation of advice weaving in AspectJ. The AspectJ language picks out dynamic join points in a program's execution with pointcuts and uses advice to change the behavior at those join points. The core task of AspectJ's advice weaver is to statically transform a program so that at runtime it will behave according to the AspeetJ language semantics. This paper describes the 1.1 implementation which is based on transforming bytecode. We describe how AspectJ's join points are mapped to regions of bytecode, how these regions are efficiently matched by AspectJ's pointcuts, and how pieces of advice are efficiently implemented at these regions. We also discuss both run-time and compile-time performance of this implementation.",
    "cite_count": "207",
    "location": {
      "url": "../Conference/298/aosd-aspect-oriented-software-development",
      "name": "Aspect-Oriented Software Development - AOSD"
    },
    "authors": [
      {
        "name": "Erik Hilsdale",
        "msid": "425265"
      },
      {
        "name": "Jim Hugunin",
        "msid": "1093864"
      }
    ],
    "id": "246",
    "msid": "917956"
  },
  {
    "DOI": "10.1109/21.156574",
    "title": "Ecological interface design: theoretical foundations",
    "abstract": "A theoretical framework  for designing interfaces for complex human-machine systems is proposed. The framework, called ecological interface design  (EID), is based on the skills, rules, and knowledge taxonomy of cognitive control. The basic goals of EID are not to force processing to a higher level than the demands of the task require, and to support each of the three levels of cognitive control. Thus, an EID interface should not contribute to the difficulty of the task, and at the same time, it should support the entire range of activities that operators will be faced with. Three prescriptive design principles are suggested to achieve this objective, each directed at supporting a particular level of cognitive control. Particular attention is paid to presenting a coherent deductive argument justifying the principles of EID. Support for the EID framework is discussed. Some issues for future research are outlined",
    "cite_count": "332",
    "location": {
      "url": "../Journal/28/tsmc-ieee-transactions-on-systems-man-and-cybernetics",
      "name": "IEEE Transactions on Systems, Man, and Cybernetics - TSMC"
    },
    "authors": [
      {
        "name": "Kim J. Vicente",
        "msid": "613554"
      },
      {
        "name": "Jens Rasmussen",
        "msid": "54327928"
      }
    ],
    "id": "247",
    "msid": "965627"
  },
  {
    "DOI": "10.1109/TSE.2004.40",
    "title": "Design and Development of Multidevice User Interfaces through Multiple Logical Descriptions",
    "abstract": "The increasing availability of new types of interaction platforms raises a number of issues for designers and developers. There is a need for new methods and tools to support development of nomadic applications, which can be accessed through a variety of devices. This paper presents a solution, based on the use of three levels of abstractions, that allows designers to focus on the relevant logical aspects and avoid dealing with a plethora of low-level details. We have defined a number of transformations able to obtain user interfaces from such abstractions, taking into account the available platforms and their interaction modalities while preserving usability. The transformations are supported by an authoring tool, TERESA, which provides designers and developers with various levels of automatic support and several possibilities for tailoring such transformations to their needs.",
    "cite_count": "134",
    "location": {
      "url": "../Journal/27/tse-ieee-transactions-on-software-engineering",
      "name": "IEEE Transactions on Software Engineering - TSE"
    },
    "authors": [
      {
        "name": "Giulio Mori",
        "msid": "262813"
      },
      {
        "name": "Fabio Paternò",
        "msid": "1043063"
      },
      {
        "name": "Carmen Santoro",
        "msid": "2843030"
      }
    ],
    "id": "248",
    "msid": "1075120"
  },
  {
    "DOI": "10.1145/1054972.1055031",
    "title": "prefuse: a toolkit for interactive information visualization",
    "abstract": "Although information visualization  (infovis) technologies have proven indispensable tools for making sense of complex data, wide-spread deployment has yet to take hold, as successful infovis applications are often difficult to author and require domain-specific customization. To address these issues, we have created prefuse, a software framework  for creating dynamic visualizations of both structured and unstructured data. prefuse provides theoretically-motivated abstractions for the design of a wide range of visualization applications, enabling programmers to string together desired components quickly to create and customize working visualizations. To evaluate prefuse we have built both existing and novel visualizations testing the toolkit's flexibility and performance, and have run usability studies and usage surveys finding that programmers find the toolkit usable and effective.",
    "cite_count": "278",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Jeffrey Heer",
        "msid": "29229494"
      },
      {
        "name": "Stuart K. Card",
        "msid": "1656477"
      },
      {
        "name": "James A. Landay",
        "msid": "1401225"
      }
    ],
    "id": "249",
    "msid": "1237034"
  },
  {
    "DOI": "10.1145/1054972.1055074",
    "title": "Designing the spectator experience",
    "abstract": "Interaction is increasingly a public affair, taking place in our theatres, galleries, museums, exhibitions and on the city streets. This raises a new design challenge for HCI - how should spectators experience a performer's interaction with a computer? We classify public interfaces (including examples from art, performance and exhibition design) according to the extent to which a performer's manipulations of an interface and their resulting effects are hidden, partially revealed, fully revealed or even amplified for spectators. Our taxonomy uncovers four broad design strategies: 'secretive,' where manipulations and effects are largely hidden; 'expressive,' where they tend to be revealed enabling the spectator to fully appreciate the performer's interaction; 'magical,' where effects are revealed but the manipulations that caused them are hidden; and finally 'suspenseful,' where manipulations are apparent but effects are only revealed as the spectator takes their turn.",
    "cite_count": "89",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Stuart Reeves",
        "msid": "1731828"
      },
      {
        "name": "Steve Benford",
        "msid": "2426561"
      },
      {
        "name": "Claire O'Malley",
        "msid": "34731"
      },
      {
        "name": "Mike Fraser",
        "msid": "380966"
      }
    ],
    "id": "250",
    "msid": "1237066"
  },
  {
    "DOI": "10.1145/1023720.1023726",
    "title": "Localization for mobile sensor networks",
    "abstract": "Many sensor network  applications require location awareness, but it is often too expensive to include a GPS receiver in a sensor network  node. Hence, localization schemes for sensor networks typically use a small number of seed nodes that know their location and protocols whereby other nodes estimate their location from the messages they receive. Several such localization techniques have been proposed, but none of them consider mobile nodes and seeds. Although mobility would appear to make localization more difficult, in this paper we introduce the sequential Monte Carlo  Localization method and argue that it can exploit mobility to improve the accuracy and precision of localization. Our approach does not require additional hardware on the nodes and works even when the movement of seeds and nodes is uncontrollable. We analyze the properties of our technique and report experimental results from simulations. Our scheme outperforms the best known static localization schemes under a wide range of conditions.",
    "cite_count": "392",
    "location": {
      "url": "../Conference/172/mobicom-mobile-computing-and-networking",
      "name": "Mobile Computing and Networking - MOBICOM"
    },
    "authors": [
      {
        "name": "Lingxuan Hu",
        "msid": "17981794"
      },
      {
        "name": "David Evans",
        "msid": "2702206"
      }
    ],
    "id": "251",
    "msid": "1240040"
  },
  {
    "DOI": "10.1145/1060745.1060754",
    "title": "Improving recommendation lists through topic diversification",
    "abstract": "In this work we present topic diversification, a novel method designed to balance and diversify personalized recommendation lists in order to reflect the user's complete spectrum  of interests. Though being detrimental to average accuracy, we show that our method improves user satisfaction  with recommendation lists, in particular for lists generated using the common item-based collaborative filtering  algorithm.Our work builds upon prior research on recommender systems, looking at properties of recommendation lists as entities in their own right rather than specifically focusing on the accuracy of individual recommendations. We introduce the intra-list similarity metric  to assess the topical diversity of recommendation lists and the topic diversification approach for decreasing the intra-list similarity. We evaluate our method using book recommendation data, including offline analysis on 361, !, 349 ratings and an online study involving more than 2, !, 100 subjects.",
    "cite_count": "193",
    "location": {
      "url": "../Conference/526/www-world-wide-web-conference-series",
      "name": "World Wide Web Conference Series - WWW"
    },
    "authors": [
      {
        "name": "Cai-Nicolas Ziegler",
        "msid": "3397962"
      },
      {
        "name": "Sean M. McNee",
        "msid": "3333084"
      },
      {
        "name": "Joseph A. Konstan",
        "msid": "68554"
      },
      {
        "name": "Georg Lausen",
        "msid": "1196154"
      }
    ],
    "id": "252",
    "msid": "1242320"
  },
  {
    "title": "Psychology of everyday things",
    "abstract": "This topic considers the design of everyday things. It begins with examples of bad design. The goal here is to have students realize that human problems and errors when dealing with technology are usually a result of design failure, and that good design accounts for human capabilities. It then introduces concepts and design principles that help us analyze bad design and create good designs. Students usually enjoy this section. They bring their own encounters of bad design into the discussion, and often propose fixes as well. ",
    "cite_count": "1589",
    "location": {},
    "authors": [
      {
        "name": "Donald A. Norman",
        "msid": "1368808"
      }
    ],
    "id": "253",
    "msid": "1250107"
  },
  {
    "title": "Situated learning: legitimate peripheral participation",
    "cite_count": "8961",
    "location": {},
    "authors": [
      {
        "name": "J. Lave",
        "msid": "23413490"
      },
      {
        "name": "E. Wenger",
        "msid": "10558298"
      }
    ],
    "id": "254",
    "msid": "1250610"
  },
  {
    "title": "Plans and situated actions - the problem of human-machine communication",
    "cite_count": "2147",
    "location": {},
    "authors": [
      {
        "name": "Lucy A. Suchman",
        "msid": "1433277"
      }
    ],
    "id": "255",
    "msid": "1255978"
  },
  {
    "title": "Connections: new ways of working in the networked organization",
    "cite_count": "934",
    "location": {},
    "authors": [
      {
        "name": "L. Sproull",
        "msid": "728164"
      },
      {
        "name": "S. Kiesler",
        "msid": "2471321"
      }
    ],
    "id": "256",
    "msid": "1256003"
  },
  {
    "DOI": "10.1023/A:1016003126882",
    "title": "A Probabilistic Approach to WLAN User Location Estimation",
    "abstract": "We estimate the location of a WLAN user based on radio signal strength  measurements performed by the user's mobile terminal. In our approach the physical properties  of the signal propagation are not taken into account directly. Instead the location estimation  is regarded as a machine learning  problem in which the task is to model how the signal strengths are distributed in different geographical areas based on a sample of measurements collected at several known locations. We present a probabilistic framework for solving the location estimation  problem. In the empirical part of the paper we demonstrate the feasibility of this approach by reporting results of field tests in which a probabilistic location estimation  method is validated in a real-world indoor environment.",
    "cite_count": "265",
    "location": {
      "url": "../Journal/739/ijwin-international-journal-of-wireless-information-networks",
      "name": "International Journal of Wireless Information Networks - IJWIN"
    },
    "authors": [
      {
        "name": "Teemu Roos",
        "msid": "363162"
      },
      {
        "name": "Petri Myllymäki",
        "msid": "1090490"
      },
      {
        "name": "Henry Tirri",
        "msid": "563742"
      },
      {
        "name": "Pauli Misikangas",
        "msid": "3383046"
      },
      {
        "name": "Juha Sievänen",
        "msid": "889237"
      }
    ],
    "id": "257",
    "msid": "1256304"
  },
  {
    "DOI": "10.1207/S15327051HCI16234_02",
    "title": "A Conceptual Framework and a Toolkit for Supporting the Rapid Prototyping of Context-Aware Applications",
    "abstract": "Abstract: Computing devices and applications are now used beyond the desktop, in diverseenvironments, and this trend toward ubiquitous computing  is accelerating. One challenge thatremains in this emerging research field is the ability to enhance the behavior of any applicationby informing it of the context of its use. By context, we refer to any information thatcharacterizes a situation related to the interaction between humans, applications and thesurrounding environment. Context-aware applications ...",
    "cite_count": "1142",
    "location": {
      "url": "../Journal/4525/human-computer-interaction",
      "name": "Human-computer Interaction"
    },
    "authors": [
      {
        "name": "Anind K. Dey",
        "msid": "53218821"
      },
      {
        "name": "Gregory D. Abowd",
        "msid": "2033428"
      },
      {
        "name": "Daniel Salber",
        "msid": "328440"
      }
    ],
    "id": "258",
    "msid": "1263332"
  },
  {
    "title": "Relevance feedback informarian retrieval",
    "cite_count": "665",
    "location": {},
    "authors": [
      {
        "name": "J. J. Rocchio",
        "msid": "935460"
      }
    ],
    "id": "259",
    "msid": "1273315"
  },
  {
    "DOI": "10.1109/INFCOM.2001.916662",
    "title": "Convex position estimation in wireless sensor networks",
    "abstract": "A method for estimating unknown node positions in a sensor network  based exclusively on connectivity-induced constraints is described. Known peer-to-peer communication in the network is modeled as a set of geometric constraints  on the node positions. The global solution  of a feasibility problem for these constraints yields estimates for the unknown positions of the nodes in the network. Providing that the constraints are tight enough, simulation illustrates that this estimate becomes close to the actual node positions. Additionally, a method for placing rectangular bounds around the possible positions for all unknown nodes in the network is given. The area of the bounding rectangles decreases as additional or tighter constraints are included in the problem. Specific models are suggested and simulated for isotropic and directional communication, representative of broadcast-based and optical transmission respectively, though the methods presented are not limited to these simple cases",
    "cite_count": "784",
    "location": {
      "url": "../Conference/69/infocom-ieee-infocom",
      "name": "IEEE INFOCOM - INFOCOM"
    },
    "authors": [
      {
        "name": "Lance Doherty",
        "msid": "95717"
      },
      {
        "name": "Kristofer S. J. Pister",
        "msid": "5080573"
      },
      {
        "name": "Laurent El Ghaoui",
        "msid": "649354"
      }
    ],
    "id": "260",
    "msid": "1282554"
  },
  {
    "DOI": "10.1109/MCOM.2002.1018018",
    "title": "Position-based routing in ad hoc networks",
    "abstract": "ABSTRACT The recent availability of small, inexpensive low - power GPS receivers and techniques for finding relative coordinates based on signal strengths, and the need for the design of power efficient and scalable networks provided justifi cation  for  applying  position - based  routing methods in ad hoc networks A number of such algorithms were developed recently This tutorial will concentrate on schemes that are loop localized, and follow a single - path strategy, which are desirable characteristics for scalable routing protocols Routing protocols have two modes: greedy mode (when the forwarding node is able to advance the message toward the desti nation) and recovery mode (applied until return to greedy mode is possible) We shall discuss them separately Methods also differ in metrics used (hop count, power, cost, congestion, etc and in past traffic memorization at nodes (mem oryless or memorizing past traffic) Salient prop erties  to  be  emphasized  in  this  review  are guaranteed delivery, scalability, and robustness",
    "cite_count": "284",
    "location": {
      "url": "../Journal/1041/ieee-commun-mag-ieee-communications-magazine",
      "name": "IEEE Communications Magazine - IEEE Commun. Mag."
    },
    "authors": [
      {
        "name": "Ivan Stojmenovic",
        "msid": "1594241"
      }
    ],
    "id": "261",
    "msid": "1288930"
  },
  {
    "title": "The Meaning and Use of the Area under a Receiver Operating Characteristic (ROC) Curve1",
    "cite_count": "1400",
    "location": {},
    "authors": [
      {
        "name": "James A. Hanley",
        "msid": "690093"
      },
      {
        "name": "Barbara J. McNeil",
        "msid": "53649382"
      }
    ],
    "id": "262",
    "msid": "1293179"
  },
  {
    "DOI": "10.1108/eb024320",
    "title": "The design of browsing and berrypicking techniques for the online search interface",
    "cite_count": "479",
    "location": {
      "url": "../Journal/16957/online-information-review",
      "name": "Online Information Review"
    },
    "authors": [
      {
        "name": "Marcia J. Bates",
        "msid": "56289229"
      }
    ],
    "id": "263",
    "msid": "1293551"
  },
  {
    "title": "Connecting the Physical World with Pervasive Networks",
    "cite_count": "523",
    "location": {
      "url": "../Journal/664/ieee-pervasive-computing",
      "name": "IEEE Pervasive Computing"
    },
    "authors": [
      {
        "name": "Deborah Estrin",
        "msid": "2402354"
      },
      {
        "name": "David Culler",
        "msid": "2076342"
      },
      {
        "name": "Kris Pister",
        "msid": "136203"
      },
      {
        "name": "Gaurav Sukhatme",
        "msid": "170453"
      }
    ],
    "id": "264",
    "msid": "1298887"
  },
  {
    "title": "In user centered system design: new perspectives on human computer interaction",
    "cite_count": "527",
    "location": {},
    "authors": [
      {
        "name": "D. A. Norman",
        "msid": "1368808"
      }
    ],
    "id": "265",
    "msid": "1300220"
  },
  {
    "DOI": "10.1109/98.626984",
    "title": "Context-aware applications: from the laboratory to the marketplace",
    "abstract": "Current hardware developments are making mobile computing increasingly attractive. An important class of mobile applications are context-aware applications: applications that change their behaviour according to the user's present context-their location, who they are with, what the time of day  is, and so on. This article is about software design  for context-aware applications. Currently most such applications have been crafted by experts in research laboratories. Our aim is to factor out a simple class of context-aware applications and make the creation of these as easy as, say, creating Web pages ",
    "cite_count": "293",
    "location": {
      "url": "../Journal/1044/ieee-pers-commun-ieee-personal-communications",
      "name": "IEEE Personal Communications - IEEE Pers. Commun."
    },
    "authors": [
      {
        "name": "P. J. Brown",
        "msid": "9545101"
      },
      {
        "name": "J. D. Bovey",
        "msid": "10534275"
      },
      {
        "name": "Xian Chen",
        "msid": "21636673"
      }
    ],
    "id": "266",
    "msid": "1300684"
  },
  {
    "title": "SpotON: An Indoor 3D Location Sensing Technology Based on RF Signal Strength",
    "abstract": "Providing a reliable technology and architecture for determining the location of real world objects and people will undoubtedly enable applications, customization, and inference not currently possible. This paper documents the creation of SpotON, a new tagging technology for three dimensional  location sensing based on radio signal strength  analysis. Although there are many aspects to the topic of location sensing and several of them will be briefly discussed, this paper is primarily concerned with the hardware and embedded system  development of such a system.",
    "cite_count": "278",
    "location": {},
    "authors": [
      {
        "name": "Jeffrey Hightower",
        "msid": "297093"
      },
      {
        "name": "Gaetano Borriello",
        "msid": "70984"
      }
    ],
    "id": "267",
    "msid": "1306732"
  },
  {
    "DOI": "10.1109/TSMC.1976.5408777",
    "title": "A Comparative Study of Texture Measures for Terrain Classification",
    "abstract": "Three standard approaches to automatic texture classification  make use of features based on the Fourier power spectrum, on second-order gray level statistics, and on first-order statistics of gray level differences, respectively. Feature sets of these types, all designed analogously, were used to classify two sets of terrain samples. It was found that the Fourier features generally performed more poorly, while the other feature sets all performned comparably.",
    "cite_count": "522",
    "location": {
      "url": "../Journal/28/tsmc-ieee-transactions-on-systems-man-and-cybernetics",
      "name": "IEEE Transactions on Systems, Man, and Cybernetics - TSMC"
    },
    "authors": [
      {
        "name": "Joan S. Weszka",
        "msid": "10566164"
      },
      {
        "name": "Charles R. Dyer",
        "msid": "56463422"
      },
      {
        "name": "Azriel Rosenfeld",
        "msid": "10539644"
      }
    ],
    "id": "268",
    "msid": "1308012"
  },
  {
    "DOI": "10.1016/0169-7552(95)00043-7",
    "title": "Characterizing Browsing Strategies in the World-Wide Web",
    "abstract": "This paper presents the results of a study conducted at Georgia Institute of Technology that captured client-side user events of NCSA's XMosaic. Actual user behavior, as determined from client-side log file analysis, supplemented our understanding of user navigation strategies as well as provided real interface usage data. Log file analysis  also yielded design and usability suggestions for WWW pages, sites and browsers. The methodology of the study and findings are discussed along with future research directions.",
    "cite_count": "516",
    "location": {
      "url": "../Journal/182/cn-computer-networks-and-isdn-systems",
      "name": "Computer Networks and Isdn Systems - CN"
    },
    "authors": [
      {
        "name": "Lara D. Catledge",
        "msid": "314910"
      },
      {
        "name": "James E. Pitkow",
        "msid": "570684"
      }
    ],
    "id": "269",
    "msid": "1323523"
  },
  {
    "title": "Towards a Better Understanding of Context and Context-Awareness",
    "abstract": "The use of context is important in interactive applications. It is par- ticularly important for applications where the user's context is changing rap- idly, such as in both handheld and ubiquitous computing. In order to better un- derstand how we can use context and facilitate the building of context-aware applications, we need to more fully understand what constitutes a context- aware application and what context is. Towards this goal, we have surveyed existing work in context-aware computing. In this paper, we provide an over- view of the results of this survey and, in particular, definitions and categories of context and context-aware. We conclude with recommendations for how this better understanding of context inform a framework for the development of context-aware applications.",
    "cite_count": "557",
    "location": {},
    "authors": [
      {
        "name": "Anind K. Dey",
        "msid": "53218821"
      },
      {
        "name": "Gregory D. Abowd",
        "msid": "2033428"
      }
    ],
    "id": "270",
    "msid": "1338289"
  },
  {
    "title": "The psychology of everyday things",
    "cite_count": "908",
    "location": {},
    "authors": [
      {
        "name": "Donald Norman",
        "msid": "1368808"
      }
    ],
    "id": "271",
    "msid": "1412703"
  },
  {
    "DOI": "10.1109/JPROC.2003.814918",
    "title": "Sensor networks: evolution, opportunities, and challenges",
    "abstract": "Wireless microsensor networks have been identified as one of the most important technologies for the 21st century. This paper traces the history of research in sensor networks over the past three decades, including two important programs of the Defense Advanced Research Projects Agency  (DARPA) spanning this period: the Distributed Sensor Networks (DSN) and the Sensor Information Technology  (SensIT) programs. Technology trends that impact the development of sensor networks are reviewed, and new applications such as infrastructure security, habitat monitoring, and traffic control  are presented. Technical challenges in sensor network  development include network discovery, control and routing, collaborative signal and information processing, tasking and querying, and security. The paper concludes by presenting some recent research results in sensor network  algorithms, including localized algorithms and directed diffusion, distributed tracking in wireless ad hoc networks, and distributed classification using local agents.",
    "cite_count": "923",
    "location": {
      "url": "../Journal/416/pieee-proceedings-of-the-ieee",
      "name": "Proceedings of The IEEE - PIEEE"
    },
    "authors": [
      {
        "name": "Chee-Yee Chong",
        "msid": "2081669"
      },
      {
        "name": "SRIKANTA P. KUMAR",
        "msid": "10503784"
      }
    ],
    "id": "272",
    "msid": "1429752"
  },
  {
    "DOI": "10.1109/MPRV.2002.1037720",
    "title": "Reconfigurable context-sensitive middleware for pervasive computing",
    "abstract": "Context-sensitive applications need data from sensors, devices, and user actions, and might need ad hoc communication support to dynamically discover new devices and engage in spontaneous information exchange. Reconfigurable Context-Sensitive Middleware  facilitates the development and runtime operations of context-sensitive pervasive computing  software.",
    "cite_count": "260",
    "location": {
      "url": "../Journal/664/ieee-pervasive-computing",
      "name": "IEEE Pervasive Computing"
    },
    "authors": [
      {
        "name": "S. S. Yau",
        "msid": "3357362"
      },
      {
        "name": "F. Karim",
        "msid": "2809428"
      },
      {
        "name": "Yu Wang",
        "msid": "3374135"
      },
      {
        "name": "Bin Wang",
        "msid": "47527854"
      },
      {
        "name": "S. K. S. Gupta",
        "msid": "3117210"
      }
    ],
    "id": "273",
    "msid": "1431140"
  },
  {
    "DOI": "10.1109/MPRV.2003.1228524",
    "title": "Bayesian filtering for location estimation",
    "abstract": "Bayesian-filter techniques provide a powerful statistical tool to help manage measurement uncertainty  and perform multisensor fusion and identity estimation. The authors survey Bayes filter implementations and show their application to real-world location-estimation tasks common in pervasive computing.",
    "cite_count": "240",
    "location": {
      "url": "../Journal/664/ieee-pervasive-computing",
      "name": "IEEE Pervasive Computing"
    },
    "authors": [
      {
        "name": "Dieter Fox",
        "msid": "764982"
      },
      {
        "name": "Jeffrey Hightower",
        "msid": "297093"
      },
      {
        "name": "Lin Liao",
        "msid": "802774"
      },
      {
        "name": "Dirk Schulz",
        "msid": "53479434"
      },
      {
        "name": "Gaetano Borriello",
        "msid": "70984"
      }
    ],
    "id": "274",
    "msid": "1431169"
  },
  {
    "DOI": "10.1109/98.626982",
    "title": "A new location technique for the active office",
    "abstract": "Configuration of the computing and communications systems found at home and in the workplace is a complex task that currently requires the attention of the user. Researchers have begun to examine computers that would autonomously change their functionality based on observations of who or what was around them. By determining their context, using input from sensor systems distributed throughout the environment, computing devices could personalize themselves to their current user, adapt their behaviour according to their location, or react to their surroundings. The authors present a novel sensor system, suitable for large-scale deployment in indoor environments, which allows the locations of people and equipment to be accurately determined. We also describe some of the context-aware applications that might make use of this fine-grained location information",
    "cite_count": "706",
    "location": {
      "url": "../Journal/1044/ieee-pers-commun-ieee-personal-communications",
      "name": "IEEE Personal Communications - IEEE Pers. Commun."
    },
    "authors": [
      {
        "name": "Andy Ward",
        "msid": "1308454"
      },
      {
        "name": "Alan Jones",
        "msid": "47180631"
      },
      {
        "name": "Andy Hopper",
        "msid": "610827"
      }
    ],
    "id": "275",
    "msid": "1646329"
  },
  {
    "DOI": "10.1109/TKDE.2005.99",
    "title": "Toward the Next Generation of Recommender Systems: A Survey of the State-of-the-Art and Possible Extensions",
    "abstract": "This paper presents an overview of the field of recommender systems and describes the current generation of recommendation methods that are usually classified into the following three main categories: content-based, collaborative, and hybrid recommendation approaches. This paper also describes various limitations of current recommendation methods and discusses possible extensions that can improve recommendation capabilities and make recommender systems applicable to an even broader range of applications. These extensions include, among others, an improvement of understanding of users and items, incorporation of the contextual information  into the recommendation process, support for multcriteria ratings, and a provision of more flexible and less intrusive types of recommendations. Index TermsRecommender systems, collaborative filtering, rating estimation methods, extensions to recommender systems.",
    "cite_count": "1024",
    "location": {
      "url": "../Journal/22/tkde-ieee-transactions-on-knowledge-and-data-engineering",
      "name": "IEEE Transactions on Knowledge and Data Engineering - TKDE"
    },
    "authors": [
      {
        "name": "Gediminas Adomavicius",
        "msid": "1108192"
      },
      {
        "name": "Alexander Tuzhilin",
        "msid": "326715"
      }
    ],
    "id": "276",
    "msid": "1653128"
  },
  {
    "DOI": "10.1109/92.486080",
    "title": "Predictive System Shutdown and Other Architectural Techniques forEnergy Effcient Programmable Computation",
    "abstract": "With the popularity of portable devices such as personal digital assistants and personal communicators, as well as with increasing awareness of the economic and environmental costs of power consumption  by desktop computers, energy efficiency has emerged as an important issue in the design of electronic systems. While power efficient ASIC's with dedicated architectures have addressed the energy efficiency issue for niche applications such as DSP, much of the computation continues to be implemented as software running on programmable processors such as microprocessors, microcontrollers, and programmable DSP's. Not only is this true for general purpose computation on personal computers and workstations, but also for portable devices, application-specific systems etc. In fact, firmware and embedded software  executing on RISC and DSP processor cores that are embedded in ASIC's has emerged as a leading implementation methodology for speech coding, modem functionality, video compression, communication protocol  processing etc. This paper describes architectural techniques for energy efficient  implementation of programmable computation, particularly focussing on the computation needed in portable devices where event-driven user interfaces, communication protocols, and signal processing  play a dominant role. Two key approaches described here are predictive system shutdown and extended voltage scaling. Results indicate that a large reduction in power consumption  can be achieved over current day solutions with little or no loss in system performance.",
    "cite_count": "265",
    "location": {
      "url": "../Journal/694/vlsi-ieee-transactions-on-very-large-scale-integration-systems",
      "name": "IEEE Transactions on Very Large Scale Integration Systems - VLSI"
    },
    "authors": [
      {
        "name": "Mani B. Srivastava",
        "msid": "937074"
      },
      {
        "name": "Anantha P. Chandrakasan",
        "msid": "1431796"
      },
      {
        "name": "Robert W. Brodersen",
        "msid": "282538"
      }
    ],
    "id": "277",
    "msid": "1685091"
  },
  {
    "DOI": "10.1016/S0953-5438(03)00010-9",
    "title": "A unifying reference framework for multi-target user interfaces",
    "cite_count": "258",
    "location": {
      "url": "../Journal/61/iwc-interacting-with-computers",
      "name": "Interacting with Computers - IWC"
    },
    "authors": [
      {
        "name": "Gaelle Calvary",
        "msid": "3318956"
      },
      {
        "name": "Joelle Coutaz",
        "msid": "2410387"
      },
      {
        "name": "David Thevenin",
        "msid": "2495945"
      },
      {
        "name": "QuentinLimbourg",
        "msid": "52516101"
      },
      {
        "name": "Laurent Bouillon",
        "msid": "220049"
      },
      {
        "name": "Jean Vanderdonckt",
        "msid": "495619"
      }
    ],
    "id": "278",
    "msid": "1702462"
  },
  {
    "title": "Maca---a new channel access method for packet radio",
    "abstract": "n The existing Carrier Sense Multiple Access  (CSMA) method widely used i mateur packet radio  on shared simplex packet radio  channels frequently suffers from ",
    "cite_count": "494",
    "location": {},
    "authors": [
      {
        "name": "P. Karn",
        "msid": "1706241"
      }
    ],
    "id": "279",
    "msid": "1954195"
  },
  {
    "DOI": "10.1207/s15327809jls0203_1",
    "title": "Learning by Collaborating: Convergent Conceptual Change",
    "cite_count": "374",
    "location": {
      "url": "../Journal/10903/j-learn-sci-journal-of-the-learning-sciences",
      "name": "Journal of The Learning Sciences - J LEARN SCI"
    },
    "authors": [
      {
        "name": "Jeremy Roschelle",
        "msid": "149769"
      }
    ],
    "id": "280",
    "msid": "1970190"
  },
  {
    "DOI": "10.1109/TPAMI.1980.4767008",
    "title": "A Theoretical Comparison of Texture Algorithms",
    "abstract": "An evaluation of the ability of four texture analysis  algorithms to perform automatic texture discrimination will be described. The algorithms which will be examined are the spatial gray level dependence method (SGLDM), the gray level run length method (GLRLM), the gray level difference method (GLDM), and the power spectral method  (PSM). The evaluation procedure employed does not depend on the set of features used with each algorithm or the pattern recognition  scheme. Rather, what is examined is the amount of texturecontext information contained in the spatial gray level dependence matrices, the gray level run length matrices, the gray level difference density functions, and the power spectrum. The comparison will be performed in two steps. First, only Markov generated textures will be considered. The Markov textures employed are similar to the ones used by perceptual psychologist B. Julesz in his investigations of human texture perception. These Markov textures provide a convenient mechanism for generating certain example texture pairs which are important in the analysis process. In the second part of the analysis the results obtained by considering only Markov textures will be extended to all textures which can be represented by translation stationary random fields of order two. This generalization clearly includes a much broader class of textures than Markovian ones. The results obtained indicate that the SGLDM is the most powerful algorithm of the four considered, and that the GLDM is more powerful than the PSM.",
    "cite_count": "359",
    "location": {
      "url": "../Journal/25/pami-ieee-transactions-on-pattern-analysis-and-machine-intelligence",
      "name": "IEEE Transactions on Pattern Analysis and Machine Intelligence - PAMI"
    },
    "authors": [
      {
        "name": "Richard W. Conners",
        "msid": "884284"
      },
      {
        "name": "Charles A. Harlow",
        "msid": "76633"
      }
    ],
    "id": "281",
    "msid": "1985854"
  },
  {
    "DOI": "10.1029/90EO00319",
    "title": "Free software helps map and display data",
    "abstract": "When creating camera-ready figures, most scientists are familiar with the sequence of raw data --> processing --> final illustration and with the spending of large sums of money to finalize papers for submission to scientific journals, prepare proposals, and create overheads and slides for various presentations. This process can be tedious and is often done manually, since available commercial or in-house software usually can do only part of the job.To expedite this process, we introduce the Generic Mapping Tools  (GMT), which is a free, public domain software package  that can be used to manipulate columns of tabular data, time series, and gridded data sets and to display these data in a variety of forms ranging from simple x-y plots to maps and color, perspective, and shaded-relief illustrations. GMT uses the PostScript page description language, which can create arbitrarily complex images in gray tones or 24-bit true color by superimposing multiple plot files. Line drawings, bitmapped images, and text can be easily combined in one illustration. PostScript plot files are device-independent, meaning the same file can be printed at 300 dots per inch (dpi) on an ordinary laserwriter or at 2470 dpi on a phototypesetter when ultimate quality is needed. GMT software is written as a set of UNIX tools and is totally self contained and fully documented. The system is offered free of charge to federal agencies and nonprofit educational organizations worldwide and is distributed over the computer network  Internet.",
    "cite_count": "21769",
    "location": {
      "url": "../Journal/15257/eos-transactions-american-geophysical-union",
      "name": "Eos, Transactions American Geophysical Union"
    },
    "authors": [
      {
        "name": "Paul Wessel",
        "msid": "34391466"
      },
      {
        "name": "Walter H. F. Smith",
        "msid": "34132501"
      }
    ],
    "id": "282",
    "msid": "1999899"
  },
  {
    "DOI": "10.1109/INFCOM.2004.1354683",
    "title": "Improved MDS-Based Localization",
    "abstract": "It is often useful to know the geographic po- sitions of nodes in a communications network, but adding GPS receivers or other sophisticated sensors to every node can be expensive. MDS-MAP is a recent localization method based on multidimentional scaling (MDS). It uses connec- tivity informationwho is within communications range of whomto derive the locations of the nodes in the network, and can take advantage of additional data, such as esti- mated distances between neighbors or known positions for certain anchor nodes, if they are available. However, MDS- MAP is an inherently centralized algorithm and is there- fore of limited utility in many applications. In this paper, we present a new variant of the MDS-MAP method, which we call patched MDS-MAP, that can easily be executed in a distributed fashion. Using extensive simulations, we show that the new algorithm not only preserves the good perfor- mance of original method on relatively uniform layouts, but also performs much better than the original on irregularly- shaped networks. The main idea is to build a local map at each node of the immediate vicinity and then merge these maps together to form a global map. This approach works much better for topologies in which the shortest path  dis- tance between two nodes does not correspond well to their Euclidean distance. We also discuss an optional refinement step that improves solution quality even further at the ex- pense of additional computation.",
    "cite_count": "253",
    "location": {
      "url": "../Conference/69/infocom-ieee-infocom",
      "name": "IEEE INFOCOM - INFOCOM"
    },
    "authors": [
      {
        "name": "Yi Shang",
        "msid": "122934"
      },
      {
        "name": "Wheeler Ruml",
        "msid": "70885"
      }
    ],
    "id": "283",
    "msid": "2029951"
  },
  {
    "DOI": "10.1037//0033-295X.97.2.253",
    "title": "Dimensional overlap: Cognitive basis for stimulus-response compatibility--A model and taxonomy",
    "abstract": "In this article, we address the classic problem of stimulus- response (S-R) compatibility (SRC). A model is proposed that attempts to provide a systematic account of performance in highly compatible, incompatible, and noncompatible tasks. At the core of our model is the idea that when a particular S-R ensemble produces either high or low compatibility effects, it is because the stimulus and response sets in the ensemble have properties in common, and elements in the stimulus set auto- matically activate corresponding elements in the response set. Noncompatible tasks are those in which the stimulus and re- sponse sets have nothing in common. If the activated response is the required one, it will be executed rapidly and correctly; if it is not, then it will be relatively slow and error prone. Whether a particular S-R ensemble will produce compatibility effects is often quite easy to determine because of the relationship be- tween the stimulus and response sets. In the part of the model that treats the representational aspects of the problem, we pos- tulate that this relationship is based on the commonality, simi- larity, or correspondence of the sets in the ensemble. We call this the dimensional overlap of the ensemble. The automatic response activation mechanisms, as well as the response identi- fication processes underlying SRC effects, are the processing as- pect of the model. Even though the model is still in its qualita- tive development phase, it is able to make ordinal predictions concerning several different SRC effects, such as the effects of mapping, irrelevant dimensions, and number of alternatives. These effects had been viewed as unrelated empirical phenom- ena, and most of the work on SRC has dealt with them as mani- festations of unique, nongeneralizable properties of particular dimensions or specific tasks. This approach has led to different accounts being proposed for \"spatial,\" \"symbolic,\" \"sensori- motor;' and \"semantic\" tasks. Our model attempts to break with such past approaches in a fundamental way by proposing to account for most major SRC effects in terms of common basic cognitive mechanisms. This unitary approach leads to a taxonomy of SRC tasks that reveals striking similarities be- tween them and suggestive parallels with the experimental para- digms that have traditionally been used to investigate atten- tional, controlled, and automatic processes.",
    "cite_count": "602",
    "location": {
      "url": "../Journal/9936/psychol-rev-psychological-review",
      "name": "Psychological Review - PSYCHOL REV"
    },
    "authors": [
      {
        "name": "Sylvan Kornblum",
        "msid": "17964767"
      },
      {
        "name": "Thierry Hasbroucq",
        "msid": "586287"
      },
      {
        "name": "Allen Osman",
        "msid": "8915580"
      }
    ],
    "id": "284",
    "msid": "2032116"
  },
  {
    "title": "Distributed localization in wireless sensor networks: a quantitative comparison",
    "abstract": "This paper studies the problem of determining the node locations in ad-hoc sensor networks. We compare three distributed localization algorithms (Ad-hoc positioning, Robust positioning, and N -hop multilateration) on a single simulation platform. The algorithms share a common, three-phase structure: (1) determine node-anchor distances, (2) compute node positions, and (3) optionally refine the positions through an iterative procedure. We present a detailed analysis comparing the various alternatives for each phase, as well as a head-to-head comparison of the complete al- gorithms. The main conclusion is that no single algorithm performs best; which algorithm is to be preferred depends on the conditions (range errors, connectivity, anchor fraction, etc.). In each case, however, there is significant room for improving accuracy and/or increasing coverage. � 2003 Elsevier B.V. All rights reserved.",
    "cite_count": "434",
    "location": {
      "url": "../Conference/2464/iscn-international-symposium-on-computer-networks",
      "name": "International Symposium on Computer Networks - ISCN"
    },
    "authors": [
      {
        "name": "Koen Langendoen",
        "msid": "93058"
      },
      {
        "name": "Niels Reijers",
        "msid": "155844"
      }
    ],
    "id": "285",
    "msid": "2078233"
  },
  {
    "title": "The Magical Number Seven, Plus or Minus Two Some Limits on Our Capacity for Processing Information",
    "cite_count": "1923",
    "location": {},
    "authors": [
      {
        "name": "George A. Miller",
        "msid": "44624019"
      }
    ],
    "id": "286",
    "msid": "2099673"
  },
  {
    "title": "COMPUTING AND APPLYING TRUST IN WEB-BASED SOCIAL NETWORKS",
    "cite_count": "172",
    "location": {},
    "authors": [
      {
        "name": "Jennifer Ann Golbeck",
        "msid": "319088"
      }
    ],
    "id": "287",
    "msid": "2141775"
  },
  {
    "DOI": "10.1016/j.ijmedinf.2003.11.024",
    "title": "A review of content-based image retrieval systems in medical applications - clinical benefits and future directions",
    "abstract": "Abstract: Content--based visual information retrieval  (CBVIR)or Content--Based Image Retrieval  (CBIR)has been one on the most vivid research areas in thefield of computer vision  over the last 10 years. Theavailability of large and steadily growing amounts ofvisual and multimedia data, and the development ofthe Internet underline the need to create thematicaccess methods that o#er more than simple text--based queries or requests based on matching exactdatabase fields. Many programs and tools...",
    "cite_count": "312",
    "location": {
      "url": "../Journal/1002/international-journal-of-medical-informatics",
      "name": "International Journal of Medical Informatics"
    },
    "authors": [
      {
        "name": "Henning Müller",
        "msid": "52239013"
      },
      {
        "name": "Nicolas Michoux",
        "msid": "23393065"
      },
      {
        "name": "David Bandon",
        "msid": "23393066"
      },
      {
        "name": "Antoine Geissbühler",
        "msid": "3351247"
      }
    ],
    "id": "288",
    "msid": "2341266"
  },
  {
    "DOI": "10.1145/302979.303126",
    "title": "The context toolkit: aiding the development of context-enabled applications",
    "abstract": "Context-enabled applications are just emerging and promisericher interaction by taking environmental context into account.However, they are difficult to build due to their distributednature and the use of unconventional sensors. The concepts oftoolkits and widget libraries in graphical user interfaces has beentremendously successtil, allowing programmers to leverage offexisting building blocks to build interactive systems more easily.We introduce the concept of context widgets that mediate betweenthe environment and the application in the same way graphicalwidgets mediate between the user and the application. We illustratethe concept of context widgets with the beginnings of a widgetlibrary we have developed for sensing presence, identity andactivity of people and things. We assess the success of ourapproach with two example context-enabled applications we havebuilt and an existing application to which we have addedcontext-sensing capabilities.",
    "cite_count": "537",
    "location": {
      "url": "../Conference/789/chi-computer-human-interaction",
      "name": "Computer Human Interaction - CHI"
    },
    "authors": [
      {
        "name": "Daniel Salber",
        "msid": "328440"
      },
      {
        "name": "Anind K. Dey",
        "msid": "53218821"
      },
      {
        "name": "Gregory D. Abowd",
        "msid": "2033428"
      }
    ],
    "id": "289",
    "msid": "2382849"
  },
  {
    "DOI": "10.1145/1101826.1101866",
    "title": "Content-based image retrieval: approaches and trends of the new age",
    "abstract": "The last decade has witnessed great interest in research on content-based image retrieval. This has paved the way for a large number of new techniques and systems, and a growing interest in associated fields to support such systems. Likewise, digital imagery has expanded its horizon in many directions, resulting in an explosion in the volume of image data required to be organized. In this paper, we discuss some of the key contributions in the current decade related to image retrieval  and automated image annotation, spanning 120 references. We also discuss some of the key challenges involved in the adaptation of existing image retrieval  techniques to build useful systems that can handle real-world data. We conclude with a study on the trends in volume and impact of publications in the field with respect to venues/journals and sub-topics.",
    "cite_count": "127",
    "location": {
      "url": "../Conference/167/mm-acm-multimedia-conference",
      "name": "ACM Multimedia Conference - MM"
    },
    "authors": [
      {
        "name": "Ritendra Datta",
        "msid": "1283316"
      },
      {
        "name": "Jia Li",
        "msid": "449523"
      },
      {
        "name": "James Ze Wang",
        "msid": "47547846"
      }
    ],
    "id": "290",
    "msid": "2463474"
  },
  {
    "DOI": "10.1145/1348246.1348248",
    "title": "Image retrieval: Ideas, influences, and trends of the new age",
    "abstract": "We have witnessed great interest and a wealth of promise in content-based image retrieval  as an emerging technology. While the last decade laid foundation to such promise, it also paved the way for a large number of new techniques and systems, got many new people involved, and triggered stronger association of weakly related elds. In this paper, we survey almost 300 key theoret- ical and empirical contributions in the current decade related to image retrieval  and automatic image annotation, and discuss the spawning of related sub-elds in the process. We also discuss signican t challenges involved in the adaptation of existing image retrieval  techniques to build systems that can be useful in the real-world. In retrospect of what has been achieved so far, we also conjecture what the future may hold for image retrieval  research.",
    "cite_count": "540",
    "location": {
      "url": "../Journal/210/csur-acm-computing-surveys",
      "name": "ACM Computing Surveys - CSUR"
    },
    "authors": [
      {
        "name": "Ritendra Datta",
        "msid": "1283316"
      },
      {
        "name": "Dhiraj Joshi",
        "msid": "211931"
      },
      {
        "name": "Jia Li",
        "msid": "449523"
      },
      {
        "name": "James Ze Wang",
        "msid": "47547846"
      }
    ],
    "id": "291",
    "msid": "3213339"
  },
  {
    "DOI": "10.1145/1242572.1242603",
    "title": "Expertise networks in online communities: structure and algorithms",
    "abstract": "Web-based communities have become important places for people to seek and share expertise. We find that networks in these communities typically differ in their topology from other online networks such as the World Wide Web. Systems targeted to augment web-based communities by automatically identifying users with expertise, for example, need to adapt to the underlying interaction dynamics. In this study, we analyze the Java Forum, a large online help-seeking community, using social network analysis  methods. We test a set of network-based ranking algorithms, including PageRank and HITS, on this large size social network  in order to identify users with high expertise. We then use simulations to identify a small number of simple simulation rules governing the question-answer dynamic in the network. These simple rules not only replicate the structural characteristics and algorithm performance on the empirically observed Java Forum, but also allow us to evaluate how other algorithms may perform in communities with different characteristics. We believe this approach will be fruitful for practical algorithm design  and implementation for online expertise-sharing communities.",
    "cite_count": "132",
    "location": {
      "url": "../Conference/526/www-world-wide-web-conference-series",
      "name": "World Wide Web Conference Series - WWW"
    },
    "authors": [
      {
        "name": "Jun Zhang",
        "msid": "12215675"
      },
      {
        "name": "Mark S. Ackerman",
        "msid": "365133"
      },
      {
        "name": "Lada A. Adamic",
        "msid": "1358089"
      }
    ],
    "id": "292",
    "msid": "4117448"
  },
  {
    "DOI": "10.1109/TKDE.2007.46",
    "title": "Random-Walk Computation of Similarities between Nodes of a Graph with Application to Collaborative Recommendation",
    "abstract": "This work presents a new perspective on characterizing the similarity between elements of a database or, more generally, nodes of a weighted and undirected graph. It is based on a Markov-chain model of random walk  through the database. More precisely, we compute quantities (the average commute time, the pseudoinverse of the Laplacian matrix  of the graph, etc.) that provide similarities between any pair of nodes, having the nice property of increasing when the number of paths connecting those elements increases and when the \"length\" of paths decreases. It turns out that the square root of the average commute time is a Euclidean distance  and that the pseudoinverse of the Laplacian matrix  is a kernel matrix (its elements are inner products closely related to commute times). A principal component analysis  (PCA) of the graph is introduced for computing the subspace projection of the node vectors in a manner that preserves as much variance as possible in terms of the Euclidean commute-time distance. This graph PCA provides a nice interpretation to the \"Fiedler vector,\" widely used for graph partitioning. The model is evaluated on a collaborative- recommendation task where suggestions are made about which movies people should watch based upon what they watched in the past. Experimental results on the MovieLens database show that the Laplacian-based similarities perform well in comparison with other methods. The model, which nicely fits into the so-called \"statistical relational learning\" framework, could also be used to compute document or word similarities, and, more generally, it could be applied to machine-learning and pattern-recognition tasks involving a relational database.",
    "cite_count": "128",
    "location": {
      "url": "../Journal/22/tkde-ieee-transactions-on-knowledge-and-data-engineering",
      "name": "IEEE Transactions on Knowledge and Data Engineering - TKDE"
    },
    "authors": [
      {
        "name": "François Fouss",
        "msid": "3360618"
      },
      {
        "name": "Alain Pirotte",
        "msid": "674069"
      },
      {
        "name": "Jean-michel Renders",
        "msid": "249717"
      },
      {
        "name": "Marco Saerens",
        "msid": "1174082"
      }
    ],
    "id": "293",
    "msid": "4198036"
  },
  {
    "DOI": "10.1007/s10791-007-9039-3",
    "title": "Features for image retrieval: an experimental comparison",
    "abstract": "An experimental comparison of a large number of dierent image descriptors for content-based image retrieval  is pre- sented. Many of the papers describing new techniques and descriptors for content-based image retrieval  describe their newly proposed methods as most appropriate without giving an in-depth comparison with all methods that were proposed earlier. In this paper , we first give an overview of a large vari- ety of features for content-based image retrieval  and compare them quantitatively on four dierent tasks: stock photo re- trieval, personal photo collection  retrieval, building retrieval, and medical image  retrieval. For the experiments, five dif- ferent, publicly available image databases are used and the retrieval performance of the features is analysed in detail. This allows for a direct comparison of all features consid- ered in this work and furthermore will allow a comparison of newly proposed features to these in the future. Additionally, the correlation of the features is analysed, which opens the way for a simple and intuitive method to find an initial set of suitable features for a new task. The article concludes with recommendations which features perform well for what type of data. Interestingly, the often used, but very simple, colour histogram performs well in the comparison and thus can be recommended as a simple baseline for many applications.",
    "cite_count": "66",
    "location": {
      "url": "../Journal/47/ir-information-retrieval",
      "name": "Information Retrieval - IR"
    },
    "authors": [
      {
        "name": "Thomas Deselaers",
        "msid": "122709"
      },
      {
        "name": "Daniel Keysers",
        "msid": "120324"
      },
      {
        "name": "Hermann Ney",
        "msid": "909672"
      }
    ],
    "id": "294",
    "msid": "4393367"
  },
  {
    "DOI": "10.1504/IJAHUC.2007.014070",
    "title": "A survey on context-aware systems",
    "abstract": "Abstract:Context-aware systems offer entirely new,opportunities for application developers and for end users by gathering,context data and adapting systems behaviour accordingly. Especially incombination,with  mobile ,devices  these  mechanisms ,are  of  high ,value  and ,are  used  to   increase usability  tremendously.  In  this  paper,  we  present  common  architecture  principles  of  context-aware systems  and derive a layered conceptual design  framework,to explain the different elements common  to  most  context-aware  architectures.  Based  on  these  design  principles,  we  introduce various  existing  context-aware  systems   focusing ,on  context-aware  middleware  ,and  frameworks, which  ease  the  development  of  context-aware  applications.  We  discuss  various  approaches,and ,analyse  important ,aspects  in  context-aware  computing ,on  the ,basis  of  the  presented systems. Keywords:context-awarene ss; context framework; context middleware; sensors; context model;",
    "cite_count": "353",
    "location": {
      "url": "../Journal/702/ijahuc-international-journal-of-ad-hoc-and-ubiquitous-computing",
      "name": "International Journal of Ad Hoc and Ubiquitous Computing - IJAHUC"
    },
    "authors": [
      {
        "name": "Matthias Baldauf",
        "msid": "1672098"
      },
      {
        "name": "Schahram Dustdar",
        "msid": "1357196"
      },
      {
        "name": "Florian Rosenberg",
        "msid": "590374"
      }
    ],
    "id": "295",
    "msid": "4428305"
  },
  {
    "DOI": "10.1109/ISAR.2000.880934",
    "title": "Virtual object manipulation on a table-top AR environment",
    "abstract": "We address the problems of virtual object interaction  and user tracking in a table-top augmented reality  (AR) interface. In this setting there is a need for very accurate tracking and registration techniques and an intuitive and useful interface. This is especially true in AR interfaces for supporting face to face  collaboration where users need to be able to easily cooperate with each other. We describe an accurate vision-based tracking method for table-top AR environments and tangible user interface  (TUI) techniques based on this method that allow users to manipulate virtual objects in a natural and intuitive manner. Our approach is robust, allowing users to cover some of the tracking markers while still returning camera viewpoint information, overcoming one of the limitations of traditional computer vision  based systems. After describing this technique we describe its use in prototype AR applications",
    "cite_count": "250",
    "location": {
      "url": "../Conference/90/ismar-international-symposium-on-mixed-and-augmented-reality",
      "name": "International Symposium on Mixed and Augmented Reality - ISMAR"
    },
    "authors": [
      {
        "name": "H. Kato",
        "msid": "2038205"
      },
      {
        "name": "M. Billinghurst",
        "msid": "2433632"
      },
      {
        "name": "I. Poupyrev",
        "msid": "8959"
      },
      {
        "name": "K. Imamoto",
        "msid": "848220"
      },
      {
        "name": "K. Tachibana",
        "msid": "47192203"
      }
    ],
    "id": "296",
    "msid": "10148079"
  },
  {
    "DOI": "10.1016/j.compmedimag.2004.09.010",
    "title": "Automatic categorization of medical images for content-based retrieval and data mining",
    "abstract": "Categorization of medical images means selecting the appropriate class for a given image out of a set of pre-defined categories. This is an important step for data mining  and content-based image retrieval  (CBIR). So far, published approaches are capable to distinguish up to 10 categories. In this paper, we evaluate automatic categorization into more than 80 categories describing the imaging modality and direction as well as the body part and biological system examined. Based on 6231 reference images from hospital routine, 85.5% correctness is obtained combining global texture features  with scaled images. With a frequency of 97.7%, the correct class is within the best ten matches, which is sufficient for medical CBIR applications.",
    "cite_count": "70",
    "location": {
      "url": "../Journal/4497/comput-med-imaging-graph-computerized-medical-imaging-and-graphics",
      "name": "Computerized Medical Imaging and Graphics - COMPUT MED IMAGING GRAPH"
    },
    "authors": [
      {
        "name": "Thomas M. Lehmann",
        "msid": "37637"
      },
      {
        "name": "Mark O. Güld",
        "msid": "1814718"
      },
      {
        "name": "Thomas Deselaers",
        "msid": "122709"
      },
      {
        "name": "Daniel Keysers",
        "msid": "120324"
      },
      {
        "name": "Henning Schubert",
        "msid": "21693390"
      },
      {
        "name": "Klaus Spitzer",
        "msid": "212891"
      },
      {
        "name": "Hermann Ney",
        "msid": "909672"
      },
      {
        "name": "Berthold B. Wein",
        "msid": "498935"
      }
    ],
    "id": "297",
    "msid": "10168480"
  },
  {
    "title": "Comparing Algorithms for Dynamic Speed-Setting of a Low-Power CPU",
    "cite_count": "265",
    "location": {
      "url": "../Conference/172/mobicom-mobile-computing-and-networking",
      "name": "Mobile Computing and Networking - MOBICOM"
    },
    "authors": [
      {
        "name": "Kinshuk Govil",
        "msid": "126720"
      },
      {
        "name": "Edwin Chant",
        "msid": "17934199"
      },
      {
        "name": "Hal Wasserman",
        "msid": "253130"
      }
    ],
    "id": "298",
    "msid": "10397850"
  },
  {
    "title": "Towards the Next Generation of Recommender Systems: A Survey of the State-of-the-Art and Possible Extensions",
    "cite_count": "125",
    "location": {
      "url": "../Journal/22/tkde-ieee-transactions-on-knowledge-and-data-engineering",
      "name": "IEEE Transactions on Knowledge and Data Engineering - TKDE"
    },
    "authors": [
      {
        "name": "Gediminas Adomavicius",
        "msid": "1108192"
      },
      {
        "name": "Alexander Tuzhilin",
        "msid": "326715"
      }
    ],
    "id": "299",
    "msid": "10783517"
  },
  {
    "title": "Providing Architectural Support for Building Context-Aware Applications",
    "cite_count": "481",
    "location": {},
    "authors": [
      {
        "name": "Anind K. Dey",
        "msid": "53218821"
      }
    ],
    "id": "300",
    "msid": "12886782"
  },
  {
    "title": "Computers as Theatre",
    "cite_count": "534",
    "location": {},
    "authors": [
      {
        "name": "Brenda Laurel",
        "msid": "316597"
      }
    ],
    "id": "301",
    "msid": "39255926"
  },
  {
    "DOI": "10.1207/s15327051hci0104_2",
    "title": "Direct Manipulation Interfaces",
    "cite_count": "422",
    "location": {
      "url": "../Journal/4525/human-computer-interaction",
      "name": "Human-computer Interaction"
    },
    "authors": [
      {
        "name": "Edwin Hutchins",
        "msid": "52707153"
      },
      {
        "name": "James Hollan",
        "msid": "1559454"
      },
      {
        "name": "Donald Norman",
        "msid": "1368808"
      }
    ],
    "id": "302",
    "msid": "46937326"
  }
]